/* automatically generated by rust-bindgen 0.71.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize);
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {

pub const _EXCEPTION_DISPOSITION_ExceptionContinueExecution: _EXCEPTION_DISPOSITION = 0;
pub const _EXCEPTION_DISPOSITION_ExceptionContinueSearch: _EXCEPTION_DISPOSITION = 1;
pub const _EXCEPTION_DISPOSITION_ExceptionNestedException: _EXCEPTION_DISPOSITION = 2;
pub const _EXCEPTION_DISPOSITION_ExceptionCollidedUnwind: _EXCEPTION_DISPOSITION = 3;
pub type _EXCEPTION_DISPOSITION = ::std::os::raw::c_int;
pub use self::_EXCEPTION_DISPOSITION as EXCEPTION_DISPOSITION;
unsafe extern "C" {
    pub fn __C_specific_handler(
        ExceptionRecord: *mut _EXCEPTION_RECORD,
        EstablisherFrame: *mut ::std::os::raw::c_void,
        ContextRecord: *mut _CONTEXT,
        DispatcherContext: *mut _DISPATCHER_CONTEXT,
    ) -> EXCEPTION_DISPOSITION;
}
unsafe extern "C" {
    pub fn _exception_code() -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn _exception_info() -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _abnormal_termination() -> ::std::os::raw::c_int;
}
pub type __gnuc_va_list = __builtin_va_list;
pub type ULONG = ::std::os::raw::c_ulong;
pub type PULONG = *mut ULONG;
pub type USHORT = ::std::os::raw::c_ushort;
pub type PUSHORT = *mut USHORT;
pub type UCHAR = ::std::os::raw::c_uchar;
pub type PUCHAR = *mut UCHAR;
pub type PSZ = *mut ::std::os::raw::c_char;
pub type DWORD = ::std::os::raw::c_ulong;
pub type BOOL = ::std::os::raw::c_int;
pub type BYTE = ::std::os::raw::c_uchar;
pub type WORD = ::std::os::raw::c_ushort;
pub type FLOAT = f32;
pub type PFLOAT = *mut FLOAT;
pub type PBOOL = *mut BOOL;
pub type LPBOOL = *mut BOOL;
pub type PBYTE = *mut BYTE;
pub type LPBYTE = *mut BYTE;
pub type PINT = *mut ::std::os::raw::c_int;
pub type LPINT = *mut ::std::os::raw::c_int;
pub type PWORD = *mut WORD;
pub type LPWORD = *mut WORD;
pub type LPLONG = *mut ::std::os::raw::c_long;
pub type PDWORD = *mut DWORD;
pub type LPDWORD = *mut DWORD;
pub type LPVOID = *mut ::std::os::raw::c_void;
pub type LPCVOID = *const ::std::os::raw::c_void;
pub type INT = ::std::os::raw::c_int;
pub type UINT = ::std::os::raw::c_uint;
pub type PUINT = *mut ::std::os::raw::c_uint;
pub type __crt_bool = bool;
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo();
}
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
unsafe extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_data_public"]
        [::std::mem::size_of::<__crt_locale_data_public>() - 16usize];
    ["Alignment of __crt_locale_data_public"]
        [::std::mem::align_of::<__crt_locale_data_public>() - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_pctype"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_pctype) - 0usize];
    ["Offset of field: __crt_locale_data_public::_locale_mb_cur_max"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_mb_cur_max) - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_lc_codepage"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_lc_codepage) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_pointers"][::std::mem::size_of::<__crt_locale_pointers>() - 16usize];
    ["Alignment of __crt_locale_pointers"]
        [::std::mem::align_of::<__crt_locale_pointers>() - 8usize];
    ["Offset of field: __crt_locale_pointers::locinfo"]
        [::std::mem::offset_of!(__crt_locale_pointers, locinfo) - 0usize];
    ["Offset of field: __crt_locale_pointers::mbcinfo"]
        [::std::mem::offset_of!(__crt_locale_pointers, mbcinfo) - 8usize];
};
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::std::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::std::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::std::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::std::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::std::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
unsafe extern "C" {
    pub fn __pctype_func() -> *const ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn __pwctype_func() -> *const wctype_t;
}
unsafe extern "C" {
    pub fn iswalnum(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iswalpha(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iswascii(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iswblank(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iswcntrl(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iswdigit(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iswgraph(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iswlower(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iswprint(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iswpunct(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iswspace(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iswupper(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iswxdigit(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iswcsymf(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iswcsym(_C: wint_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswalnum_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswalpha_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswblank_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswcntrl_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswdigit_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswgraph_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswlower_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswprint_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswpunct_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswspace_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswupper_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswxdigit_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswcsymf_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iswcsym_l(_C: wint_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn towupper(_C: wint_t) -> wint_t;
}
unsafe extern "C" {
    pub fn towlower(_C: wint_t) -> wint_t;
}
unsafe extern "C" {
    pub fn iswctype(_C: wint_t, _Type: wctype_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _towupper_l(_C: wint_t, _Locale: _locale_t) -> wint_t;
}
unsafe extern "C" {
    pub fn _towlower_l(_C: wint_t, _Locale: _locale_t) -> wint_t;
}
unsafe extern "C" {
    pub fn _iswctype_l(_C: wint_t, _Type: wctype_t, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isleadbyte(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isleadbyte_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn is_wctype(_C: wint_t, _Type: wctype_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isctype(
        _C: ::std::os::raw::c_int,
        _Type: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isctype_l(
        _C: ::std::os::raw::c_int,
        _Type: ::std::os::raw::c_int,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isalpha(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isalpha_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isupper(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isupper_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn islower(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _islower_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isdigit(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isdigit_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isxdigit(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isxdigit_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isspace(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isspace_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ispunct(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _ispunct_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isblank(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isblank_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isalnum(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isalnum_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isprint(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isprint_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn isgraph(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _isgraph_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn iscntrl(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _iscntrl_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn toupper(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn tolower(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _tolower(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _tolower_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _toupper(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _toupper_l(_C: ::std::os::raw::c_int, _Locale: _locale_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __isascii(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __toascii(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iscsymf(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __iscsym(_C: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ___mb_cur_max_func() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn ___mb_cur_max_l_func(_Locale: _locale_t) -> ::std::os::raw::c_int;
}
pub type POINTER_64_INT = ::std::os::raw::c_ulonglong;
pub type INT8 = ::std::os::raw::c_schar;
pub type PINT8 = *mut ::std::os::raw::c_schar;
pub type INT16 = ::std::os::raw::c_short;
pub type PINT16 = *mut ::std::os::raw::c_short;
pub type INT32 = ::std::os::raw::c_int;
pub type PINT32 = *mut ::std::os::raw::c_int;
pub type INT64 = ::std::os::raw::c_longlong;
pub type PINT64 = *mut ::std::os::raw::c_longlong;
pub type UINT8 = ::std::os::raw::c_uchar;
pub type PUINT8 = *mut ::std::os::raw::c_uchar;
pub type UINT16 = ::std::os::raw::c_ushort;
pub type PUINT16 = *mut ::std::os::raw::c_ushort;
pub type UINT32 = ::std::os::raw::c_uint;
pub type PUINT32 = *mut ::std::os::raw::c_uint;
pub type UINT64 = ::std::os::raw::c_ulonglong;
pub type PUINT64 = *mut ::std::os::raw::c_ulonglong;
pub type LONG32 = ::std::os::raw::c_int;
pub type PLONG32 = *mut ::std::os::raw::c_int;
pub type ULONG32 = ::std::os::raw::c_uint;
pub type PULONG32 = *mut ::std::os::raw::c_uint;
pub type DWORD32 = ::std::os::raw::c_uint;
pub type PDWORD32 = *mut ::std::os::raw::c_uint;
pub type INT_PTR = ::std::os::raw::c_longlong;
pub type PINT_PTR = *mut ::std::os::raw::c_longlong;
pub type UINT_PTR = ::std::os::raw::c_ulonglong;
pub type PUINT_PTR = *mut ::std::os::raw::c_ulonglong;
pub type LONG_PTR = ::std::os::raw::c_longlong;
pub type PLONG_PTR = *mut ::std::os::raw::c_longlong;
pub type ULONG_PTR = ::std::os::raw::c_ulonglong;
pub type PULONG_PTR = *mut ::std::os::raw::c_ulonglong;
pub type PHANDLE64 = *mut *mut ::std::os::raw::c_void;
pub type SHANDLE_PTR = ::std::os::raw::c_longlong;
pub type HANDLE_PTR = ::std::os::raw::c_ulonglong;
pub type UHALF_PTR = ::std::os::raw::c_uint;
pub type PUHALF_PTR = *mut ::std::os::raw::c_uint;
pub type HALF_PTR = ::std::os::raw::c_int;
pub type PHALF_PTR = *mut ::std::os::raw::c_int;
pub type SIZE_T = ULONG_PTR;
pub type PSIZE_T = *mut ULONG_PTR;
pub type SSIZE_T = LONG_PTR;
pub type PSSIZE_T = *mut LONG_PTR;
pub type DWORD_PTR = ULONG_PTR;
pub type PDWORD_PTR = *mut ULONG_PTR;
pub type LONG64 = ::std::os::raw::c_longlong;
pub type PLONG64 = *mut ::std::os::raw::c_longlong;
pub type ULONG64 = ::std::os::raw::c_ulonglong;
pub type PULONG64 = *mut ::std::os::raw::c_ulonglong;
pub type DWORD64 = ::std::os::raw::c_ulonglong;
pub type PDWORD64 = *mut ::std::os::raw::c_ulonglong;
pub type KAFFINITY = ULONG_PTR;
pub type PKAFFINITY = *mut KAFFINITY;
pub type PVOID = *mut ::std::os::raw::c_void;
pub type CHAR = ::std::os::raw::c_char;
pub type SHORT = ::std::os::raw::c_short;
pub type LONG = ::std::os::raw::c_long;
pub type WCHAR = wchar_t;
pub type PWCHAR = *mut WCHAR;
pub type LPWCH = *mut WCHAR;
pub type PWCH = *mut WCHAR;
pub type LPCWCH = *const WCHAR;
pub type PCWCH = *const WCHAR;
pub type NWPSTR = *mut WCHAR;
pub type LPWSTR = *mut WCHAR;
pub type PWSTR = *mut WCHAR;
pub type PZPWSTR = *mut PWSTR;
pub type PCZPWSTR = *const PWSTR;
pub type LPUWSTR = *mut WCHAR;
pub type PUWSTR = *mut WCHAR;
pub type LPCWSTR = *const WCHAR;
pub type PCWSTR = *const WCHAR;
pub type PZPCWSTR = *mut PCWSTR;
pub type PCZPCWSTR = *const PCWSTR;
pub type LPCUWSTR = *const WCHAR;
pub type PCUWSTR = *const WCHAR;
pub type PZZWSTR = *mut WCHAR;
pub type PCZZWSTR = *const WCHAR;
pub type PUZZWSTR = *mut WCHAR;
pub type PCUZZWSTR = *const WCHAR;
pub type PNZWCH = *mut WCHAR;
pub type PCNZWCH = *const WCHAR;
pub type PUNZWCH = *mut WCHAR;
pub type PCUNZWCH = *const WCHAR;
pub type LPCWCHAR = *const WCHAR;
pub type PCWCHAR = *const WCHAR;
pub type LPCUWCHAR = *const WCHAR;
pub type PCUWCHAR = *const WCHAR;
pub type UCSCHAR = ::std::os::raw::c_ulong;
pub type PUCSCHAR = *mut UCSCHAR;
pub type PCUCSCHAR = *const UCSCHAR;
pub type PUCSSTR = *mut UCSCHAR;
pub type PUUCSSTR = *mut UCSCHAR;
pub type PCUCSSTR = *const UCSCHAR;
pub type PCUUCSSTR = *const UCSCHAR;
pub type PUUCSCHAR = *mut UCSCHAR;
pub type PCUUCSCHAR = *const UCSCHAR;
pub type PCHAR = *mut CHAR;
pub type LPCH = *mut CHAR;
pub type PCH = *mut CHAR;
pub type LPCCH = *const CHAR;
pub type PCCH = *const CHAR;
pub type NPSTR = *mut CHAR;
pub type LPSTR = *mut CHAR;
pub type PSTR = *mut CHAR;
pub type PZPSTR = *mut PSTR;
pub type PCZPSTR = *const PSTR;
pub type LPCSTR = *const CHAR;
pub type PCSTR = *const CHAR;
pub type PZPCSTR = *mut PCSTR;
pub type PCZPCSTR = *const PCSTR;
pub type PZZSTR = *mut CHAR;
pub type PCZZSTR = *const CHAR;
pub type PNZCH = *mut CHAR;
pub type PCNZCH = *const CHAR;
pub type TCHAR = ::std::os::raw::c_char;
pub type PTCHAR = *mut ::std::os::raw::c_char;
pub type TBYTE = ::std::os::raw::c_uchar;
pub type PTBYTE = *mut ::std::os::raw::c_uchar;
pub type LPTCH = LPCH;
pub type PTCH = LPCH;
pub type LPCTCH = LPCCH;
pub type PCTCH = LPCCH;
pub type PTSTR = LPSTR;
pub type LPTSTR = LPSTR;
pub type PUTSTR = LPSTR;
pub type LPUTSTR = LPSTR;
pub type PCTSTR = LPCSTR;
pub type LPCTSTR = LPCSTR;
pub type PCUTSTR = LPCSTR;
pub type LPCUTSTR = LPCSTR;
pub type PZZTSTR = PZZSTR;
pub type PUZZTSTR = PZZSTR;
pub type PCZZTSTR = PCZZSTR;
pub type PCUZZTSTR = PCZZSTR;
pub type PZPTSTR = PZPSTR;
pub type PNZTCH = PNZCH;
pub type PUNZTCH = PNZCH;
pub type PCNZTCH = PCNZCH;
pub type PCUNZTCH = PCNZCH;
pub type PSHORT = *mut SHORT;
pub type PLONG = *mut LONG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PROCESSOR_NUMBER {
    pub Group: WORD,
    pub Number: BYTE,
    pub Reserved: BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _PROCESSOR_NUMBER"][::std::mem::size_of::<_PROCESSOR_NUMBER>() - 4usize];
    ["Alignment of _PROCESSOR_NUMBER"][::std::mem::align_of::<_PROCESSOR_NUMBER>() - 2usize];
    ["Offset of field: _PROCESSOR_NUMBER::Group"]
        [::std::mem::offset_of!(_PROCESSOR_NUMBER, Group) - 0usize];
    ["Offset of field: _PROCESSOR_NUMBER::Number"]
        [::std::mem::offset_of!(_PROCESSOR_NUMBER, Number) - 2usize];
    ["Offset of field: _PROCESSOR_NUMBER::Reserved"]
        [::std::mem::offset_of!(_PROCESSOR_NUMBER, Reserved) - 3usize];
};
pub type PROCESSOR_NUMBER = _PROCESSOR_NUMBER;
pub type PPROCESSOR_NUMBER = *mut _PROCESSOR_NUMBER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GROUP_AFFINITY {
    pub Mask: KAFFINITY,
    pub Group: WORD,
    pub Reserved: [WORD; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GROUP_AFFINITY"][::std::mem::size_of::<_GROUP_AFFINITY>() - 16usize];
    ["Alignment of _GROUP_AFFINITY"][::std::mem::align_of::<_GROUP_AFFINITY>() - 8usize];
    ["Offset of field: _GROUP_AFFINITY::Mask"]
        [::std::mem::offset_of!(_GROUP_AFFINITY, Mask) - 0usize];
    ["Offset of field: _GROUP_AFFINITY::Group"]
        [::std::mem::offset_of!(_GROUP_AFFINITY, Group) - 8usize];
    ["Offset of field: _GROUP_AFFINITY::Reserved"]
        [::std::mem::offset_of!(_GROUP_AFFINITY, Reserved) - 10usize];
};
pub type GROUP_AFFINITY = _GROUP_AFFINITY;
pub type PGROUP_AFFINITY = *mut _GROUP_AFFINITY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GROUP_AFFINITY32 {
    pub Mask: DWORD,
    pub Group: WORD,
    pub Reserved: [WORD; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GROUP_AFFINITY32"][::std::mem::size_of::<_GROUP_AFFINITY32>() - 12usize];
    ["Alignment of _GROUP_AFFINITY32"][::std::mem::align_of::<_GROUP_AFFINITY32>() - 4usize];
    ["Offset of field: _GROUP_AFFINITY32::Mask"]
        [::std::mem::offset_of!(_GROUP_AFFINITY32, Mask) - 0usize];
    ["Offset of field: _GROUP_AFFINITY32::Group"]
        [::std::mem::offset_of!(_GROUP_AFFINITY32, Group) - 4usize];
    ["Offset of field: _GROUP_AFFINITY32::Reserved"]
        [::std::mem::offset_of!(_GROUP_AFFINITY32, Reserved) - 6usize];
};
pub type GROUP_AFFINITY32 = _GROUP_AFFINITY32;
pub type PGROUP_AFFINITY32 = *mut _GROUP_AFFINITY32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GROUP_AFFINITY64 {
    pub Mask: ::std::os::raw::c_ulonglong,
    pub Group: WORD,
    pub Reserved: [WORD; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GROUP_AFFINITY64"][::std::mem::size_of::<_GROUP_AFFINITY64>() - 16usize];
    ["Alignment of _GROUP_AFFINITY64"][::std::mem::align_of::<_GROUP_AFFINITY64>() - 8usize];
    ["Offset of field: _GROUP_AFFINITY64::Mask"]
        [::std::mem::offset_of!(_GROUP_AFFINITY64, Mask) - 0usize];
    ["Offset of field: _GROUP_AFFINITY64::Group"]
        [::std::mem::offset_of!(_GROUP_AFFINITY64, Group) - 8usize];
    ["Offset of field: _GROUP_AFFINITY64::Reserved"]
        [::std::mem::offset_of!(_GROUP_AFFINITY64, Reserved) - 10usize];
};
pub type GROUP_AFFINITY64 = _GROUP_AFFINITY64;
pub type PGROUP_AFFINITY64 = *mut _GROUP_AFFINITY64;
pub type HANDLE = *mut ::std::os::raw::c_void;
pub type PHANDLE = *mut HANDLE;
pub type FCHAR = BYTE;
pub type FSHORT = WORD;
pub type FLONG = DWORD;
pub type HRESULT = ::std::os::raw::c_long;
pub type CCHAR = ::std::os::raw::c_char;
pub type LCID = DWORD;
pub type PLCID = PDWORD;
pub type LANGID = WORD;
pub const COMPARTMENT_ID_UNSPECIFIED_COMPARTMENT_ID: COMPARTMENT_ID = 0;
pub const COMPARTMENT_ID_DEFAULT_COMPARTMENT_ID: COMPARTMENT_ID = 1;
pub type COMPARTMENT_ID = ::std::os::raw::c_int;
pub type PCOMPARTMENT_ID = *mut COMPARTMENT_ID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _FLOAT128 {
    pub LowPart: ::std::os::raw::c_longlong,
    pub HighPart: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _FLOAT128"][::std::mem::size_of::<_FLOAT128>() - 16usize];
    ["Alignment of _FLOAT128"][::std::mem::align_of::<_FLOAT128>() - 8usize];
    ["Offset of field: _FLOAT128::LowPart"][::std::mem::offset_of!(_FLOAT128, LowPart) - 0usize];
    ["Offset of field: _FLOAT128::HighPart"][::std::mem::offset_of!(_FLOAT128, HighPart) - 8usize];
};
pub type FLOAT128 = _FLOAT128;
pub type PFLOAT128 = *mut FLOAT128;
pub type LONGLONG = ::std::os::raw::c_longlong;
pub type ULONGLONG = ::std::os::raw::c_ulonglong;
pub type PLONGLONG = *mut LONGLONG;
pub type PULONGLONG = *mut ULONGLONG;
pub type USN = LONGLONG;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _LARGE_INTEGER {
    pub __bindgen_anon_1: _LARGE_INTEGER__bindgen_ty_1,
    pub u: _LARGE_INTEGER__bindgen_ty_2,
    pub QuadPart: LONGLONG,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LARGE_INTEGER__bindgen_ty_1 {
    pub LowPart: DWORD,
    pub HighPart: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LARGE_INTEGER__bindgen_ty_1"]
        [::std::mem::size_of::<_LARGE_INTEGER__bindgen_ty_1>() - 8usize];
    ["Alignment of _LARGE_INTEGER__bindgen_ty_1"]
        [::std::mem::align_of::<_LARGE_INTEGER__bindgen_ty_1>() - 4usize];
    ["Offset of field: _LARGE_INTEGER__bindgen_ty_1::LowPart"]
        [::std::mem::offset_of!(_LARGE_INTEGER__bindgen_ty_1, LowPart) - 0usize];
    ["Offset of field: _LARGE_INTEGER__bindgen_ty_1::HighPart"]
        [::std::mem::offset_of!(_LARGE_INTEGER__bindgen_ty_1, HighPart) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LARGE_INTEGER__bindgen_ty_2 {
    pub LowPart: DWORD,
    pub HighPart: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LARGE_INTEGER__bindgen_ty_2"]
        [::std::mem::size_of::<_LARGE_INTEGER__bindgen_ty_2>() - 8usize];
    ["Alignment of _LARGE_INTEGER__bindgen_ty_2"]
        [::std::mem::align_of::<_LARGE_INTEGER__bindgen_ty_2>() - 4usize];
    ["Offset of field: _LARGE_INTEGER__bindgen_ty_2::LowPart"]
        [::std::mem::offset_of!(_LARGE_INTEGER__bindgen_ty_2, LowPart) - 0usize];
    ["Offset of field: _LARGE_INTEGER__bindgen_ty_2::HighPart"]
        [::std::mem::offset_of!(_LARGE_INTEGER__bindgen_ty_2, HighPart) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LARGE_INTEGER"][::std::mem::size_of::<_LARGE_INTEGER>() - 8usize];
    ["Alignment of _LARGE_INTEGER"][::std::mem::align_of::<_LARGE_INTEGER>() - 8usize];
    ["Offset of field: _LARGE_INTEGER::u"][::std::mem::offset_of!(_LARGE_INTEGER, u) - 0usize];
    ["Offset of field: _LARGE_INTEGER::QuadPart"]
        [::std::mem::offset_of!(_LARGE_INTEGER, QuadPart) - 0usize];
};
pub type LARGE_INTEGER = _LARGE_INTEGER;
pub type PLARGE_INTEGER = *mut LARGE_INTEGER;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ULARGE_INTEGER {
    pub __bindgen_anon_1: _ULARGE_INTEGER__bindgen_ty_1,
    pub u: _ULARGE_INTEGER__bindgen_ty_2,
    pub QuadPart: ULONGLONG,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ULARGE_INTEGER__bindgen_ty_1 {
    pub LowPart: DWORD,
    pub HighPart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ULARGE_INTEGER__bindgen_ty_1"]
        [::std::mem::size_of::<_ULARGE_INTEGER__bindgen_ty_1>() - 8usize];
    ["Alignment of _ULARGE_INTEGER__bindgen_ty_1"]
        [::std::mem::align_of::<_ULARGE_INTEGER__bindgen_ty_1>() - 4usize];
    ["Offset of field: _ULARGE_INTEGER__bindgen_ty_1::LowPart"]
        [::std::mem::offset_of!(_ULARGE_INTEGER__bindgen_ty_1, LowPart) - 0usize];
    ["Offset of field: _ULARGE_INTEGER__bindgen_ty_1::HighPart"]
        [::std::mem::offset_of!(_ULARGE_INTEGER__bindgen_ty_1, HighPart) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ULARGE_INTEGER__bindgen_ty_2 {
    pub LowPart: DWORD,
    pub HighPart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ULARGE_INTEGER__bindgen_ty_2"]
        [::std::mem::size_of::<_ULARGE_INTEGER__bindgen_ty_2>() - 8usize];
    ["Alignment of _ULARGE_INTEGER__bindgen_ty_2"]
        [::std::mem::align_of::<_ULARGE_INTEGER__bindgen_ty_2>() - 4usize];
    ["Offset of field: _ULARGE_INTEGER__bindgen_ty_2::LowPart"]
        [::std::mem::offset_of!(_ULARGE_INTEGER__bindgen_ty_2, LowPart) - 0usize];
    ["Offset of field: _ULARGE_INTEGER__bindgen_ty_2::HighPart"]
        [::std::mem::offset_of!(_ULARGE_INTEGER__bindgen_ty_2, HighPart) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ULARGE_INTEGER"][::std::mem::size_of::<_ULARGE_INTEGER>() - 8usize];
    ["Alignment of _ULARGE_INTEGER"][::std::mem::align_of::<_ULARGE_INTEGER>() - 8usize];
    ["Offset of field: _ULARGE_INTEGER::u"][::std::mem::offset_of!(_ULARGE_INTEGER, u) - 0usize];
    ["Offset of field: _ULARGE_INTEGER::QuadPart"]
        [::std::mem::offset_of!(_ULARGE_INTEGER, QuadPart) - 0usize];
};
pub type ULARGE_INTEGER = _ULARGE_INTEGER;
pub type PULARGE_INTEGER = *mut ULARGE_INTEGER;
pub type RTL_REFERENCE_COUNT = LONG_PTR;
pub type PRTL_REFERENCE_COUNT = *mut LONG_PTR;
pub type RTL_REFERENCE_COUNT32 = LONG;
pub type PRTL_REFERENCE_COUNT32 = *mut LONG;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LUID {
    pub LowPart: DWORD,
    pub HighPart: LONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LUID"][::std::mem::size_of::<_LUID>() - 8usize];
    ["Alignment of _LUID"][::std::mem::align_of::<_LUID>() - 4usize];
    ["Offset of field: _LUID::LowPart"][::std::mem::offset_of!(_LUID, LowPart) - 0usize];
    ["Offset of field: _LUID::HighPart"][::std::mem::offset_of!(_LUID, HighPart) - 4usize];
};
pub type LUID = _LUID;
pub type PLUID = *mut _LUID;
pub type DWORDLONG = ULONGLONG;
pub type PDWORDLONG = *mut DWORDLONG;
unsafe extern "C" {
    pub fn _rotl8(
        Value: ::std::os::raw::c_uchar,
        Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _rotl16(
        Value: ::std::os::raw::c_ushort,
        Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn _rotr8(
        Value: ::std::os::raw::c_uchar,
        Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _rotr16(
        Value: ::std::os::raw::c_ushort,
        Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn _rotl(
        Value: ::std::os::raw::c_uint,
        Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _rotl64(
        Value: ::std::os::raw::c_ulonglong,
        Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _rotr(
        Value: ::std::os::raw::c_uint,
        Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _rotr64(
        Value: ::std::os::raw::c_ulonglong,
        Shift: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
pub type BOOLEAN = BYTE;
pub type PBOOLEAN = *mut BOOLEAN;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LIST_ENTRY {
    pub Flink: *mut _LIST_ENTRY,
    pub Blink: *mut _LIST_ENTRY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LIST_ENTRY"][::std::mem::size_of::<_LIST_ENTRY>() - 16usize];
    ["Alignment of _LIST_ENTRY"][::std::mem::align_of::<_LIST_ENTRY>() - 8usize];
    ["Offset of field: _LIST_ENTRY::Flink"][::std::mem::offset_of!(_LIST_ENTRY, Flink) - 0usize];
    ["Offset of field: _LIST_ENTRY::Blink"][::std::mem::offset_of!(_LIST_ENTRY, Blink) - 8usize];
};
pub type LIST_ENTRY = _LIST_ENTRY;
pub type PLIST_ENTRY = *mut _LIST_ENTRY;
pub type PRLIST_ENTRY = *mut _LIST_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SINGLE_LIST_ENTRY {
    pub Next: *mut _SINGLE_LIST_ENTRY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SINGLE_LIST_ENTRY"][::std::mem::size_of::<_SINGLE_LIST_ENTRY>() - 8usize];
    ["Alignment of _SINGLE_LIST_ENTRY"][::std::mem::align_of::<_SINGLE_LIST_ENTRY>() - 8usize];
    ["Offset of field: _SINGLE_LIST_ENTRY::Next"]
        [::std::mem::offset_of!(_SINGLE_LIST_ENTRY, Next) - 0usize];
};
pub type SINGLE_LIST_ENTRY = _SINGLE_LIST_ENTRY;
pub type PSINGLE_LIST_ENTRY = *mut _SINGLE_LIST_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LIST_ENTRY32 {
    pub Flink: DWORD,
    pub Blink: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LIST_ENTRY32"][::std::mem::size_of::<LIST_ENTRY32>() - 8usize];
    ["Alignment of LIST_ENTRY32"][::std::mem::align_of::<LIST_ENTRY32>() - 4usize];
    ["Offset of field: LIST_ENTRY32::Flink"][::std::mem::offset_of!(LIST_ENTRY32, Flink) - 0usize];
    ["Offset of field: LIST_ENTRY32::Blink"][::std::mem::offset_of!(LIST_ENTRY32, Blink) - 4usize];
};
pub type PLIST_ENTRY32 = *mut LIST_ENTRY32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct LIST_ENTRY64 {
    pub Flink: ULONGLONG,
    pub Blink: ULONGLONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of LIST_ENTRY64"][::std::mem::size_of::<LIST_ENTRY64>() - 16usize];
    ["Alignment of LIST_ENTRY64"][::std::mem::align_of::<LIST_ENTRY64>() - 8usize];
    ["Offset of field: LIST_ENTRY64::Flink"][::std::mem::offset_of!(LIST_ENTRY64, Flink) - 0usize];
    ["Offset of field: LIST_ENTRY64::Blink"][::std::mem::offset_of!(LIST_ENTRY64, Blink) - 8usize];
};
pub type PLIST_ENTRY64 = *mut LIST_ENTRY64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GUID {
    pub Data1: ::std::os::raw::c_ulong,
    pub Data2: ::std::os::raw::c_ushort,
    pub Data3: ::std::os::raw::c_ushort,
    pub Data4: [::std::os::raw::c_uchar; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GUID"][::std::mem::size_of::<_GUID>() - 16usize];
    ["Alignment of _GUID"][::std::mem::align_of::<_GUID>() - 4usize];
    ["Offset of field: _GUID::Data1"][::std::mem::offset_of!(_GUID, Data1) - 0usize];
    ["Offset of field: _GUID::Data2"][::std::mem::offset_of!(_GUID, Data2) - 4usize];
    ["Offset of field: _GUID::Data3"][::std::mem::offset_of!(_GUID, Data3) - 6usize];
    ["Offset of field: _GUID::Data4"][::std::mem::offset_of!(_GUID, Data4) - 8usize];
};
pub type GUID = _GUID;
pub type LPGUID = *mut GUID;
pub type LPCGUID = *const GUID;
pub type IID = GUID;
pub type LPIID = *mut IID;
pub type CLSID = GUID;
pub type LPCLSID = *mut CLSID;
pub type FMTID = GUID;
pub type LPFMTID = *mut FMTID;
unsafe extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
unsafe extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
unsafe extern "C" {
    pub fn __doserrno() -> *mut ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn _set_doserrno(_Value: ::std::os::raw::c_ulong) -> errno_t;
}
unsafe extern "C" {
    pub fn _get_doserrno(_Value: *mut ::std::os::raw::c_ulong) -> errno_t;
}
unsafe extern "C" {
    pub fn memchr(
        _Buf: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _MaxCount: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memcmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memcpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memmove(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memset(
        _Dst: *mut ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strchr(
        _Str: *const ::std::os::raw::c_char,
        _Val: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strrchr(
        _Str: *const ::std::os::raw::c_char,
        _Ch: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strstr(
        _Str: *const ::std::os::raw::c_char,
        _SubStr: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn wcschr(
        _Str: *const ::std::os::raw::c_ushort,
        _Ch: ::std::os::raw::c_ushort,
    ) -> *mut ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn wcsrchr(_Str: *const wchar_t, _Ch: wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsstr(_Str: *const wchar_t, _SubStr: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _memicmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _memicmp_l(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn memccpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _Size: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn memicmp(
        _Buf1: *const ::std::os::raw::c_void,
        _Buf2: *const ::std::os::raw::c_void,
        _Size: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wcscat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcscpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcsncat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcsncpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn wcstok_s(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcscat(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcscmp(
        _String1: *const ::std::os::raw::c_ushort,
        _String2: *const ::std::os::raw::c_ushort,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wcscpy(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcscspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
unsafe extern "C" {
    pub fn wcslen(_String: *const ::std::os::raw::c_ushort) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn wcsnlen(_Source: *const wchar_t, _MaxCount: usize) -> usize;
}
unsafe extern "C" {
    pub fn wcsncat(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsncmp(
        _String1: *const ::std::os::raw::c_ushort,
        _String2: *const ::std::os::raw::c_ushort,
        _MaxCount: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wcsncpy(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcspbrk(_String: *const wchar_t, _Control: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
unsafe extern "C" {
    pub fn wcstok(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcserror(_ErrorNumber: ::std::os::raw::c_int) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcserror_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _ErrorNumber: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn __wcserror(_String: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn __wcserror_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _ErrorMessage: *const wchar_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wcsicmp_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wcsnicmp(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wcsnicmp_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wcsnset_s(
        _Destination: *mut wchar_t,
        _SizeInWords: usize,
        _Value: wchar_t,
        _MaxCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcsset_s(_Destination: *mut wchar_t, _SizeInWords: usize, _Value: wchar_t) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcslwr_s(_String: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcslwr_s_l(_String: *mut wchar_t, _SizeInWords: usize, _Locale: _locale_t) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcslwr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcsupr_s(_String: *mut wchar_t, _Size: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn _wcsupr_s_l(_String: *mut wchar_t, _Size: usize, _Locale: _locale_t) -> errno_t;
}
unsafe extern "C" {
    pub fn _wcsupr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsxfrm(_Destination: *mut wchar_t, _Source: *const wchar_t, _MaxCount: usize) -> usize;
}
unsafe extern "C" {
    pub fn _wcsxfrm_l(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn wcscoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wcscoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wcsicoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wcsncoll(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wcsncoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wcsnicoll(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _wcsnicoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wcsnicmp(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
unsafe extern "C" {
    pub fn wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcpy_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strcat_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strerror_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _ErrorNumber: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strncat_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strncpy_s(
        _Destination: *mut ::std::os::raw::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strtok_s(
        _String: *mut ::std::os::raw::c_char,
        _Delimiter: *const ::std::os::raw::c_char,
        _Context: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _memccpy(
        _Dst: *mut ::std::os::raw::c_void,
        _Src: *const ::std::os::raw::c_void,
        _Val: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn strcat(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcmp(
        _Str1: *const ::std::os::raw::c_char,
        _Str2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _strcmpi(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _strcoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strcpy(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcspn(
        _Str: *const ::std::os::raw::c_char,
        _Control: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _strdup(_Source: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _strerror(_ErrorMessage: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _strerror_s(
        _Buffer: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _ErrorMessage: *const ::std::os::raw::c_char,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn strerror(_ErrorMessage: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _stricmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _stricoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _stricoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _stricmp_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strlen(_Str: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _strlwr_s(_String: *mut ::std::os::raw::c_char, _Size: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _strlwr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _strlwr_s_l(
        _String: *mut ::std::os::raw::c_char,
        _Size: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _strlwr_l(
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncat(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _Count: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strncmp(
        _Str1: *const ::std::os::raw::c_char,
        _Str2: *const ::std::os::raw::c_char,
        _MaxCount: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _strnicmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _strnicmp_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _strnicoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _strnicoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _strncoll(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn _strncoll_l(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn __strncnt(_String: *const ::std::os::raw::c_char, _Count: usize) -> usize;
}
unsafe extern "C" {
    pub fn strncpy(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _Count: ::std::os::raw::c_ulonglong,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strnlen(_String: *const ::std::os::raw::c_char, _MaxCount: usize) -> usize;
}
unsafe extern "C" {
    pub fn _strnset_s(
        _String: *mut ::std::os::raw::c_char,
        _SizeInBytes: usize,
        _Value: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _strnset(
        _Destination: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
        _Count: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strpbrk(
        _Str: *const ::std::os::raw::c_char,
        _Control: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _strrev(_Str: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _strset_s(
        _Destination: *mut ::std::os::raw::c_char,
        _DestinationSize: usize,
        _Value: ::std::os::raw::c_int,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _strset(
        _Destination: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strspn(
        _Str: *const ::std::os::raw::c_char,
        _Control: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn strtok(
        _String: *mut ::std::os::raw::c_char,
        _Delimiter: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _strupr_s(_String: *mut ::std::os::raw::c_char, _Size: usize) -> errno_t;
}
unsafe extern "C" {
    pub fn _strupr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _strupr_s_l(
        _String: *mut ::std::os::raw::c_char,
        _Size: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
unsafe extern "C" {
    pub fn _strupr_l(
        _String: *mut ::std::os::raw::c_char,
        _Locale: _locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strxfrm(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _strxfrm_l(
        _Destination: *mut ::std::os::raw::c_char,
        _Source: *const ::std::os::raw::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
unsafe extern "C" {
    pub fn strdup(_String: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strcmpi(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn stricmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strlwr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strnicmp(
        _String1: *const ::std::os::raw::c_char,
        _String2: *const ::std::os::raw::c_char,
        _MaxCount: usize,
    ) -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn strnset(
        _String: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
        _MaxCount: usize,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strrev(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strset(
        _String: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn strupr(_String: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _OBJECTID {
    pub Lineage: GUID,
    pub Uniquifier: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _OBJECTID"][::std::mem::size_of::<_OBJECTID>() - 20usize];
    ["Alignment of _OBJECTID"][::std::mem::align_of::<_OBJECTID>() - 4usize];
    ["Offset of field: _OBJECTID::Lineage"][::std::mem::offset_of!(_OBJECTID, Lineage) - 0usize];
    ["Offset of field: _OBJECTID::Uniquifier"]
        [::std::mem::offset_of!(_OBJECTID, Uniquifier) - 16usize];
};
pub type OBJECTID = _OBJECTID;
pub type PEXCEPTION_ROUTINE = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut _EXCEPTION_RECORD,
        arg2: PVOID,
        arg3: *mut _CONTEXT,
        arg4: PVOID,
    ) -> EXCEPTION_DISPOSITION,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _bindgen_ty_1 {
    pub x: ::std::os::raw::c_char,
    pub test: LARGE_INTEGER,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_ty_1"][::std::mem::size_of::<_bindgen_ty_1>() - 16usize];
    ["Alignment of _bindgen_ty_1"][::std::mem::align_of::<_bindgen_ty_1>() - 8usize];
    ["Offset of field: _bindgen_ty_1::x"][::std::mem::offset_of!(_bindgen_ty_1, x) - 0usize];
    ["Offset of field: _bindgen_ty_1::test"][::std::mem::offset_of!(_bindgen_ty_1, test) - 8usize];
};
pub type __C_ASSERT__ = [::std::os::raw::c_char; 1usize];
pub type KSPIN_LOCK = ULONG_PTR;
pub type PKSPIN_LOCK = *mut KSPIN_LOCK;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _M128A {
    pub Low: ULONGLONG,
    pub High: LONGLONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _M128A"][::std::mem::size_of::<_M128A>() - 16usize];
    ["Alignment of _M128A"][::std::mem::align_of::<_M128A>() - 16usize];
    ["Offset of field: _M128A::Low"][::std::mem::offset_of!(_M128A, Low) - 0usize];
    ["Offset of field: _M128A::High"][::std::mem::offset_of!(_M128A, High) - 8usize];
};
pub type M128A = _M128A;
pub type PM128A = *mut _M128A;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _XSAVE_FORMAT {
    pub ControlWord: WORD,
    pub StatusWord: WORD,
    pub TagWord: BYTE,
    pub Reserved1: BYTE,
    pub ErrorOpcode: WORD,
    pub ErrorOffset: DWORD,
    pub ErrorSelector: WORD,
    pub Reserved2: WORD,
    pub DataOffset: DWORD,
    pub DataSelector: WORD,
    pub Reserved3: WORD,
    pub MxCsr: DWORD,
    pub MxCsr_Mask: DWORD,
    pub FloatRegisters: [M128A; 8usize],
    pub XmmRegisters: [M128A; 16usize],
    pub Reserved4: [BYTE; 96usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XSAVE_FORMAT"][::std::mem::size_of::<_XSAVE_FORMAT>() - 512usize];
    ["Alignment of _XSAVE_FORMAT"][::std::mem::align_of::<_XSAVE_FORMAT>() - 16usize];
    ["Offset of field: _XSAVE_FORMAT::ControlWord"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, ControlWord) - 0usize];
    ["Offset of field: _XSAVE_FORMAT::StatusWord"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, StatusWord) - 2usize];
    ["Offset of field: _XSAVE_FORMAT::TagWord"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, TagWord) - 4usize];
    ["Offset of field: _XSAVE_FORMAT::Reserved1"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, Reserved1) - 5usize];
    ["Offset of field: _XSAVE_FORMAT::ErrorOpcode"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, ErrorOpcode) - 6usize];
    ["Offset of field: _XSAVE_FORMAT::ErrorOffset"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, ErrorOffset) - 8usize];
    ["Offset of field: _XSAVE_FORMAT::ErrorSelector"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, ErrorSelector) - 12usize];
    ["Offset of field: _XSAVE_FORMAT::Reserved2"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, Reserved2) - 14usize];
    ["Offset of field: _XSAVE_FORMAT::DataOffset"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, DataOffset) - 16usize];
    ["Offset of field: _XSAVE_FORMAT::DataSelector"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, DataSelector) - 20usize];
    ["Offset of field: _XSAVE_FORMAT::Reserved3"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, Reserved3) - 22usize];
    ["Offset of field: _XSAVE_FORMAT::MxCsr"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, MxCsr) - 24usize];
    ["Offset of field: _XSAVE_FORMAT::MxCsr_Mask"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, MxCsr_Mask) - 28usize];
    ["Offset of field: _XSAVE_FORMAT::FloatRegisters"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, FloatRegisters) - 32usize];
    ["Offset of field: _XSAVE_FORMAT::XmmRegisters"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, XmmRegisters) - 160usize];
    ["Offset of field: _XSAVE_FORMAT::Reserved4"]
        [::std::mem::offset_of!(_XSAVE_FORMAT, Reserved4) - 416usize];
};
pub type XSAVE_FORMAT = _XSAVE_FORMAT;
pub type PXSAVE_FORMAT = *mut _XSAVE_FORMAT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XSAVE_CET_U_FORMAT {
    pub Ia32CetUMsr: DWORD64,
    pub Ia32Pl3SspMsr: DWORD64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XSAVE_CET_U_FORMAT"][::std::mem::size_of::<_XSAVE_CET_U_FORMAT>() - 16usize];
    ["Alignment of _XSAVE_CET_U_FORMAT"][::std::mem::align_of::<_XSAVE_CET_U_FORMAT>() - 8usize];
    ["Offset of field: _XSAVE_CET_U_FORMAT::Ia32CetUMsr"]
        [::std::mem::offset_of!(_XSAVE_CET_U_FORMAT, Ia32CetUMsr) - 0usize];
    ["Offset of field: _XSAVE_CET_U_FORMAT::Ia32Pl3SspMsr"]
        [::std::mem::offset_of!(_XSAVE_CET_U_FORMAT, Ia32Pl3SspMsr) - 8usize];
};
pub type XSAVE_CET_U_FORMAT = _XSAVE_CET_U_FORMAT;
pub type PXSAVE_CET_U_FORMAT = *mut _XSAVE_CET_U_FORMAT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XSAVE_ARM64_SVE_HEADER {
    pub VectorLength: DWORD,
    pub VectorRegisterOffset: DWORD,
    pub PredicateRegisterOffset: DWORD,
    pub Reserved: [DWORD; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XSAVE_ARM64_SVE_HEADER"][::std::mem::size_of::<_XSAVE_ARM64_SVE_HEADER>() - 32usize];
    ["Alignment of _XSAVE_ARM64_SVE_HEADER"]
        [::std::mem::align_of::<_XSAVE_ARM64_SVE_HEADER>() - 4usize];
    ["Offset of field: _XSAVE_ARM64_SVE_HEADER::VectorLength"]
        [::std::mem::offset_of!(_XSAVE_ARM64_SVE_HEADER, VectorLength) - 0usize];
    ["Offset of field: _XSAVE_ARM64_SVE_HEADER::VectorRegisterOffset"]
        [::std::mem::offset_of!(_XSAVE_ARM64_SVE_HEADER, VectorRegisterOffset) - 4usize];
    ["Offset of field: _XSAVE_ARM64_SVE_HEADER::PredicateRegisterOffset"]
        [::std::mem::offset_of!(_XSAVE_ARM64_SVE_HEADER, PredicateRegisterOffset) - 8usize];
    ["Offset of field: _XSAVE_ARM64_SVE_HEADER::Reserved"]
        [::std::mem::offset_of!(_XSAVE_ARM64_SVE_HEADER, Reserved) - 12usize];
};
pub type XSAVE_ARM64_SVE_HEADER = _XSAVE_ARM64_SVE_HEADER;
pub type PXSAVE_ARM64_SVE_HEADER = *mut _XSAVE_ARM64_SVE_HEADER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XSAVE_AREA_HEADER {
    pub Mask: DWORD64,
    pub CompactionMask: DWORD64,
    pub Reserved2: [DWORD64; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XSAVE_AREA_HEADER"][::std::mem::size_of::<_XSAVE_AREA_HEADER>() - 64usize];
    ["Alignment of _XSAVE_AREA_HEADER"][::std::mem::align_of::<_XSAVE_AREA_HEADER>() - 8usize];
    ["Offset of field: _XSAVE_AREA_HEADER::Mask"]
        [::std::mem::offset_of!(_XSAVE_AREA_HEADER, Mask) - 0usize];
    ["Offset of field: _XSAVE_AREA_HEADER::CompactionMask"]
        [::std::mem::offset_of!(_XSAVE_AREA_HEADER, CompactionMask) - 8usize];
    ["Offset of field: _XSAVE_AREA_HEADER::Reserved2"]
        [::std::mem::offset_of!(_XSAVE_AREA_HEADER, Reserved2) - 16usize];
};
pub type XSAVE_AREA_HEADER = _XSAVE_AREA_HEADER;
pub type PXSAVE_AREA_HEADER = *mut _XSAVE_AREA_HEADER;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _XSAVE_AREA {
    pub LegacyState: XSAVE_FORMAT,
    pub Header: XSAVE_AREA_HEADER,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XSAVE_AREA"][::std::mem::size_of::<_XSAVE_AREA>() - 576usize];
    ["Alignment of _XSAVE_AREA"][::std::mem::align_of::<_XSAVE_AREA>() - 16usize];
    ["Offset of field: _XSAVE_AREA::LegacyState"]
        [::std::mem::offset_of!(_XSAVE_AREA, LegacyState) - 0usize];
    ["Offset of field: _XSAVE_AREA::Header"]
        [::std::mem::offset_of!(_XSAVE_AREA, Header) - 512usize];
};
pub type XSAVE_AREA = _XSAVE_AREA;
pub type PXSAVE_AREA = *mut _XSAVE_AREA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XSTATE_CONTEXT {
    pub Mask: DWORD64,
    pub Length: DWORD,
    pub Flags: BYTE,
    pub Reserved0: [BYTE; 3usize],
    pub Area: PXSAVE_AREA,
    pub Buffer: PVOID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XSTATE_CONTEXT"][::std::mem::size_of::<_XSTATE_CONTEXT>() - 32usize];
    ["Alignment of _XSTATE_CONTEXT"][::std::mem::align_of::<_XSTATE_CONTEXT>() - 8usize];
    ["Offset of field: _XSTATE_CONTEXT::Mask"]
        [::std::mem::offset_of!(_XSTATE_CONTEXT, Mask) - 0usize];
    ["Offset of field: _XSTATE_CONTEXT::Length"]
        [::std::mem::offset_of!(_XSTATE_CONTEXT, Length) - 8usize];
    ["Offset of field: _XSTATE_CONTEXT::Flags"]
        [::std::mem::offset_of!(_XSTATE_CONTEXT, Flags) - 12usize];
    ["Offset of field: _XSTATE_CONTEXT::Reserved0"]
        [::std::mem::offset_of!(_XSTATE_CONTEXT, Reserved0) - 13usize];
    ["Offset of field: _XSTATE_CONTEXT::Area"]
        [::std::mem::offset_of!(_XSTATE_CONTEXT, Area) - 16usize];
    ["Offset of field: _XSTATE_CONTEXT::Buffer"]
        [::std::mem::offset_of!(_XSTATE_CONTEXT, Buffer) - 24usize];
};
pub type XSTATE_CONTEXT = _XSTATE_CONTEXT;
pub type PXSTATE_CONTEXT = *mut _XSTATE_CONTEXT;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _KERNEL_CET_CONTEXT {
    pub Ssp: DWORD64,
    pub Rip: DWORD64,
    pub SegCs: WORD,
    pub __bindgen_anon_1: _KERNEL_CET_CONTEXT__bindgen_ty_1,
    pub Fill: [WORD; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _KERNEL_CET_CONTEXT__bindgen_ty_1 {
    pub AllFlags: WORD,
    pub __bindgen_anon_1: _KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1 {
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1>() - 2usize];
    ["Alignment of _KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1>() - 2usize];
};
impl _KERNEL_CET_CONTEXT__bindgen_ty_1__bindgen_ty_1 {
    #[inline]
    pub fn UseWrss(&self) -> WORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_UseWrss(&mut self, val: WORD) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn UseWrss_raw(this: *const Self) -> WORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_UseWrss_raw(this: *mut Self, val: WORD) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn PopShadowStackOne(&self) -> WORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_PopShadowStackOne(&mut self, val: WORD) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn PopShadowStackOne_raw(this: *const Self) -> WORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_PopShadowStackOne_raw(this: *mut Self, val: WORD) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Unused(&self) -> WORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 14u8) as u16) }
    }
    #[inline]
    pub fn set_Unused(&mut self, val: WORD) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 14u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Unused_raw(this: *const Self) -> WORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 2usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                14u8,
            ) as u16)
        }
    }
    #[inline]
    pub unsafe fn set_Unused_raw(this: *mut Self, val: WORD) {
        unsafe {
            let val: u16 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 2usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                14u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        UseWrss: WORD,
        PopShadowStackOne: WORD,
        Unused: WORD,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let UseWrss: u16 = unsafe { ::std::mem::transmute(UseWrss) };
            UseWrss as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let PopShadowStackOne: u16 = unsafe { ::std::mem::transmute(PopShadowStackOne) };
            PopShadowStackOne as u64
        });
        __bindgen_bitfield_unit.set(2usize, 14u8, {
            let Unused: u16 = unsafe { ::std::mem::transmute(Unused) };
            Unused as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KERNEL_CET_CONTEXT__bindgen_ty_1"]
        [::std::mem::size_of::<_KERNEL_CET_CONTEXT__bindgen_ty_1>() - 2usize];
    ["Alignment of _KERNEL_CET_CONTEXT__bindgen_ty_1"]
        [::std::mem::align_of::<_KERNEL_CET_CONTEXT__bindgen_ty_1>() - 2usize];
    ["Offset of field: _KERNEL_CET_CONTEXT__bindgen_ty_1::AllFlags"]
        [::std::mem::offset_of!(_KERNEL_CET_CONTEXT__bindgen_ty_1, AllFlags) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KERNEL_CET_CONTEXT"][::std::mem::size_of::<_KERNEL_CET_CONTEXT>() - 24usize];
    ["Alignment of _KERNEL_CET_CONTEXT"][::std::mem::align_of::<_KERNEL_CET_CONTEXT>() - 8usize];
    ["Offset of field: _KERNEL_CET_CONTEXT::Ssp"]
        [::std::mem::offset_of!(_KERNEL_CET_CONTEXT, Ssp) - 0usize];
    ["Offset of field: _KERNEL_CET_CONTEXT::Rip"]
        [::std::mem::offset_of!(_KERNEL_CET_CONTEXT, Rip) - 8usize];
    ["Offset of field: _KERNEL_CET_CONTEXT::SegCs"]
        [::std::mem::offset_of!(_KERNEL_CET_CONTEXT, SegCs) - 16usize];
    ["Offset of field: _KERNEL_CET_CONTEXT::Fill"]
        [::std::mem::offset_of!(_KERNEL_CET_CONTEXT, Fill) - 20usize];
};
pub type KERNEL_CET_CONTEXT = _KERNEL_CET_CONTEXT;
pub type PKERNEL_CET_CONTEXT = *mut _KERNEL_CET_CONTEXT;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_AMD64 {
    pub Count: DWORD,
    pub ScopeRecord: [_SCOPE_TABLE_AMD64__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_AMD64__bindgen_ty_1 {
    pub BeginAddress: DWORD,
    pub EndAddress: DWORD,
    pub HandlerAddress: DWORD,
    pub JumpTarget: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SCOPE_TABLE_AMD64__bindgen_ty_1"]
        [::std::mem::size_of::<_SCOPE_TABLE_AMD64__bindgen_ty_1>() - 16usize];
    ["Alignment of _SCOPE_TABLE_AMD64__bindgen_ty_1"]
        [::std::mem::align_of::<_SCOPE_TABLE_AMD64__bindgen_ty_1>() - 4usize];
    ["Offset of field: _SCOPE_TABLE_AMD64__bindgen_ty_1::BeginAddress"]
        [::std::mem::offset_of!(_SCOPE_TABLE_AMD64__bindgen_ty_1, BeginAddress) - 0usize];
    ["Offset of field: _SCOPE_TABLE_AMD64__bindgen_ty_1::EndAddress"]
        [::std::mem::offset_of!(_SCOPE_TABLE_AMD64__bindgen_ty_1, EndAddress) - 4usize];
    ["Offset of field: _SCOPE_TABLE_AMD64__bindgen_ty_1::HandlerAddress"]
        [::std::mem::offset_of!(_SCOPE_TABLE_AMD64__bindgen_ty_1, HandlerAddress) - 8usize];
    ["Offset of field: _SCOPE_TABLE_AMD64__bindgen_ty_1::JumpTarget"]
        [::std::mem::offset_of!(_SCOPE_TABLE_AMD64__bindgen_ty_1, JumpTarget) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SCOPE_TABLE_AMD64"][::std::mem::size_of::<_SCOPE_TABLE_AMD64>() - 20usize];
    ["Alignment of _SCOPE_TABLE_AMD64"][::std::mem::align_of::<_SCOPE_TABLE_AMD64>() - 4usize];
    ["Offset of field: _SCOPE_TABLE_AMD64::Count"]
        [::std::mem::offset_of!(_SCOPE_TABLE_AMD64, Count) - 0usize];
    ["Offset of field: _SCOPE_TABLE_AMD64::ScopeRecord"]
        [::std::mem::offset_of!(_SCOPE_TABLE_AMD64, ScopeRecord) - 4usize];
};
pub type SCOPE_TABLE_AMD64 = _SCOPE_TABLE_AMD64;
pub type PSCOPE_TABLE_AMD64 = *mut _SCOPE_TABLE_AMD64;
unsafe extern "C" {
    pub fn _bittest(
        Base: *const ::std::os::raw::c_long,
        Offset: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _bittestandcomplement(
        Base: *mut ::std::os::raw::c_long,
        Offset: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _bittestandset(
        Base: *mut ::std::os::raw::c_long,
        Offset: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _bittestandreset(
        Base: *mut ::std::os::raw::c_long,
        Offset: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _interlockedbittestandset(
        Base: *mut ::std::os::raw::c_long,
        Offset: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _interlockedbittestandreset(
        Base: *mut ::std::os::raw::c_long,
        Offset: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _bittest64(
        Base: *const ::std::os::raw::c_longlong,
        Offset: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _bittestandcomplement64(
        Base: *mut ::std::os::raw::c_longlong,
        Offset: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _bittestandset64(
        Base: *mut ::std::os::raw::c_longlong,
        Offset: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _bittestandreset64(
        Base: *mut ::std::os::raw::c_longlong,
        Offset: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _interlockedbittestandset64(
        Base: *mut ::std::os::raw::c_longlong,
        Offset: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _interlockedbittestandreset64(
        Base: *mut ::std::os::raw::c_longlong,
        Offset: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _BitScanForward(
        Index: *mut ::std::os::raw::c_ulong,
        Mask: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _BitScanReverse(
        Index: *mut ::std::os::raw::c_ulong,
        Mask: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _BitScanForward64(
        Index: *mut ::std::os::raw::c_ulong,
        Mask: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _BitScanReverse64(
        Index: *mut ::std::os::raw::c_ulong,
        Mask: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _InterlockedIncrement16(Addend: *mut ::std::os::raw::c_short)
    -> ::std::os::raw::c_short;
}
unsafe extern "C" {
    pub fn _InterlockedDecrement16(Addend: *mut ::std::os::raw::c_short)
    -> ::std::os::raw::c_short;
}
unsafe extern "C" {
    pub fn _InterlockedCompareExchange16(
        Destination: *mut ::std::os::raw::c_short,
        ExChange: ::std::os::raw::c_short,
        Comperand: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
unsafe extern "C" {
    pub fn _InterlockedAnd(
        Destination: *mut ::std::os::raw::c_long,
        Value: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _InterlockedOr(
        Destination: *mut ::std::os::raw::c_long,
        Value: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _InterlockedXor(
        Destination: *mut ::std::os::raw::c_long,
        Value: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _InterlockedAnd64(
        Destination: *mut ::std::os::raw::c_longlong,
        Value: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _InterlockedOr64(
        Destination: *mut ::std::os::raw::c_longlong,
        Value: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _InterlockedXor64(
        Destination: *mut ::std::os::raw::c_longlong,
        Value: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _InterlockedIncrement(Addend: *mut ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _InterlockedDecrement(Addend: *mut ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _InterlockedExchange(
        Target: *mut ::std::os::raw::c_long,
        Value: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _InterlockedExchangeAdd(
        Addend: *mut ::std::os::raw::c_long,
        Value: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _InterlockedCompareExchange(
        Destination: *mut ::std::os::raw::c_long,
        ExChange: ::std::os::raw::c_long,
        Comperand: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn _InterlockedIncrement64(
        Addend: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _InterlockedDecrement64(
        Addend: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _InterlockedExchange64(
        Target: *mut ::std::os::raw::c_longlong,
        Value: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _InterlockedExchangeAdd64(
        Addend: *mut ::std::os::raw::c_longlong,
        Value: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _InterlockedCompareExchange64(
        Destination: *mut ::std::os::raw::c_longlong,
        ExChange: ::std::os::raw::c_longlong,
        Comperand: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn _InterlockedCompareExchange128(
        Destination: *mut ::std::os::raw::c_longlong,
        ExchangeHigh: ::std::os::raw::c_longlong,
        ExchangeLow: ::std::os::raw::c_longlong,
        ComparandResult: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn _InterlockedCompareExchangePointer(
        Destination: *mut *mut ::std::os::raw::c_void,
        Exchange: *mut ::std::os::raw::c_void,
        Comperand: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _InterlockedExchangePointer(
        Target: *mut *mut ::std::os::raw::c_void,
        Value: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
}
unsafe extern "C" {
    pub fn _InterlockedExchange8(
        Target: *mut ::std::os::raw::c_char,
        Value: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _InterlockedExchange16(
        Destination: *mut ::std::os::raw::c_short,
        ExChange: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
unsafe extern "C" {
    pub fn _InterlockedExchangeAdd8(
        _Addend: *mut ::std::os::raw::c_char,
        _Value: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _InterlockedAnd8(
        Destination: *mut ::std::os::raw::c_char,
        Value: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _InterlockedOr8(
        Destination: *mut ::std::os::raw::c_char,
        Value: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _InterlockedXor8(
        Destination: *mut ::std::os::raw::c_char,
        Value: ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn _InterlockedAnd16(
        Destination: *mut ::std::os::raw::c_short,
        Value: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
unsafe extern "C" {
    pub fn _InterlockedOr16(
        Destination: *mut ::std::os::raw::c_short,
        Value: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
unsafe extern "C" {
    pub fn _InterlockedXor16(
        Destination: *mut ::std::os::raw::c_short,
        Value: ::std::os::raw::c_short,
    ) -> ::std::os::raw::c_short;
}
unsafe extern "C" {
    pub fn __cpuidex(
        CPUInfo: *mut ::std::os::raw::c_int,
        Function: ::std::os::raw::c_int,
        SubLeaf: ::std::os::raw::c_int,
    );
}
unsafe extern "C" {
    pub fn _mm_clflush(Address: *const ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _ReadWriteBarrier();
}
unsafe extern "C" {
    pub fn __faststorefence();
}
unsafe extern "C" {
    pub fn _mm_lfence();
}
unsafe extern "C" {
    pub fn _mm_mfence();
}
unsafe extern "C" {
    pub fn _mm_sfence();
}
unsafe extern "C" {
    pub fn _mm_pause();
}
unsafe extern "C" {
    pub fn _mm_prefetch(a: *const ::std::os::raw::c_char, sel: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn _m_prefetchw(Source: *const ::std::os::raw::c_void);
}
unsafe extern "C" {
    pub fn _mm_getcsr() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn _mm_setcsr(MxCsr: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn __getcallerseflags() -> ::std::os::raw::c_uint;
}
unsafe extern "C" {
    pub fn __segmentlimit(Selector: DWORD) -> DWORD;
}
unsafe extern "C" {
    pub fn __readpmc(Counter: DWORD) -> DWORD64;
}
unsafe extern "C" {
    pub fn __rdtsc() -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn __movsb(Destination: PBYTE, Source: *const BYTE, Count: SIZE_T);
}
unsafe extern "C" {
    pub fn __movsw(Destination: PWORD, Source: *const WORD, Count: SIZE_T);
}
unsafe extern "C" {
    pub fn __movsd(Destination: PDWORD, Source: *const DWORD, Count: SIZE_T);
}
unsafe extern "C" {
    pub fn __movsq(Destination: PDWORD64, Source: *const DWORD64, Count: SIZE_T);
}
unsafe extern "C" {
    pub fn __stosb(
        Destination: *mut ::std::os::raw::c_uchar,
        Value: ::std::os::raw::c_uchar,
        Count: ::std::os::raw::c_ulonglong,
    );
}
unsafe extern "C" {
    pub fn __stosw(Destination: PWORD, Value: WORD, Count: SIZE_T);
}
unsafe extern "C" {
    pub fn __stosd(Destination: PDWORD, Value: DWORD, Count: SIZE_T);
}
unsafe extern "C" {
    pub fn __stosq(Destination: PDWORD64, Value: DWORD64, Count: SIZE_T);
}
unsafe extern "C" {
    pub fn __mulh(
        Multiplier: ::std::os::raw::c_longlong,
        Multiplicand: ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn __umulh(
        Multiplier: ::std::os::raw::c_ulonglong,
        Multiplicand: ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn __popcnt64(operand: ::std::os::raw::c_ulonglong) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn __shiftleft128(
        LowPart: ::std::os::raw::c_ulonglong,
        HighPart: ::std::os::raw::c_ulonglong,
        Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn __shiftright128(
        LowPart: ::std::os::raw::c_ulonglong,
        HighPart: ::std::os::raw::c_ulonglong,
        Shift: ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn _mul128(
        Multiplier: ::std::os::raw::c_longlong,
        Multiplicand: ::std::os::raw::c_longlong,
        HighProduct: *mut ::std::os::raw::c_longlong,
    ) -> ::std::os::raw::c_longlong;
}
unsafe extern "C" {
    pub fn UnsignedMultiply128(
        Multiplier: DWORD64,
        Multiplicand: DWORD64,
        HighProduct: *mut DWORD64,
    ) -> DWORD64;
}
unsafe extern "C" {
    pub fn _umul128(
        Multiplier: ::std::os::raw::c_ulonglong,
        Multiplicand: ::std::os::raw::c_ulonglong,
        HighProduct: *mut ::std::os::raw::c_ulonglong,
    ) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn __readgsbyte(Offset: ::std::os::raw::c_ulong) -> ::std::os::raw::c_uchar;
}
unsafe extern "C" {
    pub fn __readgsword(Offset: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ushort;
}
unsafe extern "C" {
    pub fn __readgsdword(Offset: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulong;
}
unsafe extern "C" {
    pub fn __readgsqword(Offset: ::std::os::raw::c_ulong) -> ::std::os::raw::c_ulonglong;
}
unsafe extern "C" {
    pub fn __writegsbyte(Offset: DWORD, Data: BYTE);
}
unsafe extern "C" {
    pub fn __writegsword(Offset: DWORD, Data: WORD);
}
unsafe extern "C" {
    pub fn __writegsdword(Offset: DWORD, Data: DWORD);
}
unsafe extern "C" {
    pub fn __writegsqword(Offset: DWORD, Data: DWORD64);
}
unsafe extern "C" {
    pub fn __incgsbyte(Offset: DWORD);
}
unsafe extern "C" {
    pub fn __addgsbyte(Offset: DWORD, Value: BYTE);
}
unsafe extern "C" {
    pub fn __incgsword(Offset: DWORD);
}
unsafe extern "C" {
    pub fn __addgsword(Offset: DWORD, Value: WORD);
}
unsafe extern "C" {
    pub fn __incgsdword(Offset: DWORD);
}
unsafe extern "C" {
    pub fn __addgsdword(Offset: DWORD, Value: DWORD);
}
unsafe extern "C" {
    pub fn __incgsqword(Offset: DWORD);
}
unsafe extern "C" {
    pub fn __addgsqword(Offset: DWORD, Value: DWORD64);
}
pub type XMM_SAVE_AREA32 = XSAVE_FORMAT;
pub type PXMM_SAVE_AREA32 = *mut XSAVE_FORMAT;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct _CONTEXT {
    pub P1Home: DWORD64,
    pub P2Home: DWORD64,
    pub P3Home: DWORD64,
    pub P4Home: DWORD64,
    pub P5Home: DWORD64,
    pub P6Home: DWORD64,
    pub ContextFlags: DWORD,
    pub MxCsr: DWORD,
    pub SegCs: WORD,
    pub SegDs: WORD,
    pub SegEs: WORD,
    pub SegFs: WORD,
    pub SegGs: WORD,
    pub SegSs: WORD,
    pub EFlags: DWORD,
    pub Dr0: DWORD64,
    pub Dr1: DWORD64,
    pub Dr2: DWORD64,
    pub Dr3: DWORD64,
    pub Dr6: DWORD64,
    pub Dr7: DWORD64,
    pub Rax: DWORD64,
    pub Rcx: DWORD64,
    pub Rdx: DWORD64,
    pub Rbx: DWORD64,
    pub Rsp: DWORD64,
    pub Rbp: DWORD64,
    pub Rsi: DWORD64,
    pub Rdi: DWORD64,
    pub R8: DWORD64,
    pub R9: DWORD64,
    pub R10: DWORD64,
    pub R11: DWORD64,
    pub R12: DWORD64,
    pub R13: DWORD64,
    pub R14: DWORD64,
    pub R15: DWORD64,
    pub Rip: DWORD64,
    pub __bindgen_anon_1: _CONTEXT__bindgen_ty_1,
    pub VectorRegister: [M128A; 26usize],
    pub VectorControl: DWORD64,
    pub DebugControl: DWORD64,
    pub LastBranchToRip: DWORD64,
    pub LastBranchFromRip: DWORD64,
    pub LastExceptionToRip: DWORD64,
    pub LastExceptionFromRip: DWORD64,
}
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub union _CONTEXT__bindgen_ty_1 {
    pub FltSave: XMM_SAVE_AREA32,
    pub __bindgen_anon_1: _CONTEXT__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct _CONTEXT__bindgen_ty_1__bindgen_ty_1 {
    pub Header: [M128A; 2usize],
    pub Legacy: [M128A; 8usize],
    pub Xmm0: M128A,
    pub Xmm1: M128A,
    pub Xmm2: M128A,
    pub Xmm3: M128A,
    pub Xmm4: M128A,
    pub Xmm5: M128A,
    pub Xmm6: M128A,
    pub Xmm7: M128A,
    pub Xmm8: M128A,
    pub Xmm9: M128A,
    pub Xmm10: M128A,
    pub Xmm11: M128A,
    pub Xmm12: M128A,
    pub Xmm13: M128A,
    pub Xmm14: M128A,
    pub Xmm15: M128A,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CONTEXT__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_CONTEXT__bindgen_ty_1__bindgen_ty_1>() - 416usize];
    ["Alignment of _CONTEXT__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_CONTEXT__bindgen_ty_1__bindgen_ty_1>() - 16usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Header"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Header) - 0usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Legacy"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Legacy) - 32usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm0"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm0) - 160usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm1"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm1) - 176usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm2"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm2) - 192usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm3"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm3) - 208usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm4"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm4) - 224usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm5"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm5) - 240usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm6"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm6) - 256usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm7"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm7) - 272usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm8"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm8) - 288usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm9"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm9) - 304usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm10"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm10) - 320usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm11"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm11) - 336usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm12"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm12) - 352usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm13"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm13) - 368usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm14"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm14) - 384usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1__bindgen_ty_1::Xmm15"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1__bindgen_ty_1, Xmm15) - 400usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CONTEXT__bindgen_ty_1"][::std::mem::size_of::<_CONTEXT__bindgen_ty_1>() - 512usize];
    ["Alignment of _CONTEXT__bindgen_ty_1"]
        [::std::mem::align_of::<_CONTEXT__bindgen_ty_1>() - 16usize];
    ["Offset of field: _CONTEXT__bindgen_ty_1::FltSave"]
        [::std::mem::offset_of!(_CONTEXT__bindgen_ty_1, FltSave) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CONTEXT"][::std::mem::size_of::<_CONTEXT>() - 1232usize];
    ["Alignment of _CONTEXT"][::std::mem::align_of::<_CONTEXT>() - 16usize];
    ["Offset of field: _CONTEXT::P1Home"][::std::mem::offset_of!(_CONTEXT, P1Home) - 0usize];
    ["Offset of field: _CONTEXT::P2Home"][::std::mem::offset_of!(_CONTEXT, P2Home) - 8usize];
    ["Offset of field: _CONTEXT::P3Home"][::std::mem::offset_of!(_CONTEXT, P3Home) - 16usize];
    ["Offset of field: _CONTEXT::P4Home"][::std::mem::offset_of!(_CONTEXT, P4Home) - 24usize];
    ["Offset of field: _CONTEXT::P5Home"][::std::mem::offset_of!(_CONTEXT, P5Home) - 32usize];
    ["Offset of field: _CONTEXT::P6Home"][::std::mem::offset_of!(_CONTEXT, P6Home) - 40usize];
    ["Offset of field: _CONTEXT::ContextFlags"]
        [::std::mem::offset_of!(_CONTEXT, ContextFlags) - 48usize];
    ["Offset of field: _CONTEXT::MxCsr"][::std::mem::offset_of!(_CONTEXT, MxCsr) - 52usize];
    ["Offset of field: _CONTEXT::SegCs"][::std::mem::offset_of!(_CONTEXT, SegCs) - 56usize];
    ["Offset of field: _CONTEXT::SegDs"][::std::mem::offset_of!(_CONTEXT, SegDs) - 58usize];
    ["Offset of field: _CONTEXT::SegEs"][::std::mem::offset_of!(_CONTEXT, SegEs) - 60usize];
    ["Offset of field: _CONTEXT::SegFs"][::std::mem::offset_of!(_CONTEXT, SegFs) - 62usize];
    ["Offset of field: _CONTEXT::SegGs"][::std::mem::offset_of!(_CONTEXT, SegGs) - 64usize];
    ["Offset of field: _CONTEXT::SegSs"][::std::mem::offset_of!(_CONTEXT, SegSs) - 66usize];
    ["Offset of field: _CONTEXT::EFlags"][::std::mem::offset_of!(_CONTEXT, EFlags) - 68usize];
    ["Offset of field: _CONTEXT::Dr0"][::std::mem::offset_of!(_CONTEXT, Dr0) - 72usize];
    ["Offset of field: _CONTEXT::Dr1"][::std::mem::offset_of!(_CONTEXT, Dr1) - 80usize];
    ["Offset of field: _CONTEXT::Dr2"][::std::mem::offset_of!(_CONTEXT, Dr2) - 88usize];
    ["Offset of field: _CONTEXT::Dr3"][::std::mem::offset_of!(_CONTEXT, Dr3) - 96usize];
    ["Offset of field: _CONTEXT::Dr6"][::std::mem::offset_of!(_CONTEXT, Dr6) - 104usize];
    ["Offset of field: _CONTEXT::Dr7"][::std::mem::offset_of!(_CONTEXT, Dr7) - 112usize];
    ["Offset of field: _CONTEXT::Rax"][::std::mem::offset_of!(_CONTEXT, Rax) - 120usize];
    ["Offset of field: _CONTEXT::Rcx"][::std::mem::offset_of!(_CONTEXT, Rcx) - 128usize];
    ["Offset of field: _CONTEXT::Rdx"][::std::mem::offset_of!(_CONTEXT, Rdx) - 136usize];
    ["Offset of field: _CONTEXT::Rbx"][::std::mem::offset_of!(_CONTEXT, Rbx) - 144usize];
    ["Offset of field: _CONTEXT::Rsp"][::std::mem::offset_of!(_CONTEXT, Rsp) - 152usize];
    ["Offset of field: _CONTEXT::Rbp"][::std::mem::offset_of!(_CONTEXT, Rbp) - 160usize];
    ["Offset of field: _CONTEXT::Rsi"][::std::mem::offset_of!(_CONTEXT, Rsi) - 168usize];
    ["Offset of field: _CONTEXT::Rdi"][::std::mem::offset_of!(_CONTEXT, Rdi) - 176usize];
    ["Offset of field: _CONTEXT::R8"][::std::mem::offset_of!(_CONTEXT, R8) - 184usize];
    ["Offset of field: _CONTEXT::R9"][::std::mem::offset_of!(_CONTEXT, R9) - 192usize];
    ["Offset of field: _CONTEXT::R10"][::std::mem::offset_of!(_CONTEXT, R10) - 200usize];
    ["Offset of field: _CONTEXT::R11"][::std::mem::offset_of!(_CONTEXT, R11) - 208usize];
    ["Offset of field: _CONTEXT::R12"][::std::mem::offset_of!(_CONTEXT, R12) - 216usize];
    ["Offset of field: _CONTEXT::R13"][::std::mem::offset_of!(_CONTEXT, R13) - 224usize];
    ["Offset of field: _CONTEXT::R14"][::std::mem::offset_of!(_CONTEXT, R14) - 232usize];
    ["Offset of field: _CONTEXT::R15"][::std::mem::offset_of!(_CONTEXT, R15) - 240usize];
    ["Offset of field: _CONTEXT::Rip"][::std::mem::offset_of!(_CONTEXT, Rip) - 248usize];
    ["Offset of field: _CONTEXT::VectorRegister"]
        [::std::mem::offset_of!(_CONTEXT, VectorRegister) - 768usize];
    ["Offset of field: _CONTEXT::VectorControl"]
        [::std::mem::offset_of!(_CONTEXT, VectorControl) - 1184usize];
    ["Offset of field: _CONTEXT::DebugControl"]
        [::std::mem::offset_of!(_CONTEXT, DebugControl) - 1192usize];
    ["Offset of field: _CONTEXT::LastBranchToRip"]
        [::std::mem::offset_of!(_CONTEXT, LastBranchToRip) - 1200usize];
    ["Offset of field: _CONTEXT::LastBranchFromRip"]
        [::std::mem::offset_of!(_CONTEXT, LastBranchFromRip) - 1208usize];
    ["Offset of field: _CONTEXT::LastExceptionToRip"]
        [::std::mem::offset_of!(_CONTEXT, LastExceptionToRip) - 1216usize];
    ["Offset of field: _CONTEXT::LastExceptionFromRip"]
        [::std::mem::offset_of!(_CONTEXT, LastExceptionFromRip) - 1224usize];
};
pub type CONTEXT = _CONTEXT;
pub type PCONTEXT = *mut _CONTEXT;
pub type RUNTIME_FUNCTION = _IMAGE_RUNTIME_FUNCTION_ENTRY;
pub type PRUNTIME_FUNCTION = *mut _IMAGE_RUNTIME_FUNCTION_ENTRY;
pub type SCOPE_TABLE = SCOPE_TABLE_AMD64;
pub type PSCOPE_TABLE = *mut SCOPE_TABLE_AMD64;
pub type GET_RUNTIME_FUNCTION_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(ControlPc: DWORD64, Context: PVOID) -> PRUNTIME_FUNCTION,
>;
pub type PGET_RUNTIME_FUNCTION_CALLBACK = GET_RUNTIME_FUNCTION_CALLBACK;
pub type OUT_OF_PROCESS_FUNCTION_TABLE_CALLBACK = ::std::option::Option<
    unsafe extern "C" fn(
        Process: HANDLE,
        TableAddress: PVOID,
        Entries: PDWORD,
        Functions: *mut PRUNTIME_FUNCTION,
    ) -> DWORD,
>;
pub type POUT_OF_PROCESS_FUNCTION_TABLE_CALLBACK = OUT_OF_PROCESS_FUNCTION_TABLE_CALLBACK;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_CONTEXT {
    pub ControlPc: DWORD64,
    pub ImageBase: DWORD64,
    pub FunctionEntry: PRUNTIME_FUNCTION,
    pub EstablisherFrame: DWORD64,
    pub TargetIp: DWORD64,
    pub ContextRecord: PCONTEXT,
    pub LanguageHandler: PEXCEPTION_ROUTINE,
    pub HandlerData: PVOID,
    pub HistoryTable: *mut _UNWIND_HISTORY_TABLE,
    pub ScopeIndex: DWORD,
    pub Fill0: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_CONTEXT"][::std::mem::size_of::<_DISPATCHER_CONTEXT>() - 80usize];
    ["Alignment of _DISPATCHER_CONTEXT"][::std::mem::align_of::<_DISPATCHER_CONTEXT>() - 8usize];
    ["Offset of field: _DISPATCHER_CONTEXT::ControlPc"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT, ControlPc) - 0usize];
    ["Offset of field: _DISPATCHER_CONTEXT::ImageBase"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT, ImageBase) - 8usize];
    ["Offset of field: _DISPATCHER_CONTEXT::FunctionEntry"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT, FunctionEntry) - 16usize];
    ["Offset of field: _DISPATCHER_CONTEXT::EstablisherFrame"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT, EstablisherFrame) - 24usize];
    ["Offset of field: _DISPATCHER_CONTEXT::TargetIp"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT, TargetIp) - 32usize];
    ["Offset of field: _DISPATCHER_CONTEXT::ContextRecord"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT, ContextRecord) - 40usize];
    ["Offset of field: _DISPATCHER_CONTEXT::LanguageHandler"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT, LanguageHandler) - 48usize];
    ["Offset of field: _DISPATCHER_CONTEXT::HandlerData"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT, HandlerData) - 56usize];
    ["Offset of field: _DISPATCHER_CONTEXT::HistoryTable"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT, HistoryTable) - 64usize];
    ["Offset of field: _DISPATCHER_CONTEXT::ScopeIndex"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT, ScopeIndex) - 72usize];
    ["Offset of field: _DISPATCHER_CONTEXT::Fill0"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT, Fill0) - 76usize];
};
pub type DISPATCHER_CONTEXT = _DISPATCHER_CONTEXT;
pub type PDISPATCHER_CONTEXT = *mut _DISPATCHER_CONTEXT;
pub type PEXCEPTION_FILTER = ::std::option::Option<
    unsafe extern "C" fn(
        ExceptionPointers: *mut _EXCEPTION_POINTERS,
        EstablisherFrame: PVOID,
    ) -> LONG,
>;
pub type PTERMINATION_HANDLER = ::std::option::Option<
    unsafe extern "C" fn(_abnormal_termination: BOOLEAN, EstablisherFrame: PVOID),
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _KNONVOLATILE_CONTEXT_POINTERS {
    pub __bindgen_anon_1: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1,
    pub __bindgen_anon_2: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1 {
    pub FloatingContext: [PM128A; 16usize],
    pub __bindgen_anon_1: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1 {
    pub Xmm0: PM128A,
    pub Xmm1: PM128A,
    pub Xmm2: PM128A,
    pub Xmm3: PM128A,
    pub Xmm4: PM128A,
    pub Xmm5: PM128A,
    pub Xmm6: PM128A,
    pub Xmm7: PM128A,
    pub Xmm8: PM128A,
    pub Xmm9: PM128A,
    pub Xmm10: PM128A,
    pub Xmm11: PM128A,
    pub Xmm12: PM128A,
    pub Xmm13: PM128A,
    pub Xmm14: PM128A,
    pub Xmm15: PM128A,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
    >() - 128usize];
    ["Alignment of _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1"][::std::mem::align_of::<
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
    >() - 8usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm0"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm0
    )
        - 0usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm1"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm1
    )
        - 8usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm2"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm2
    )
        - 16usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm3"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm3
    )
        - 24usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm4"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm4
    )
        - 32usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm5"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm5
    )
        - 40usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm6"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm6
    )
        - 48usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm7"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm7
    )
        - 56usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm8"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm8
    )
        - 64usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm9"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm9
    )
        - 72usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm10"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm10
    )
        - 80usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm11"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm11
    )
        - 88usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm12"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm12
    )
        - 96usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm13"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm13
    )
        - 104usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm14"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm14
    )
        - 112usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1::Xmm15"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1__bindgen_ty_1,
        Xmm15
    )
        - 120usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1"]
        [::std::mem::size_of::<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1>() - 128usize];
    ["Alignment of _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1"]
        [::std::mem::align_of::<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1>() - 8usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1::FloatingContext"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_1,
        FloatingContext
    ) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2 {
    pub IntegerContext: [PDWORD64; 16usize],
    pub __bindgen_anon_1: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1 {
    pub Rax: PDWORD64,
    pub Rcx: PDWORD64,
    pub Rdx: PDWORD64,
    pub Rbx: PDWORD64,
    pub Rsp: PDWORD64,
    pub Rbp: PDWORD64,
    pub Rsi: PDWORD64,
    pub Rdi: PDWORD64,
    pub R8: PDWORD64,
    pub R9: PDWORD64,
    pub R10: PDWORD64,
    pub R11: PDWORD64,
    pub R12: PDWORD64,
    pub R13: PDWORD64,
    pub R14: PDWORD64,
    pub R15: PDWORD64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1"][::std::mem::size_of::<
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
    >() - 128usize];
    ["Alignment of _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1"][::std::mem::align_of::<
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
    >() - 8usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::Rax"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        Rax
    )
        - 0usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::Rcx"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        Rcx
    )
        - 8usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::Rdx"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        Rdx
    )
        - 16usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::Rbx"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        Rbx
    )
        - 24usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::Rsp"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        Rsp
    )
        - 32usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::Rbp"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        Rbp
    )
        - 40usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::Rsi"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        Rsi
    )
        - 48usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::Rdi"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        Rdi
    )
        - 56usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::R8"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        R8
    )
        - 64usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::R9"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        R9
    )
        - 72usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::R10"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        R10
    )
        - 80usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::R11"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        R11
    )
        - 88usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::R12"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        R12
    )
        - 96usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::R13"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        R13
    )
        - 104usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::R14"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        R14
    )
        - 112usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1::R15"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2__bindgen_ty_1,
        R15
    )
        - 120usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2"]
        [::std::mem::size_of::<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2>() - 128usize];
    ["Alignment of _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2"]
        [::std::mem::align_of::<_KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2>() - 8usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2::IntegerContext"][::std::mem::offset_of!(
        _KNONVOLATILE_CONTEXT_POINTERS__bindgen_ty_2,
        IntegerContext
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KNONVOLATILE_CONTEXT_POINTERS"]
        [::std::mem::size_of::<_KNONVOLATILE_CONTEXT_POINTERS>() - 256usize];
    ["Alignment of _KNONVOLATILE_CONTEXT_POINTERS"]
        [::std::mem::align_of::<_KNONVOLATILE_CONTEXT_POINTERS>() - 8usize];
};
pub type KNONVOLATILE_CONTEXT_POINTERS = _KNONVOLATILE_CONTEXT_POINTERS;
pub type PKNONVOLATILE_CONTEXT_POINTERS = *mut _KNONVOLATILE_CONTEXT_POINTERS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM {
    pub Count: DWORD,
    pub ScopeRecord: [_SCOPE_TABLE_ARM__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM__bindgen_ty_1 {
    pub BeginAddress: DWORD,
    pub EndAddress: DWORD,
    pub HandlerAddress: DWORD,
    pub JumpTarget: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SCOPE_TABLE_ARM__bindgen_ty_1"]
        [::std::mem::size_of::<_SCOPE_TABLE_ARM__bindgen_ty_1>() - 16usize];
    ["Alignment of _SCOPE_TABLE_ARM__bindgen_ty_1"]
        [::std::mem::align_of::<_SCOPE_TABLE_ARM__bindgen_ty_1>() - 4usize];
    ["Offset of field: _SCOPE_TABLE_ARM__bindgen_ty_1::BeginAddress"]
        [::std::mem::offset_of!(_SCOPE_TABLE_ARM__bindgen_ty_1, BeginAddress) - 0usize];
    ["Offset of field: _SCOPE_TABLE_ARM__bindgen_ty_1::EndAddress"]
        [::std::mem::offset_of!(_SCOPE_TABLE_ARM__bindgen_ty_1, EndAddress) - 4usize];
    ["Offset of field: _SCOPE_TABLE_ARM__bindgen_ty_1::HandlerAddress"]
        [::std::mem::offset_of!(_SCOPE_TABLE_ARM__bindgen_ty_1, HandlerAddress) - 8usize];
    ["Offset of field: _SCOPE_TABLE_ARM__bindgen_ty_1::JumpTarget"]
        [::std::mem::offset_of!(_SCOPE_TABLE_ARM__bindgen_ty_1, JumpTarget) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SCOPE_TABLE_ARM"][::std::mem::size_of::<_SCOPE_TABLE_ARM>() - 20usize];
    ["Alignment of _SCOPE_TABLE_ARM"][::std::mem::align_of::<_SCOPE_TABLE_ARM>() - 4usize];
    ["Offset of field: _SCOPE_TABLE_ARM::Count"]
        [::std::mem::offset_of!(_SCOPE_TABLE_ARM, Count) - 0usize];
    ["Offset of field: _SCOPE_TABLE_ARM::ScopeRecord"]
        [::std::mem::offset_of!(_SCOPE_TABLE_ARM, ScopeRecord) - 4usize];
};
pub type SCOPE_TABLE_ARM = _SCOPE_TABLE_ARM;
pub type PSCOPE_TABLE_ARM = *mut _SCOPE_TABLE_ARM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM64 {
    pub Count: DWORD,
    pub ScopeRecord: [_SCOPE_TABLE_ARM64__bindgen_ty_1; 1usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SCOPE_TABLE_ARM64__bindgen_ty_1 {
    pub BeginAddress: DWORD,
    pub EndAddress: DWORD,
    pub HandlerAddress: DWORD,
    pub JumpTarget: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SCOPE_TABLE_ARM64__bindgen_ty_1"]
        [::std::mem::size_of::<_SCOPE_TABLE_ARM64__bindgen_ty_1>() - 16usize];
    ["Alignment of _SCOPE_TABLE_ARM64__bindgen_ty_1"]
        [::std::mem::align_of::<_SCOPE_TABLE_ARM64__bindgen_ty_1>() - 4usize];
    ["Offset of field: _SCOPE_TABLE_ARM64__bindgen_ty_1::BeginAddress"]
        [::std::mem::offset_of!(_SCOPE_TABLE_ARM64__bindgen_ty_1, BeginAddress) - 0usize];
    ["Offset of field: _SCOPE_TABLE_ARM64__bindgen_ty_1::EndAddress"]
        [::std::mem::offset_of!(_SCOPE_TABLE_ARM64__bindgen_ty_1, EndAddress) - 4usize];
    ["Offset of field: _SCOPE_TABLE_ARM64__bindgen_ty_1::HandlerAddress"]
        [::std::mem::offset_of!(_SCOPE_TABLE_ARM64__bindgen_ty_1, HandlerAddress) - 8usize];
    ["Offset of field: _SCOPE_TABLE_ARM64__bindgen_ty_1::JumpTarget"]
        [::std::mem::offset_of!(_SCOPE_TABLE_ARM64__bindgen_ty_1, JumpTarget) - 12usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SCOPE_TABLE_ARM64"][::std::mem::size_of::<_SCOPE_TABLE_ARM64>() - 20usize];
    ["Alignment of _SCOPE_TABLE_ARM64"][::std::mem::align_of::<_SCOPE_TABLE_ARM64>() - 4usize];
    ["Offset of field: _SCOPE_TABLE_ARM64::Count"]
        [::std::mem::offset_of!(_SCOPE_TABLE_ARM64, Count) - 0usize];
    ["Offset of field: _SCOPE_TABLE_ARM64::ScopeRecord"]
        [::std::mem::offset_of!(_SCOPE_TABLE_ARM64, ScopeRecord) - 4usize];
};
pub type SCOPE_TABLE_ARM64 = _SCOPE_TABLE_ARM64;
pub type PSCOPE_TABLE_ARM64 = *mut _SCOPE_TABLE_ARM64;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ARM64_NT_NEON128 {
    pub __bindgen_anon_1: _ARM64_NT_NEON128__bindgen_ty_1,
    pub D: [f64; 2usize],
    pub S: [f32; 4usize],
    pub H: [WORD; 8usize],
    pub B: [BYTE; 16usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ARM64_NT_NEON128__bindgen_ty_1 {
    pub Low: ULONGLONG,
    pub High: LONGLONG,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ARM64_NT_NEON128__bindgen_ty_1"]
        [::std::mem::size_of::<_ARM64_NT_NEON128__bindgen_ty_1>() - 16usize];
    ["Alignment of _ARM64_NT_NEON128__bindgen_ty_1"]
        [::std::mem::align_of::<_ARM64_NT_NEON128__bindgen_ty_1>() - 8usize];
    ["Offset of field: _ARM64_NT_NEON128__bindgen_ty_1::Low"]
        [::std::mem::offset_of!(_ARM64_NT_NEON128__bindgen_ty_1, Low) - 0usize];
    ["Offset of field: _ARM64_NT_NEON128__bindgen_ty_1::High"]
        [::std::mem::offset_of!(_ARM64_NT_NEON128__bindgen_ty_1, High) - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ARM64_NT_NEON128"][::std::mem::size_of::<_ARM64_NT_NEON128>() - 16usize];
    ["Alignment of _ARM64_NT_NEON128"][::std::mem::align_of::<_ARM64_NT_NEON128>() - 8usize];
    ["Offset of field: _ARM64_NT_NEON128::D"]
        [::std::mem::offset_of!(_ARM64_NT_NEON128, D) - 0usize];
    ["Offset of field: _ARM64_NT_NEON128::S"]
        [::std::mem::offset_of!(_ARM64_NT_NEON128, S) - 0usize];
    ["Offset of field: _ARM64_NT_NEON128::H"]
        [::std::mem::offset_of!(_ARM64_NT_NEON128, H) - 0usize];
    ["Offset of field: _ARM64_NT_NEON128::B"]
        [::std::mem::offset_of!(_ARM64_NT_NEON128, B) - 0usize];
};
pub type ARM64_NT_NEON128 = _ARM64_NT_NEON128;
pub type PARM64_NT_NEON128 = *mut _ARM64_NT_NEON128;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct _ARM64_NT_CONTEXT {
    pub ContextFlags: DWORD,
    pub Cpsr: DWORD,
    pub __bindgen_anon_1: _ARM64_NT_CONTEXT__bindgen_ty_1,
    pub Sp: DWORD64,
    pub Pc: DWORD64,
    pub V: [ARM64_NT_NEON128; 32usize],
    pub Fpcr: DWORD,
    pub Fpsr: DWORD,
    pub Bcr: [DWORD; 8usize],
    pub Bvr: [DWORD64; 8usize],
    pub Wcr: [DWORD; 2usize],
    pub Wvr: [DWORD64; 2usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ARM64_NT_CONTEXT__bindgen_ty_1 {
    pub __bindgen_anon_1: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
    pub X: [DWORD64; 31usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1 {
    pub X0: DWORD64,
    pub X1: DWORD64,
    pub X2: DWORD64,
    pub X3: DWORD64,
    pub X4: DWORD64,
    pub X5: DWORD64,
    pub X6: DWORD64,
    pub X7: DWORD64,
    pub X8: DWORD64,
    pub X9: DWORD64,
    pub X10: DWORD64,
    pub X11: DWORD64,
    pub X12: DWORD64,
    pub X13: DWORD64,
    pub X14: DWORD64,
    pub X15: DWORD64,
    pub X16: DWORD64,
    pub X17: DWORD64,
    pub X18: DWORD64,
    pub X19: DWORD64,
    pub X20: DWORD64,
    pub X21: DWORD64,
    pub X22: DWORD64,
    pub X23: DWORD64,
    pub X24: DWORD64,
    pub X25: DWORD64,
    pub X26: DWORD64,
    pub X27: DWORD64,
    pub X28: DWORD64,
    pub Fp: DWORD64,
    pub Lr: DWORD64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1>() - 248usize];
    ["Alignment of _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X0"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X0) - 0usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X1"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X1) - 8usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X2"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X2) - 16usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X3"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X3) - 24usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X4"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X4) - 32usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X5"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X5) - 40usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X6"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X6) - 48usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X7"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X7) - 56usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X8"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X8) - 64usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X9"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X9) - 72usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X10"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X10) - 80usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X11"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X11) - 88usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X12"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X12) - 96usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X13"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X13) - 104usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X14"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X14) - 112usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X15"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X15) - 120usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X16"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X16) - 128usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X17"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X17) - 136usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X18"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X18) - 144usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X19"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X19) - 152usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X20"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X20) - 160usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X21"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X21) - 168usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X22"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X22) - 176usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X23"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X23) - 184usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X24"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X24) - 192usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X25"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X25) - 200usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X26"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X26) - 208usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X27"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X27) - 216usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X28"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X28) - 224usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::Fp"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, Fp) - 232usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::Lr"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, Lr) - 240usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ARM64_NT_CONTEXT__bindgen_ty_1"]
        [::std::mem::size_of::<_ARM64_NT_CONTEXT__bindgen_ty_1>() - 248usize];
    ["Alignment of _ARM64_NT_CONTEXT__bindgen_ty_1"]
        [::std::mem::align_of::<_ARM64_NT_CONTEXT__bindgen_ty_1>() - 8usize];
    ["Offset of field: _ARM64_NT_CONTEXT__bindgen_ty_1::X"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT__bindgen_ty_1, X) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ARM64_NT_CONTEXT"][::std::mem::size_of::<_ARM64_NT_CONTEXT>() - 912usize];
    ["Alignment of _ARM64_NT_CONTEXT"][::std::mem::align_of::<_ARM64_NT_CONTEXT>() - 16usize];
    ["Offset of field: _ARM64_NT_CONTEXT::ContextFlags"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT, ContextFlags) - 0usize];
    ["Offset of field: _ARM64_NT_CONTEXT::Cpsr"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT, Cpsr) - 4usize];
    ["Offset of field: _ARM64_NT_CONTEXT::Sp"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT, Sp) - 256usize];
    ["Offset of field: _ARM64_NT_CONTEXT::Pc"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT, Pc) - 264usize];
    ["Offset of field: _ARM64_NT_CONTEXT::V"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT, V) - 272usize];
    ["Offset of field: _ARM64_NT_CONTEXT::Fpcr"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT, Fpcr) - 784usize];
    ["Offset of field: _ARM64_NT_CONTEXT::Fpsr"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT, Fpsr) - 788usize];
    ["Offset of field: _ARM64_NT_CONTEXT::Bcr"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT, Bcr) - 792usize];
    ["Offset of field: _ARM64_NT_CONTEXT::Bvr"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT, Bvr) - 824usize];
    ["Offset of field: _ARM64_NT_CONTEXT::Wcr"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT, Wcr) - 888usize];
    ["Offset of field: _ARM64_NT_CONTEXT::Wvr"]
        [::std::mem::offset_of!(_ARM64_NT_CONTEXT, Wvr) - 896usize];
};
pub type ARM64_NT_CONTEXT = _ARM64_NT_CONTEXT;
pub type PARM64_NT_CONTEXT = *mut _ARM64_NT_CONTEXT;
#[repr(C)]
#[repr(align(16))]
#[derive(Copy, Clone)]
pub struct _ARM64EC_NT_CONTEXT {
    pub __bindgen_anon_1: _ARM64EC_NT_CONTEXT__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ARM64EC_NT_CONTEXT__bindgen_ty_1 {
    pub __bindgen_anon_1: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1 {
    pub AMD64_P1Home: DWORD64,
    pub AMD64_P2Home: DWORD64,
    pub AMD64_P3Home: DWORD64,
    pub AMD64_P4Home: DWORD64,
    pub AMD64_P5Home: DWORD64,
    pub AMD64_P6Home: DWORD64,
    pub ContextFlags: DWORD,
    pub AMD64_MxCsr_copy: DWORD,
    pub AMD64_SegCs: WORD,
    pub AMD64_SegDs: WORD,
    pub AMD64_SegEs: WORD,
    pub AMD64_SegFs: WORD,
    pub AMD64_SegGs: WORD,
    pub AMD64_SegSs: WORD,
    pub AMD64_EFlags: DWORD,
    pub AMD64_Dr0: DWORD64,
    pub AMD64_Dr1: DWORD64,
    pub AMD64_Dr2: DWORD64,
    pub AMD64_Dr3: DWORD64,
    pub AMD64_Dr6: DWORD64,
    pub AMD64_Dr7: DWORD64,
    pub X8: DWORD64,
    pub X0: DWORD64,
    pub X1: DWORD64,
    pub X27: DWORD64,
    pub Sp: DWORD64,
    pub Fp: DWORD64,
    pub X25: DWORD64,
    pub X26: DWORD64,
    pub X2: DWORD64,
    pub X3: DWORD64,
    pub X4: DWORD64,
    pub X5: DWORD64,
    pub X19: DWORD64,
    pub X20: DWORD64,
    pub X21: DWORD64,
    pub X22: DWORD64,
    pub Pc: DWORD64,
    pub __bindgen_anon_1: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub AMD64_VectorRegister: [ARM64_NT_NEON128; 26usize],
    pub AMD64_VectorControl: DWORD64,
    pub AMD64_DebugControl: DWORD64,
    pub AMD64_LastBranchToRip: DWORD64,
    pub AMD64_LastBranchFromRip: DWORD64,
    pub AMD64_LastExceptionToRip: DWORD64,
    pub AMD64_LastExceptionFromRip: DWORD64,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub AMD64_ControlWord: WORD,
    pub AMD64_StatusWord: WORD,
    pub AMD64_TagWord: BYTE,
    pub AMD64_Reserved1: BYTE,
    pub AMD64_ErrorOpcode: WORD,
    pub AMD64_ErrorOffset: DWORD,
    pub AMD64_ErrorSelector: WORD,
    pub AMD64_Reserved2: WORD,
    pub AMD64_DataOffset: DWORD,
    pub AMD64_DataSelector: WORD,
    pub AMD64_Reserved3: WORD,
    pub AMD64_MxCsr: DWORD,
    pub AMD64_MxCsr_Mask: DWORD,
    pub Lr: DWORD64,
    pub X16_0: WORD,
    pub AMD64_St0_Reserved1: WORD,
    pub AMD64_St0_Reserved2: DWORD,
    pub X6: DWORD64,
    pub X16_1: WORD,
    pub AMD64_St1_Reserved1: WORD,
    pub AMD64_St1_Reserved2: DWORD,
    pub X7: DWORD64,
    pub X16_2: WORD,
    pub AMD64_St2_Reserved1: WORD,
    pub AMD64_St2_Reserved2: DWORD,
    pub X9: DWORD64,
    pub X16_3: WORD,
    pub AMD64_St3_Reserved1: WORD,
    pub AMD64_St3_Reserved2: DWORD,
    pub X10: DWORD64,
    pub X17_0: WORD,
    pub AMD64_St4_Reserved1: WORD,
    pub AMD64_St4_Reserved2: DWORD,
    pub X11: DWORD64,
    pub X17_1: WORD,
    pub AMD64_St5_Reserved1: WORD,
    pub AMD64_St5_Reserved2: DWORD,
    pub X12: DWORD64,
    pub X17_2: WORD,
    pub AMD64_St6_Reserved1: WORD,
    pub AMD64_St6_Reserved2: DWORD,
    pub X15: DWORD64,
    pub X17_3: WORD,
    pub AMD64_St7_Reserved1: WORD,
    pub AMD64_St7_Reserved2: DWORD,
    pub V: [ARM64_NT_NEON128; 16usize],
    pub AMD64_XSAVE_FORMAT_Reserved4: [BYTE; 96usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"][::std::mem::size_of::<
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    >() - 512usize];
    ["Alignment of _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>()
            - 8usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_ControlWord",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_ControlWord
    ) - 0usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_StatusWord",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_StatusWord
    ) - 2usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_TagWord",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_TagWord
    ) - 4usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_Reserved1",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_Reserved1
    ) - 5usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_ErrorOpcode",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_ErrorOpcode
    ) - 6usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_ErrorOffset",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_ErrorOffset
    ) - 8usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_ErrorSelector",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_ErrorSelector
    ) - 12usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_Reserved2",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_Reserved2
    ) - 14usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_DataOffset",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_DataOffset
    ) - 16usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_DataSelector",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_DataSelector
    ) - 20usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_Reserved3",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_Reserved3
    ) - 22usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_MxCsr"]
        [::std::mem::offset_of!(
            _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
            AMD64_MxCsr
        ) - 24usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_MxCsr_Mask",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_MxCsr_Mask
    ) - 28usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::Lr"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        Lr
    )
        - 32usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X16_0"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X16_0
    )
        - 40usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St0_Reserved1",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St0_Reserved1
    ) - 42usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St0_Reserved2",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St0_Reserved2
    ) - 44usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X6"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X6
    )
        - 48usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X16_1"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X16_1
    )
        - 56usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St1_Reserved1",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St1_Reserved1
    ) - 58usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St1_Reserved2",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St1_Reserved2
    ) - 60usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X7"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X7
    )
        - 64usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X16_2"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X16_2
    )
        - 72usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St2_Reserved1",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St2_Reserved1
    ) - 74usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St2_Reserved2",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St2_Reserved2
    ) - 76usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X9"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X9
    )
        - 80usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X16_3"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X16_3
    )
        - 88usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St3_Reserved1",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St3_Reserved1
    ) - 90usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St3_Reserved2",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St3_Reserved2
    ) - 92usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X10"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X10
    )
        - 96usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X17_0"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X17_0
    )
        - 104usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St4_Reserved1",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St4_Reserved1
    ) - 106usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St4_Reserved2",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St4_Reserved2
    ) - 108usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X11"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X11
    )
        - 112usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X17_1"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X17_1
    )
        - 120usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St5_Reserved1",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St5_Reserved1
    ) - 122usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St5_Reserved2",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St5_Reserved2
    ) - 124usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X12"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X12
    )
        - 128usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X17_2"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X17_2
    )
        - 136usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St6_Reserved1",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St6_Reserved1
    ) - 138usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St6_Reserved2",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St6_Reserved2
    ) - 140usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X15"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X15
    )
        - 144usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::X17_3"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        X17_3
    )
        - 152usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St7_Reserved1",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St7_Reserved1
    ) - 154usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_St7_Reserved2",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_St7_Reserved2
    ) - 156usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::V"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        V
    )
        - 160usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::AMD64_XSAVE_FORMAT_Reserved4",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        AMD64_XSAVE_FORMAT_Reserved4
    ) - 416usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1>() - 1232usize];
    ["Alignment of _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_P1Home"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_P1Home
    ) - 0usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_P2Home"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_P2Home
    ) - 8usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_P3Home"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_P3Home
    ) - 16usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_P4Home"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_P4Home
    ) - 24usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_P5Home"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_P5Home
    ) - 32usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_P6Home"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_P6Home
    ) - 40usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::ContextFlags"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        ContextFlags
    ) - 48usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_MxCsr_copy"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_MxCsr_copy
    )
        - 52usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_SegCs"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_SegCs
    ) - 56usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_SegDs"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_SegDs
    ) - 58usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_SegEs"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_SegEs
    ) - 60usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_SegFs"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_SegFs
    ) - 62usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_SegGs"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_SegGs
    ) - 64usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_SegSs"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_SegSs
    ) - 66usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_EFlags"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_EFlags
    ) - 68usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_Dr0"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_Dr0
    ) - 72usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_Dr1"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_Dr1
    ) - 80usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_Dr2"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_Dr2
    ) - 88usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_Dr3"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_Dr3
    ) - 96usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_Dr6"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_Dr6
    ) - 104usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_Dr7"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_Dr7
    ) - 112usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X8"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X8) - 120usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X0"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X0) - 128usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X1"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X1) - 136usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X27"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X27) - 144usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::Sp"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, Sp) - 152usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::Fp"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, Fp) - 160usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X25"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X25) - 168usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X26"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X26) - 176usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X2"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X2) - 184usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X3"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X3) - 192usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X4"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X4) - 200usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X5"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X5) - 208usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X19"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X19) - 216usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X20"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X20) - 224usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X21"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X21) - 232usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::X22"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, X22) - 240usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::Pc"]
        [::std::mem::offset_of!(_ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1, Pc) - 248usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_VectorRegister"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_VectorRegister
    )
        - 768usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_VectorControl"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_VectorControl
    )
        - 1184usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_DebugControl"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_DebugControl
    )
        - 1192usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_LastBranchToRip"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_LastBranchToRip
    )
        - 1200usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_LastBranchFromRip"][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_LastBranchFromRip
    )
        - 1208usize];
    ["Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_LastExceptionToRip"]
        [::std::mem::offset_of!(
            _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
            AMD64_LastExceptionToRip
        ) - 1216usize];
    [
        "Offset of field: _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1::AMD64_LastExceptionFromRip",
    ][::std::mem::offset_of!(
        _ARM64EC_NT_CONTEXT__bindgen_ty_1__bindgen_ty_1,
        AMD64_LastExceptionFromRip
    ) - 1224usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ARM64EC_NT_CONTEXT__bindgen_ty_1"]
        [::std::mem::size_of::<_ARM64EC_NT_CONTEXT__bindgen_ty_1>() - 1232usize];
    ["Alignment of _ARM64EC_NT_CONTEXT__bindgen_ty_1"]
        [::std::mem::align_of::<_ARM64EC_NT_CONTEXT__bindgen_ty_1>() - 8usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ARM64EC_NT_CONTEXT"][::std::mem::size_of::<_ARM64EC_NT_CONTEXT>() - 1232usize];
    ["Alignment of _ARM64EC_NT_CONTEXT"][::std::mem::align_of::<_ARM64EC_NT_CONTEXT>() - 16usize];
};
pub type ARM64EC_NT_CONTEXT = _ARM64EC_NT_CONTEXT;
pub type PARM64EC_NT_CONTEXT = *mut _ARM64EC_NT_CONTEXT;
pub type ARM64_RUNTIME_FUNCTION = _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY;
pub type PARM64_RUNTIME_FUNCTION = *mut _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _DISPATCHER_CONTEXT_NONVOLREG_ARM64 {
    pub Buffer: [BYTE; 152usize],
    pub __bindgen_anon_1: _DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1 {
    pub GpNvRegs: [DWORD64; 11usize],
    pub FpNvRegs: [f64; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1"]
        [::std::mem::size_of::<_DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1>() - 152usize];
    ["Alignment of _DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1"]
        [::std::mem::align_of::<_DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1>() - 8usize];
    ["Offset of field: _DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1::GpNvRegs"][::std::mem::offset_of!(
        _DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1,
        GpNvRegs
    ) - 0usize];
    ["Offset of field: _DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1::FpNvRegs"][::std::mem::offset_of!(
        _DISPATCHER_CONTEXT_NONVOLREG_ARM64__bindgen_ty_1,
        FpNvRegs
    ) - 88usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_CONTEXT_NONVOLREG_ARM64"]
        [::std::mem::size_of::<_DISPATCHER_CONTEXT_NONVOLREG_ARM64>() - 152usize];
    ["Alignment of _DISPATCHER_CONTEXT_NONVOLREG_ARM64"]
        [::std::mem::align_of::<_DISPATCHER_CONTEXT_NONVOLREG_ARM64>() - 8usize];
    ["Offset of field: _DISPATCHER_CONTEXT_NONVOLREG_ARM64::Buffer"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_NONVOLREG_ARM64, Buffer) - 0usize];
};
pub type DISPATCHER_CONTEXT_NONVOLREG_ARM64 = _DISPATCHER_CONTEXT_NONVOLREG_ARM64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DISPATCHER_CONTEXT_ARM64 {
    pub ControlPc: ULONG_PTR,
    pub ImageBase: ULONG_PTR,
    pub FunctionEntry: PARM64_RUNTIME_FUNCTION,
    pub EstablisherFrame: ULONG_PTR,
    pub TargetPc: ULONG_PTR,
    pub ContextRecord: PARM64_NT_CONTEXT,
    pub LanguageHandler: PEXCEPTION_ROUTINE,
    pub HandlerData: PVOID,
    pub HistoryTable: *mut _UNWIND_HISTORY_TABLE,
    pub ScopeIndex: DWORD,
    pub ControlPcIsUnwound: BOOLEAN,
    pub NonVolatileRegisters: PBYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _DISPATCHER_CONTEXT_ARM64"]
        [::std::mem::size_of::<_DISPATCHER_CONTEXT_ARM64>() - 88usize];
    ["Alignment of _DISPATCHER_CONTEXT_ARM64"]
        [::std::mem::align_of::<_DISPATCHER_CONTEXT_ARM64>() - 8usize];
    ["Offset of field: _DISPATCHER_CONTEXT_ARM64::ControlPc"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_ARM64, ControlPc) - 0usize];
    ["Offset of field: _DISPATCHER_CONTEXT_ARM64::ImageBase"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_ARM64, ImageBase) - 8usize];
    ["Offset of field: _DISPATCHER_CONTEXT_ARM64::FunctionEntry"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_ARM64, FunctionEntry) - 16usize];
    ["Offset of field: _DISPATCHER_CONTEXT_ARM64::EstablisherFrame"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_ARM64, EstablisherFrame) - 24usize];
    ["Offset of field: _DISPATCHER_CONTEXT_ARM64::TargetPc"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_ARM64, TargetPc) - 32usize];
    ["Offset of field: _DISPATCHER_CONTEXT_ARM64::ContextRecord"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_ARM64, ContextRecord) - 40usize];
    ["Offset of field: _DISPATCHER_CONTEXT_ARM64::LanguageHandler"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_ARM64, LanguageHandler) - 48usize];
    ["Offset of field: _DISPATCHER_CONTEXT_ARM64::HandlerData"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_ARM64, HandlerData) - 56usize];
    ["Offset of field: _DISPATCHER_CONTEXT_ARM64::HistoryTable"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_ARM64, HistoryTable) - 64usize];
    ["Offset of field: _DISPATCHER_CONTEXT_ARM64::ScopeIndex"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_ARM64, ScopeIndex) - 72usize];
    ["Offset of field: _DISPATCHER_CONTEXT_ARM64::ControlPcIsUnwound"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_ARM64, ControlPcIsUnwound) - 76usize];
    ["Offset of field: _DISPATCHER_CONTEXT_ARM64::NonVolatileRegisters"]
        [::std::mem::offset_of!(_DISPATCHER_CONTEXT_ARM64, NonVolatileRegisters) - 80usize];
};
pub type DISPATCHER_CONTEXT_ARM64 = _DISPATCHER_CONTEXT_ARM64;
pub type PDISPATCHER_CONTEXT_ARM64 = *mut _DISPATCHER_CONTEXT_ARM64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _KNONVOLATILE_CONTEXT_POINTERS_ARM64 {
    pub X19: PDWORD64,
    pub X20: PDWORD64,
    pub X21: PDWORD64,
    pub X22: PDWORD64,
    pub X23: PDWORD64,
    pub X24: PDWORD64,
    pub X25: PDWORD64,
    pub X26: PDWORD64,
    pub X27: PDWORD64,
    pub X28: PDWORD64,
    pub Fp: PDWORD64,
    pub Lr: PDWORD64,
    pub D8: PDWORD64,
    pub D9: PDWORD64,
    pub D10: PDWORD64,
    pub D11: PDWORD64,
    pub D12: PDWORD64,
    pub D13: PDWORD64,
    pub D14: PDWORD64,
    pub D15: PDWORD64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _KNONVOLATILE_CONTEXT_POINTERS_ARM64"]
        [::std::mem::size_of::<_KNONVOLATILE_CONTEXT_POINTERS_ARM64>() - 160usize];
    ["Alignment of _KNONVOLATILE_CONTEXT_POINTERS_ARM64"]
        [::std::mem::align_of::<_KNONVOLATILE_CONTEXT_POINTERS_ARM64>() - 8usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::X19"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, X19) - 0usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::X20"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, X20) - 8usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::X21"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, X21) - 16usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::X22"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, X22) - 24usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::X23"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, X23) - 32usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::X24"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, X24) - 40usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::X25"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, X25) - 48usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::X26"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, X26) - 56usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::X27"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, X27) - 64usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::X28"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, X28) - 72usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::Fp"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, Fp) - 80usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::Lr"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, Lr) - 88usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::D8"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, D8) - 96usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::D9"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, D9) - 104usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::D10"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, D10) - 112usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::D11"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, D11) - 120usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::D12"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, D12) - 128usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::D13"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, D13) - 136usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::D14"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, D14) - 144usize];
    ["Offset of field: _KNONVOLATILE_CONTEXT_POINTERS_ARM64::D15"]
        [::std::mem::offset_of!(_KNONVOLATILE_CONTEXT_POINTERS_ARM64, D15) - 152usize];
};
pub type KNONVOLATILE_CONTEXT_POINTERS_ARM64 = _KNONVOLATILE_CONTEXT_POINTERS_ARM64;
pub type PKNONVOLATILE_CONTEXT_POINTERS_ARM64 = *mut _KNONVOLATILE_CONTEXT_POINTERS_ARM64;
unsafe extern "C" {
    pub fn __int2c() -> !;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _LDT_ENTRY {
    pub LimitLow: WORD,
    pub BaseLow: WORD,
    pub HighWord: _LDT_ENTRY__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _LDT_ENTRY__bindgen_ty_1 {
    pub Bytes: _LDT_ENTRY__bindgen_ty_1__bindgen_ty_1,
    pub Bits: _LDT_ENTRY__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LDT_ENTRY__bindgen_ty_1__bindgen_ty_1 {
    pub BaseMid: BYTE,
    pub Flags1: BYTE,
    pub Flags2: BYTE,
    pub BaseHi: BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LDT_ENTRY__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of _LDT_ENTRY__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    ["Offset of field: _LDT_ENTRY__bindgen_ty_1__bindgen_ty_1::BaseMid"]
        [::std::mem::offset_of!(_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1, BaseMid) - 0usize];
    ["Offset of field: _LDT_ENTRY__bindgen_ty_1__bindgen_ty_1::Flags1"]
        [::std::mem::offset_of!(_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1, Flags1) - 1usize];
    ["Offset of field: _LDT_ENTRY__bindgen_ty_1__bindgen_ty_1::Flags2"]
        [::std::mem::offset_of!(_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1, Flags2) - 2usize];
    ["Offset of field: _LDT_ENTRY__bindgen_ty_1__bindgen_ty_1::BaseHi"]
        [::std::mem::offset_of!(_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1, BaseHi) - 3usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _LDT_ENTRY__bindgen_ty_1__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LDT_ENTRY__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Alignment of _LDT_ENTRY__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2>() - 4usize];
};
impl _LDT_ENTRY__bindgen_ty_1__bindgen_ty_2 {
    #[inline]
    pub fn BaseMid(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_BaseMid(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn BaseMid_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_BaseMid_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Type(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_Type(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Type_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                5u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Type_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Dpl(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_Dpl(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Dpl_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Dpl_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Pres(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Pres(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Pres_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Pres_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn LimitHi(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_LimitHi(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn LimitHi_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                4u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_LimitHi_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Sys(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Sys(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Sys_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Sys_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Reserved_0(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved_0(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved_0_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                21usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved_0_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                21usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Default_Big(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Default_Big(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Default_Big_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                22usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Default_Big_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                22usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Granularity(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Granularity(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Granularity_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                23usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Granularity_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                23usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn BaseHi(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_BaseHi(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn BaseHi_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_BaseHi_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        BaseMid: DWORD,
        Type: DWORD,
        Dpl: DWORD,
        Pres: DWORD,
        LimitHi: DWORD,
        Sys: DWORD,
        Reserved_0: DWORD,
        Default_Big: DWORD,
        Granularity: DWORD,
        BaseHi: DWORD,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let BaseMid: u32 = unsafe { ::std::mem::transmute(BaseMid) };
            BaseMid as u64
        });
        __bindgen_bitfield_unit.set(8usize, 5u8, {
            let Type: u32 = unsafe { ::std::mem::transmute(Type) };
            Type as u64
        });
        __bindgen_bitfield_unit.set(13usize, 2u8, {
            let Dpl: u32 = unsafe { ::std::mem::transmute(Dpl) };
            Dpl as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let Pres: u32 = unsafe { ::std::mem::transmute(Pres) };
            Pres as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let LimitHi: u32 = unsafe { ::std::mem::transmute(LimitHi) };
            LimitHi as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let Sys: u32 = unsafe { ::std::mem::transmute(Sys) };
            Sys as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let Reserved_0: u32 = unsafe { ::std::mem::transmute(Reserved_0) };
            Reserved_0 as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let Default_Big: u32 = unsafe { ::std::mem::transmute(Default_Big) };
            Default_Big as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let Granularity: u32 = unsafe { ::std::mem::transmute(Granularity) };
            Granularity as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let BaseHi: u32 = unsafe { ::std::mem::transmute(BaseHi) };
            BaseHi as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LDT_ENTRY__bindgen_ty_1"]
        [::std::mem::size_of::<_LDT_ENTRY__bindgen_ty_1>() - 4usize];
    ["Alignment of _LDT_ENTRY__bindgen_ty_1"]
        [::std::mem::align_of::<_LDT_ENTRY__bindgen_ty_1>() - 4usize];
    ["Offset of field: _LDT_ENTRY__bindgen_ty_1::Bytes"]
        [::std::mem::offset_of!(_LDT_ENTRY__bindgen_ty_1, Bytes) - 0usize];
    ["Offset of field: _LDT_ENTRY__bindgen_ty_1::Bits"]
        [::std::mem::offset_of!(_LDT_ENTRY__bindgen_ty_1, Bits) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LDT_ENTRY"][::std::mem::size_of::<_LDT_ENTRY>() - 8usize];
    ["Alignment of _LDT_ENTRY"][::std::mem::align_of::<_LDT_ENTRY>() - 4usize];
    ["Offset of field: _LDT_ENTRY::LimitLow"]
        [::std::mem::offset_of!(_LDT_ENTRY, LimitLow) - 0usize];
    ["Offset of field: _LDT_ENTRY::BaseLow"][::std::mem::offset_of!(_LDT_ENTRY, BaseLow) - 2usize];
    ["Offset of field: _LDT_ENTRY::HighWord"]
        [::std::mem::offset_of!(_LDT_ENTRY, HighWord) - 4usize];
};
pub type LDT_ENTRY = _LDT_ENTRY;
pub type PLDT_ENTRY = *mut _LDT_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WOW64_FLOATING_SAVE_AREA {
    pub ControlWord: DWORD,
    pub StatusWord: DWORD,
    pub TagWord: DWORD,
    pub ErrorOffset: DWORD,
    pub ErrorSelector: DWORD,
    pub DataOffset: DWORD,
    pub DataSelector: DWORD,
    pub RegisterArea: [BYTE; 80usize],
    pub Cr0NpxState: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _WOW64_FLOATING_SAVE_AREA"]
        [::std::mem::size_of::<_WOW64_FLOATING_SAVE_AREA>() - 112usize];
    ["Alignment of _WOW64_FLOATING_SAVE_AREA"]
        [::std::mem::align_of::<_WOW64_FLOATING_SAVE_AREA>() - 4usize];
    ["Offset of field: _WOW64_FLOATING_SAVE_AREA::ControlWord"]
        [::std::mem::offset_of!(_WOW64_FLOATING_SAVE_AREA, ControlWord) - 0usize];
    ["Offset of field: _WOW64_FLOATING_SAVE_AREA::StatusWord"]
        [::std::mem::offset_of!(_WOW64_FLOATING_SAVE_AREA, StatusWord) - 4usize];
    ["Offset of field: _WOW64_FLOATING_SAVE_AREA::TagWord"]
        [::std::mem::offset_of!(_WOW64_FLOATING_SAVE_AREA, TagWord) - 8usize];
    ["Offset of field: _WOW64_FLOATING_SAVE_AREA::ErrorOffset"]
        [::std::mem::offset_of!(_WOW64_FLOATING_SAVE_AREA, ErrorOffset) - 12usize];
    ["Offset of field: _WOW64_FLOATING_SAVE_AREA::ErrorSelector"]
        [::std::mem::offset_of!(_WOW64_FLOATING_SAVE_AREA, ErrorSelector) - 16usize];
    ["Offset of field: _WOW64_FLOATING_SAVE_AREA::DataOffset"]
        [::std::mem::offset_of!(_WOW64_FLOATING_SAVE_AREA, DataOffset) - 20usize];
    ["Offset of field: _WOW64_FLOATING_SAVE_AREA::DataSelector"]
        [::std::mem::offset_of!(_WOW64_FLOATING_SAVE_AREA, DataSelector) - 24usize];
    ["Offset of field: _WOW64_FLOATING_SAVE_AREA::RegisterArea"]
        [::std::mem::offset_of!(_WOW64_FLOATING_SAVE_AREA, RegisterArea) - 28usize];
    ["Offset of field: _WOW64_FLOATING_SAVE_AREA::Cr0NpxState"]
        [::std::mem::offset_of!(_WOW64_FLOATING_SAVE_AREA, Cr0NpxState) - 108usize];
};
pub type WOW64_FLOATING_SAVE_AREA = _WOW64_FLOATING_SAVE_AREA;
pub type PWOW64_FLOATING_SAVE_AREA = *mut WOW64_FLOATING_SAVE_AREA;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WOW64_CONTEXT {
    pub ContextFlags: DWORD,
    pub Dr0: DWORD,
    pub Dr1: DWORD,
    pub Dr2: DWORD,
    pub Dr3: DWORD,
    pub Dr6: DWORD,
    pub Dr7: DWORD,
    pub FloatSave: WOW64_FLOATING_SAVE_AREA,
    pub SegGs: DWORD,
    pub SegFs: DWORD,
    pub SegEs: DWORD,
    pub SegDs: DWORD,
    pub Edi: DWORD,
    pub Esi: DWORD,
    pub Ebx: DWORD,
    pub Edx: DWORD,
    pub Ecx: DWORD,
    pub Eax: DWORD,
    pub Ebp: DWORD,
    pub Eip: DWORD,
    pub SegCs: DWORD,
    pub EFlags: DWORD,
    pub Esp: DWORD,
    pub SegSs: DWORD,
    pub ExtendedRegisters: [BYTE; 512usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _WOW64_CONTEXT"][::std::mem::size_of::<_WOW64_CONTEXT>() - 716usize];
    ["Alignment of _WOW64_CONTEXT"][::std::mem::align_of::<_WOW64_CONTEXT>() - 4usize];
    ["Offset of field: _WOW64_CONTEXT::ContextFlags"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, ContextFlags) - 0usize];
    ["Offset of field: _WOW64_CONTEXT::Dr0"][::std::mem::offset_of!(_WOW64_CONTEXT, Dr0) - 4usize];
    ["Offset of field: _WOW64_CONTEXT::Dr1"][::std::mem::offset_of!(_WOW64_CONTEXT, Dr1) - 8usize];
    ["Offset of field: _WOW64_CONTEXT::Dr2"][::std::mem::offset_of!(_WOW64_CONTEXT, Dr2) - 12usize];
    ["Offset of field: _WOW64_CONTEXT::Dr3"][::std::mem::offset_of!(_WOW64_CONTEXT, Dr3) - 16usize];
    ["Offset of field: _WOW64_CONTEXT::Dr6"][::std::mem::offset_of!(_WOW64_CONTEXT, Dr6) - 20usize];
    ["Offset of field: _WOW64_CONTEXT::Dr7"][::std::mem::offset_of!(_WOW64_CONTEXT, Dr7) - 24usize];
    ["Offset of field: _WOW64_CONTEXT::FloatSave"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, FloatSave) - 28usize];
    ["Offset of field: _WOW64_CONTEXT::SegGs"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, SegGs) - 140usize];
    ["Offset of field: _WOW64_CONTEXT::SegFs"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, SegFs) - 144usize];
    ["Offset of field: _WOW64_CONTEXT::SegEs"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, SegEs) - 148usize];
    ["Offset of field: _WOW64_CONTEXT::SegDs"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, SegDs) - 152usize];
    ["Offset of field: _WOW64_CONTEXT::Edi"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, Edi) - 156usize];
    ["Offset of field: _WOW64_CONTEXT::Esi"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, Esi) - 160usize];
    ["Offset of field: _WOW64_CONTEXT::Ebx"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, Ebx) - 164usize];
    ["Offset of field: _WOW64_CONTEXT::Edx"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, Edx) - 168usize];
    ["Offset of field: _WOW64_CONTEXT::Ecx"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, Ecx) - 172usize];
    ["Offset of field: _WOW64_CONTEXT::Eax"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, Eax) - 176usize];
    ["Offset of field: _WOW64_CONTEXT::Ebp"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, Ebp) - 180usize];
    ["Offset of field: _WOW64_CONTEXT::Eip"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, Eip) - 184usize];
    ["Offset of field: _WOW64_CONTEXT::SegCs"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, SegCs) - 188usize];
    ["Offset of field: _WOW64_CONTEXT::EFlags"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, EFlags) - 192usize];
    ["Offset of field: _WOW64_CONTEXT::Esp"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, Esp) - 196usize];
    ["Offset of field: _WOW64_CONTEXT::SegSs"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, SegSs) - 200usize];
    ["Offset of field: _WOW64_CONTEXT::ExtendedRegisters"]
        [::std::mem::offset_of!(_WOW64_CONTEXT, ExtendedRegisters) - 204usize];
};
pub type WOW64_CONTEXT = _WOW64_CONTEXT;
pub type PWOW64_CONTEXT = *mut WOW64_CONTEXT;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _WOW64_LDT_ENTRY {
    pub LimitLow: WORD,
    pub BaseLow: WORD,
    pub HighWord: _WOW64_LDT_ENTRY__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _WOW64_LDT_ENTRY__bindgen_ty_1 {
    pub Bytes: _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1,
    pub Bits: _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1 {
    pub BaseMid: BYTE,
    pub Flags1: BYTE,
    pub Flags2: BYTE,
    pub BaseHi: BYTE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::size_of::<_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Alignment of _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1"]
        [::std::mem::align_of::<_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1>() - 1usize];
    ["Offset of field: _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1::BaseMid"]
        [::std::mem::offset_of!(_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1, BaseMid) - 0usize];
    ["Offset of field: _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1::Flags1"]
        [::std::mem::offset_of!(_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1, Flags1) - 1usize];
    ["Offset of field: _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1::Flags2"]
        [::std::mem::offset_of!(_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1, Flags2) - 2usize];
    ["Offset of field: _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1::BaseHi"]
        [::std::mem::offset_of!(_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_1, BaseHi) - 3usize];
};
#[repr(C)]
#[repr(align(4))]
#[derive(Debug, Copy, Clone)]
pub struct _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::size_of::<_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2>() - 4usize];
    ["Alignment of _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2"]
        [::std::mem::align_of::<_WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2>() - 4usize];
};
impl _WOW64_LDT_ENTRY__bindgen_ty_1__bindgen_ty_2 {
    #[inline]
    pub fn BaseMid(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_BaseMid(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn BaseMid_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_BaseMid_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Type(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 5u8) as u32) }
    }
    #[inline]
    pub fn set_Type(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Type_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                5u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Type_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Dpl(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(13usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_Dpl(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(13usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Dpl_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                2u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Dpl_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                2u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Pres(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Pres(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Pres_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Pres_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn LimitHi(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_LimitHi(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn LimitHi_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                4u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_LimitHi_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                4u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Sys(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Sys(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Sys_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Sys_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Reserved_0(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Reserved_0(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Reserved_0_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                21usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Reserved_0_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                21usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Default_Big(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Default_Big(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Default_Big_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                22usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Default_Big_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                22usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn Granularity(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_Granularity(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn Granularity_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                23usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_Granularity_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                23usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn BaseHi(&self) -> DWORD {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(24usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_BaseHi(&mut self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(24usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn BaseHi_raw(this: *const Self) -> DWORD {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                8u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_BaseHi_raw(this: *mut Self, val: DWORD) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        BaseMid: DWORD,
        Type: DWORD,
        Dpl: DWORD,
        Pres: DWORD,
        LimitHi: DWORD,
        Sys: DWORD,
        Reserved_0: DWORD,
        Default_Big: DWORD,
        Granularity: DWORD,
        BaseHi: DWORD,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 8u8, {
            let BaseMid: u32 = unsafe { ::std::mem::transmute(BaseMid) };
            BaseMid as u64
        });
        __bindgen_bitfield_unit.set(8usize, 5u8, {
            let Type: u32 = unsafe { ::std::mem::transmute(Type) };
            Type as u64
        });
        __bindgen_bitfield_unit.set(13usize, 2u8, {
            let Dpl: u32 = unsafe { ::std::mem::transmute(Dpl) };
            Dpl as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let Pres: u32 = unsafe { ::std::mem::transmute(Pres) };
            Pres as u64
        });
        __bindgen_bitfield_unit.set(16usize, 4u8, {
            let LimitHi: u32 = unsafe { ::std::mem::transmute(LimitHi) };
            LimitHi as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let Sys: u32 = unsafe { ::std::mem::transmute(Sys) };
            Sys as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let Reserved_0: u32 = unsafe { ::std::mem::transmute(Reserved_0) };
            Reserved_0 as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let Default_Big: u32 = unsafe { ::std::mem::transmute(Default_Big) };
            Default_Big as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let Granularity: u32 = unsafe { ::std::mem::transmute(Granularity) };
            Granularity as u64
        });
        __bindgen_bitfield_unit.set(24usize, 8u8, {
            let BaseHi: u32 = unsafe { ::std::mem::transmute(BaseHi) };
            BaseHi as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _WOW64_LDT_ENTRY__bindgen_ty_1"]
        [::std::mem::size_of::<_WOW64_LDT_ENTRY__bindgen_ty_1>() - 4usize];
    ["Alignment of _WOW64_LDT_ENTRY__bindgen_ty_1"]
        [::std::mem::align_of::<_WOW64_LDT_ENTRY__bindgen_ty_1>() - 4usize];
    ["Offset of field: _WOW64_LDT_ENTRY__bindgen_ty_1::Bytes"]
        [::std::mem::offset_of!(_WOW64_LDT_ENTRY__bindgen_ty_1, Bytes) - 0usize];
    ["Offset of field: _WOW64_LDT_ENTRY__bindgen_ty_1::Bits"]
        [::std::mem::offset_of!(_WOW64_LDT_ENTRY__bindgen_ty_1, Bits) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _WOW64_LDT_ENTRY"][::std::mem::size_of::<_WOW64_LDT_ENTRY>() - 8usize];
    ["Alignment of _WOW64_LDT_ENTRY"][::std::mem::align_of::<_WOW64_LDT_ENTRY>() - 4usize];
    ["Offset of field: _WOW64_LDT_ENTRY::LimitLow"]
        [::std::mem::offset_of!(_WOW64_LDT_ENTRY, LimitLow) - 0usize];
    ["Offset of field: _WOW64_LDT_ENTRY::BaseLow"]
        [::std::mem::offset_of!(_WOW64_LDT_ENTRY, BaseLow) - 2usize];
    ["Offset of field: _WOW64_LDT_ENTRY::HighWord"]
        [::std::mem::offset_of!(_WOW64_LDT_ENTRY, HighWord) - 4usize];
};
pub type WOW64_LDT_ENTRY = _WOW64_LDT_ENTRY;
pub type PWOW64_LDT_ENTRY = *mut _WOW64_LDT_ENTRY;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _WOW64_DESCRIPTOR_TABLE_ENTRY {
    pub Selector: DWORD,
    pub Descriptor: WOW64_LDT_ENTRY,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _WOW64_DESCRIPTOR_TABLE_ENTRY"]
        [::std::mem::size_of::<_WOW64_DESCRIPTOR_TABLE_ENTRY>() - 12usize];
    ["Alignment of _WOW64_DESCRIPTOR_TABLE_ENTRY"]
        [::std::mem::align_of::<_WOW64_DESCRIPTOR_TABLE_ENTRY>() - 4usize];
    ["Offset of field: _WOW64_DESCRIPTOR_TABLE_ENTRY::Selector"]
        [::std::mem::offset_of!(_WOW64_DESCRIPTOR_TABLE_ENTRY, Selector) - 0usize];
    ["Offset of field: _WOW64_DESCRIPTOR_TABLE_ENTRY::Descriptor"]
        [::std::mem::offset_of!(_WOW64_DESCRIPTOR_TABLE_ENTRY, Descriptor) - 4usize];
};
pub type WOW64_DESCRIPTOR_TABLE_ENTRY = _WOW64_DESCRIPTOR_TABLE_ENTRY;
pub type PWOW64_DESCRIPTOR_TABLE_ENTRY = *mut _WOW64_DESCRIPTOR_TABLE_ENTRY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _EXCEPTION_RECORD {
    pub ExceptionCode: DWORD,
    pub ExceptionFlags: DWORD,
    pub ExceptionRecord: *mut _EXCEPTION_RECORD,
    pub ExceptionAddress: PVOID,
    pub NumberParameters: DWORD,
    pub ExceptionInformation: [ULONG_PTR; 15usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _EXCEPTION_RECORD"][::std::mem::size_of::<_EXCEPTION_RECORD>() - 152usize];
    ["Alignment of _EXCEPTION_RECORD"][::std::mem::align_of::<_EXCEPTION_RECORD>() - 8usize];
    ["Offset of field: _EXCEPTION_RECORD::ExceptionCode"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD, ExceptionCode) - 0usize];
    ["Offset of field: _EXCEPTION_RECORD::ExceptionFlags"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD, ExceptionFlags) - 4usize];
    ["Offset of field: _EXCEPTION_RECORD::ExceptionRecord"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD, ExceptionRecord) - 8usize];
    ["Offset of field: _EXCEPTION_RECORD::ExceptionAddress"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD, ExceptionAddress) - 16usize];
    ["Offset of field: _EXCEPTION_RECORD::NumberParameters"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD, NumberParameters) - 24usize];
    ["Offset of field: _EXCEPTION_RECORD::ExceptionInformation"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD, ExceptionInformation) - 32usize];
};
pub type EXCEPTION_RECORD = _EXCEPTION_RECORD;
pub type PEXCEPTION_RECORD = *mut EXCEPTION_RECORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _EXCEPTION_RECORD32 {
    pub ExceptionCode: DWORD,
    pub ExceptionFlags: DWORD,
    pub ExceptionRecord: DWORD,
    pub ExceptionAddress: DWORD,
    pub NumberParameters: DWORD,
    pub ExceptionInformation: [DWORD; 15usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _EXCEPTION_RECORD32"][::std::mem::size_of::<_EXCEPTION_RECORD32>() - 80usize];
    ["Alignment of _EXCEPTION_RECORD32"][::std::mem::align_of::<_EXCEPTION_RECORD32>() - 4usize];
    ["Offset of field: _EXCEPTION_RECORD32::ExceptionCode"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD32, ExceptionCode) - 0usize];
    ["Offset of field: _EXCEPTION_RECORD32::ExceptionFlags"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD32, ExceptionFlags) - 4usize];
    ["Offset of field: _EXCEPTION_RECORD32::ExceptionRecord"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD32, ExceptionRecord) - 8usize];
    ["Offset of field: _EXCEPTION_RECORD32::ExceptionAddress"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD32, ExceptionAddress) - 12usize];
    ["Offset of field: _EXCEPTION_RECORD32::NumberParameters"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD32, NumberParameters) - 16usize];
    ["Offset of field: _EXCEPTION_RECORD32::ExceptionInformation"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD32, ExceptionInformation) - 20usize];
};
pub type EXCEPTION_RECORD32 = _EXCEPTION_RECORD32;
pub type PEXCEPTION_RECORD32 = *mut _EXCEPTION_RECORD32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _EXCEPTION_RECORD64 {
    pub ExceptionCode: DWORD,
    pub ExceptionFlags: DWORD,
    pub ExceptionRecord: DWORD64,
    pub ExceptionAddress: DWORD64,
    pub NumberParameters: DWORD,
    pub __unusedAlignment: DWORD,
    pub ExceptionInformation: [DWORD64; 15usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _EXCEPTION_RECORD64"][::std::mem::size_of::<_EXCEPTION_RECORD64>() - 152usize];
    ["Alignment of _EXCEPTION_RECORD64"][::std::mem::align_of::<_EXCEPTION_RECORD64>() - 8usize];
    ["Offset of field: _EXCEPTION_RECORD64::ExceptionCode"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD64, ExceptionCode) - 0usize];
    ["Offset of field: _EXCEPTION_RECORD64::ExceptionFlags"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD64, ExceptionFlags) - 4usize];
    ["Offset of field: _EXCEPTION_RECORD64::ExceptionRecord"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD64, ExceptionRecord) - 8usize];
    ["Offset of field: _EXCEPTION_RECORD64::ExceptionAddress"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD64, ExceptionAddress) - 16usize];
    ["Offset of field: _EXCEPTION_RECORD64::NumberParameters"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD64, NumberParameters) - 24usize];
    ["Offset of field: _EXCEPTION_RECORD64::__unusedAlignment"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD64, __unusedAlignment) - 28usize];
    ["Offset of field: _EXCEPTION_RECORD64::ExceptionInformation"]
        [::std::mem::offset_of!(_EXCEPTION_RECORD64, ExceptionInformation) - 32usize];
};
pub type EXCEPTION_RECORD64 = _EXCEPTION_RECORD64;
pub type PEXCEPTION_RECORD64 = *mut _EXCEPTION_RECORD64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _EXCEPTION_POINTERS {
    pub ExceptionRecord: PEXCEPTION_RECORD,
    pub ContextRecord: PCONTEXT,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _EXCEPTION_POINTERS"][::std::mem::size_of::<_EXCEPTION_POINTERS>() - 16usize];
    ["Alignment of _EXCEPTION_POINTERS"][::std::mem::align_of::<_EXCEPTION_POINTERS>() - 8usize];
    ["Offset of field: _EXCEPTION_POINTERS::ExceptionRecord"]
        [::std::mem::offset_of!(_EXCEPTION_POINTERS, ExceptionRecord) - 0usize];
    ["Offset of field: _EXCEPTION_POINTERS::ContextRecord"]
        [::std::mem::offset_of!(_EXCEPTION_POINTERS, ContextRecord) - 8usize];
};
pub type EXCEPTION_POINTERS = _EXCEPTION_POINTERS;
pub type PEXCEPTION_POINTERS = *mut _EXCEPTION_POINTERS;
pub type PACCESS_TOKEN = PVOID;
pub type PSECURITY_DESCRIPTOR = PVOID;
pub type PSID = PVOID;
pub type PCLAIMS_BLOB = PVOID;
pub type ACCESS_MASK = DWORD;
pub type PACCESS_MASK = *mut ACCESS_MASK;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _GENERIC_MAPPING {
    pub GenericRead: ACCESS_MASK,
    pub GenericWrite: ACCESS_MASK,
    pub GenericExecute: ACCESS_MASK,
    pub GenericAll: ACCESS_MASK,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _GENERIC_MAPPING"][::std::mem::size_of::<_GENERIC_MAPPING>() - 16usize];
    ["Alignment of _GENERIC_MAPPING"][::std::mem::align_of::<_GENERIC_MAPPING>() - 4usize];
    ["Offset of field: _GENERIC_MAPPING::GenericRead"]
        [::std::mem::offset_of!(_GENERIC_MAPPING, GenericRead) - 0usize];
    ["Offset of field: _GENERIC_MAPPING::GenericWrite"]
        [::std::mem::offset_of!(_GENERIC_MAPPING, GenericWrite) - 4usize];
    ["Offset of field: _GENERIC_MAPPING::GenericExecute"]
        [::std::mem::offset_of!(_GENERIC_MAPPING, GenericExecute) - 8usize];
    ["Offset of field: _GENERIC_MAPPING::GenericAll"]
        [::std::mem::offset_of!(_GENERIC_MAPPING, GenericAll) - 12usize];
};
pub type GENERIC_MAPPING = _GENERIC_MAPPING;
pub type PGENERIC_MAPPING = *mut GENERIC_MAPPING;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _LUID_AND_ATTRIBUTES {
    pub Luid: LUID,
    pub Attributes: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _LUID_AND_ATTRIBUTES"][::std::mem::size_of::<_LUID_AND_ATTRIBUTES>() - 12usize];
    ["Alignment of _LUID_AND_ATTRIBUTES"][::std::mem::align_of::<_LUID_AND_ATTRIBUTES>() - 4usize];
    ["Offset of field: _LUID_AND_ATTRIBUTES::Luid"]
        [::std::mem::offset_of!(_LUID_AND_ATTRIBUTES, Luid) - 0usize];
    ["Offset of field: _LUID_AND_ATTRIBUTES::Attributes"]
        [::std::mem::offset_of!(_LUID_AND_ATTRIBUTES, Attributes) - 8usize];
};
pub type LUID_AND_ATTRIBUTES = _LUID_AND_ATTRIBUTES;
pub type PLUID_AND_ATTRIBUTES = *mut _LUID_AND_ATTRIBUTES;
pub type LUID_AND_ATTRIBUTES_ARRAY = [LUID_AND_ATTRIBUTES; 1usize];
pub type PLUID_AND_ATTRIBUTES_ARRAY = *mut LUID_AND_ATTRIBUTES_ARRAY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID_IDENTIFIER_AUTHORITY {
    pub Value: [BYTE; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SID_IDENTIFIER_AUTHORITY"]
        [::std::mem::size_of::<_SID_IDENTIFIER_AUTHORITY>() - 6usize];
    ["Alignment of _SID_IDENTIFIER_AUTHORITY"]
        [::std::mem::align_of::<_SID_IDENTIFIER_AUTHORITY>() - 1usize];
    ["Offset of field: _SID_IDENTIFIER_AUTHORITY::Value"]
        [::std::mem::offset_of!(_SID_IDENTIFIER_AUTHORITY, Value) - 0usize];
};
pub type SID_IDENTIFIER_AUTHORITY = _SID_IDENTIFIER_AUTHORITY;
pub type PSID_IDENTIFIER_AUTHORITY = *mut _SID_IDENTIFIER_AUTHORITY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID {
    pub Revision: BYTE,
    pub SubAuthorityCount: BYTE,
    pub IdentifierAuthority: SID_IDENTIFIER_AUTHORITY,
    pub SubAuthority: [DWORD; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SID"][::std::mem::size_of::<_SID>() - 12usize];
    ["Alignment of _SID"][::std::mem::align_of::<_SID>() - 4usize];
    ["Offset of field: _SID::Revision"][::std::mem::offset_of!(_SID, Revision) - 0usize];
    ["Offset of field: _SID::SubAuthorityCount"]
        [::std::mem::offset_of!(_SID, SubAuthorityCount) - 1usize];
    ["Offset of field: _SID::IdentifierAuthority"]
        [::std::mem::offset_of!(_SID, IdentifierAuthority) - 2usize];
    ["Offset of field: _SID::SubAuthority"][::std::mem::offset_of!(_SID, SubAuthority) - 8usize];
};
pub type SID = _SID;
pub type PISID = *mut _SID;
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SE_SID {
    pub Sid: SID,
    pub Buffer: [BYTE; 68usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SE_SID"][::std::mem::size_of::<_SE_SID>() - 68usize];
    ["Alignment of _SE_SID"][::std::mem::align_of::<_SE_SID>() - 4usize];
    ["Offset of field: _SE_SID::Sid"][::std::mem::offset_of!(_SE_SID, Sid) - 0usize];
    ["Offset of field: _SE_SID::Buffer"][::std::mem::offset_of!(_SE_SID, Buffer) - 0usize];
};
pub type SE_SID = _SE_SID;
pub type PSE_SID = *mut _SE_SID;
pub const _SID_NAME_USE_SidTypeUser: _SID_NAME_USE = 1;
pub const _SID_NAME_USE_SidTypeGroup: _SID_NAME_USE = 2;
pub const _SID_NAME_USE_SidTypeDomain: _SID_NAME_USE = 3;
pub const _SID_NAME_USE_SidTypeAlias: _SID_NAME_USE = 4;
pub const _SID_NAME_USE_SidTypeWellKnownGroup: _SID_NAME_USE = 5;
pub const _SID_NAME_USE_SidTypeDeletedAccount: _SID_NAME_USE = 6;
pub const _SID_NAME_USE_SidTypeInvalid: _SID_NAME_USE = 7;
pub const _SID_NAME_USE_SidTypeUnknown: _SID_NAME_USE = 8;
pub const _SID_NAME_USE_SidTypeComputer: _SID_NAME_USE = 9;
pub const _SID_NAME_USE_SidTypeLabel: _SID_NAME_USE = 10;
pub const _SID_NAME_USE_SidTypeLogonSession: _SID_NAME_USE = 11;
pub type _SID_NAME_USE = ::std::os::raw::c_int;
pub use self::_SID_NAME_USE as SID_NAME_USE;
pub type PSID_NAME_USE = *mut _SID_NAME_USE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID_AND_ATTRIBUTES {
    pub Sid: PSID,
    pub Attributes: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SID_AND_ATTRIBUTES"][::std::mem::size_of::<_SID_AND_ATTRIBUTES>() - 16usize];
    ["Alignment of _SID_AND_ATTRIBUTES"][::std::mem::align_of::<_SID_AND_ATTRIBUTES>() - 8usize];
    ["Offset of field: _SID_AND_ATTRIBUTES::Sid"]
        [::std::mem::offset_of!(_SID_AND_ATTRIBUTES, Sid) - 0usize];
    ["Offset of field: _SID_AND_ATTRIBUTES::Attributes"]
        [::std::mem::offset_of!(_SID_AND_ATTRIBUTES, Attributes) - 8usize];
};
pub type SID_AND_ATTRIBUTES = _SID_AND_ATTRIBUTES;
pub type PSID_AND_ATTRIBUTES = *mut _SID_AND_ATTRIBUTES;
pub type SID_AND_ATTRIBUTES_ARRAY = [SID_AND_ATTRIBUTES; 1usize];
pub type PSID_AND_ATTRIBUTES_ARRAY = *mut SID_AND_ATTRIBUTES_ARRAY;
pub type SID_HASH_ENTRY = ULONG_PTR;
pub type PSID_HASH_ENTRY = *mut ULONG_PTR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SID_AND_ATTRIBUTES_HASH {
    pub SidCount: DWORD,
    pub SidAttr: PSID_AND_ATTRIBUTES,
    pub Hash: [SID_HASH_ENTRY; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SID_AND_ATTRIBUTES_HASH"]
        [::std::mem::size_of::<_SID_AND_ATTRIBUTES_HASH>() - 272usize];
    ["Alignment of _SID_AND_ATTRIBUTES_HASH"]
        [::std::mem::align_of::<_SID_AND_ATTRIBUTES_HASH>() - 8usize];
    ["Offset of field: _SID_AND_ATTRIBUTES_HASH::SidCount"]
        [::std::mem::offset_of!(_SID_AND_ATTRIBUTES_HASH, SidCount) - 0usize];
    ["Offset of field: _SID_AND_ATTRIBUTES_HASH::SidAttr"]
        [::std::mem::offset_of!(_SID_AND_ATTRIBUTES_HASH, SidAttr) - 8usize];
    ["Offset of field: _SID_AND_ATTRIBUTES_HASH::Hash"]
        [::std::mem::offset_of!(_SID_AND_ATTRIBUTES_HASH, Hash) - 16usize];
};
pub type SID_AND_ATTRIBUTES_HASH = _SID_AND_ATTRIBUTES_HASH;
pub type PSID_AND_ATTRIBUTES_HASH = *mut _SID_AND_ATTRIBUTES_HASH;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ATTRIBUTES_AND_SID {
    pub Attributes: UINT32,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ATTRIBUTES_AND_SID"][::std::mem::size_of::<_ATTRIBUTES_AND_SID>() - 8usize];
    ["Alignment of _ATTRIBUTES_AND_SID"][::std::mem::align_of::<_ATTRIBUTES_AND_SID>() - 4usize];
    ["Offset of field: _ATTRIBUTES_AND_SID::Attributes"]
        [::std::mem::offset_of!(_ATTRIBUTES_AND_SID, Attributes) - 0usize];
    ["Offset of field: _ATTRIBUTES_AND_SID::SidStart"]
        [::std::mem::offset_of!(_ATTRIBUTES_AND_SID, SidStart) - 4usize];
};
pub type ATTRIBUTES_AND_SID = _ATTRIBUTES_AND_SID;
pub type PATTRIBUTES_AND_SID = *mut _ATTRIBUTES_AND_SID;
pub const WELL_KNOWN_SID_TYPE_WinNullSid: WELL_KNOWN_SID_TYPE = 0;
pub const WELL_KNOWN_SID_TYPE_WinWorldSid: WELL_KNOWN_SID_TYPE = 1;
pub const WELL_KNOWN_SID_TYPE_WinLocalSid: WELL_KNOWN_SID_TYPE = 2;
pub const WELL_KNOWN_SID_TYPE_WinCreatorOwnerSid: WELL_KNOWN_SID_TYPE = 3;
pub const WELL_KNOWN_SID_TYPE_WinCreatorGroupSid: WELL_KNOWN_SID_TYPE = 4;
pub const WELL_KNOWN_SID_TYPE_WinCreatorOwnerServerSid: WELL_KNOWN_SID_TYPE = 5;
pub const WELL_KNOWN_SID_TYPE_WinCreatorGroupServerSid: WELL_KNOWN_SID_TYPE = 6;
pub const WELL_KNOWN_SID_TYPE_WinNtAuthoritySid: WELL_KNOWN_SID_TYPE = 7;
pub const WELL_KNOWN_SID_TYPE_WinDialupSid: WELL_KNOWN_SID_TYPE = 8;
pub const WELL_KNOWN_SID_TYPE_WinNetworkSid: WELL_KNOWN_SID_TYPE = 9;
pub const WELL_KNOWN_SID_TYPE_WinBatchSid: WELL_KNOWN_SID_TYPE = 10;
pub const WELL_KNOWN_SID_TYPE_WinInteractiveSid: WELL_KNOWN_SID_TYPE = 11;
pub const WELL_KNOWN_SID_TYPE_WinServiceSid: WELL_KNOWN_SID_TYPE = 12;
pub const WELL_KNOWN_SID_TYPE_WinAnonymousSid: WELL_KNOWN_SID_TYPE = 13;
pub const WELL_KNOWN_SID_TYPE_WinProxySid: WELL_KNOWN_SID_TYPE = 14;
pub const WELL_KNOWN_SID_TYPE_WinEnterpriseControllersSid: WELL_KNOWN_SID_TYPE = 15;
pub const WELL_KNOWN_SID_TYPE_WinSelfSid: WELL_KNOWN_SID_TYPE = 16;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticatedUserSid: WELL_KNOWN_SID_TYPE = 17;
pub const WELL_KNOWN_SID_TYPE_WinRestrictedCodeSid: WELL_KNOWN_SID_TYPE = 18;
pub const WELL_KNOWN_SID_TYPE_WinTerminalServerSid: WELL_KNOWN_SID_TYPE = 19;
pub const WELL_KNOWN_SID_TYPE_WinRemoteLogonIdSid: WELL_KNOWN_SID_TYPE = 20;
pub const WELL_KNOWN_SID_TYPE_WinLogonIdsSid: WELL_KNOWN_SID_TYPE = 21;
pub const WELL_KNOWN_SID_TYPE_WinLocalSystemSid: WELL_KNOWN_SID_TYPE = 22;
pub const WELL_KNOWN_SID_TYPE_WinLocalServiceSid: WELL_KNOWN_SID_TYPE = 23;
pub const WELL_KNOWN_SID_TYPE_WinNetworkServiceSid: WELL_KNOWN_SID_TYPE = 24;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinDomainSid: WELL_KNOWN_SID_TYPE = 25;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinAdministratorsSid: WELL_KNOWN_SID_TYPE = 26;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinUsersSid: WELL_KNOWN_SID_TYPE = 27;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinGuestsSid: WELL_KNOWN_SID_TYPE = 28;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinPowerUsersSid: WELL_KNOWN_SID_TYPE = 29;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinAccountOperatorsSid: WELL_KNOWN_SID_TYPE = 30;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinSystemOperatorsSid: WELL_KNOWN_SID_TYPE = 31;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinPrintOperatorsSid: WELL_KNOWN_SID_TYPE = 32;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinBackupOperatorsSid: WELL_KNOWN_SID_TYPE = 33;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinReplicatorSid: WELL_KNOWN_SID_TYPE = 34;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinPreWindows2000CompatibleAccessSid: WELL_KNOWN_SID_TYPE = 35;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinRemoteDesktopUsersSid: WELL_KNOWN_SID_TYPE = 36;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinNetworkConfigurationOperatorsSid: WELL_KNOWN_SID_TYPE = 37;
pub const WELL_KNOWN_SID_TYPE_WinAccountAdministratorSid: WELL_KNOWN_SID_TYPE = 38;
pub const WELL_KNOWN_SID_TYPE_WinAccountGuestSid: WELL_KNOWN_SID_TYPE = 39;
pub const WELL_KNOWN_SID_TYPE_WinAccountKrbtgtSid: WELL_KNOWN_SID_TYPE = 40;
pub const WELL_KNOWN_SID_TYPE_WinAccountDomainAdminsSid: WELL_KNOWN_SID_TYPE = 41;
pub const WELL_KNOWN_SID_TYPE_WinAccountDomainUsersSid: WELL_KNOWN_SID_TYPE = 42;
pub const WELL_KNOWN_SID_TYPE_WinAccountDomainGuestsSid: WELL_KNOWN_SID_TYPE = 43;
pub const WELL_KNOWN_SID_TYPE_WinAccountComputersSid: WELL_KNOWN_SID_TYPE = 44;
pub const WELL_KNOWN_SID_TYPE_WinAccountControllersSid: WELL_KNOWN_SID_TYPE = 45;
pub const WELL_KNOWN_SID_TYPE_WinAccountCertAdminsSid: WELL_KNOWN_SID_TYPE = 46;
pub const WELL_KNOWN_SID_TYPE_WinAccountSchemaAdminsSid: WELL_KNOWN_SID_TYPE = 47;
pub const WELL_KNOWN_SID_TYPE_WinAccountEnterpriseAdminsSid: WELL_KNOWN_SID_TYPE = 48;
pub const WELL_KNOWN_SID_TYPE_WinAccountPolicyAdminsSid: WELL_KNOWN_SID_TYPE = 49;
pub const WELL_KNOWN_SID_TYPE_WinAccountRasAndIasServersSid: WELL_KNOWN_SID_TYPE = 50;
pub const WELL_KNOWN_SID_TYPE_WinNTLMAuthenticationSid: WELL_KNOWN_SID_TYPE = 51;
pub const WELL_KNOWN_SID_TYPE_WinDigestAuthenticationSid: WELL_KNOWN_SID_TYPE = 52;
pub const WELL_KNOWN_SID_TYPE_WinSChannelAuthenticationSid: WELL_KNOWN_SID_TYPE = 53;
pub const WELL_KNOWN_SID_TYPE_WinThisOrganizationSid: WELL_KNOWN_SID_TYPE = 54;
pub const WELL_KNOWN_SID_TYPE_WinOtherOrganizationSid: WELL_KNOWN_SID_TYPE = 55;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinIncomingForestTrustBuildersSid: WELL_KNOWN_SID_TYPE = 56;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinPerfMonitoringUsersSid: WELL_KNOWN_SID_TYPE = 57;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinPerfLoggingUsersSid: WELL_KNOWN_SID_TYPE = 58;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinAuthorizationAccessSid: WELL_KNOWN_SID_TYPE = 59;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinTerminalServerLicenseServersSid: WELL_KNOWN_SID_TYPE = 60;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinDCOMUsersSid: WELL_KNOWN_SID_TYPE = 61;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinIUsersSid: WELL_KNOWN_SID_TYPE = 62;
pub const WELL_KNOWN_SID_TYPE_WinIUserSid: WELL_KNOWN_SID_TYPE = 63;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinCryptoOperatorsSid: WELL_KNOWN_SID_TYPE = 64;
pub const WELL_KNOWN_SID_TYPE_WinUntrustedLabelSid: WELL_KNOWN_SID_TYPE = 65;
pub const WELL_KNOWN_SID_TYPE_WinLowLabelSid: WELL_KNOWN_SID_TYPE = 66;
pub const WELL_KNOWN_SID_TYPE_WinMediumLabelSid: WELL_KNOWN_SID_TYPE = 67;
pub const WELL_KNOWN_SID_TYPE_WinHighLabelSid: WELL_KNOWN_SID_TYPE = 68;
pub const WELL_KNOWN_SID_TYPE_WinSystemLabelSid: WELL_KNOWN_SID_TYPE = 69;
pub const WELL_KNOWN_SID_TYPE_WinWriteRestrictedCodeSid: WELL_KNOWN_SID_TYPE = 70;
pub const WELL_KNOWN_SID_TYPE_WinCreatorOwnerRightsSid: WELL_KNOWN_SID_TYPE = 71;
pub const WELL_KNOWN_SID_TYPE_WinCacheablePrincipalsGroupSid: WELL_KNOWN_SID_TYPE = 72;
pub const WELL_KNOWN_SID_TYPE_WinNonCacheablePrincipalsGroupSid: WELL_KNOWN_SID_TYPE = 73;
pub const WELL_KNOWN_SID_TYPE_WinEnterpriseReadonlyControllersSid: WELL_KNOWN_SID_TYPE = 74;
pub const WELL_KNOWN_SID_TYPE_WinAccountReadonlyControllersSid: WELL_KNOWN_SID_TYPE = 75;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinEventLogReadersGroup: WELL_KNOWN_SID_TYPE = 76;
pub const WELL_KNOWN_SID_TYPE_WinNewEnterpriseReadonlyControllersSid: WELL_KNOWN_SID_TYPE = 77;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinCertSvcDComAccessGroup: WELL_KNOWN_SID_TYPE = 78;
pub const WELL_KNOWN_SID_TYPE_WinMediumPlusLabelSid: WELL_KNOWN_SID_TYPE = 79;
pub const WELL_KNOWN_SID_TYPE_WinLocalLogonSid: WELL_KNOWN_SID_TYPE = 80;
pub const WELL_KNOWN_SID_TYPE_WinConsoleLogonSid: WELL_KNOWN_SID_TYPE = 81;
pub const WELL_KNOWN_SID_TYPE_WinThisOrganizationCertificateSid: WELL_KNOWN_SID_TYPE = 82;
pub const WELL_KNOWN_SID_TYPE_WinApplicationPackageAuthoritySid: WELL_KNOWN_SID_TYPE = 83;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinAnyPackageSid: WELL_KNOWN_SID_TYPE = 84;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityInternetClientSid: WELL_KNOWN_SID_TYPE = 85;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityInternetClientServerSid: WELL_KNOWN_SID_TYPE = 86;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityPrivateNetworkClientServerSid: WELL_KNOWN_SID_TYPE = 87;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityPicturesLibrarySid: WELL_KNOWN_SID_TYPE = 88;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityVideosLibrarySid: WELL_KNOWN_SID_TYPE = 89;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityMusicLibrarySid: WELL_KNOWN_SID_TYPE = 90;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityDocumentsLibrarySid: WELL_KNOWN_SID_TYPE = 91;
pub const WELL_KNOWN_SID_TYPE_WinCapabilitySharedUserCertificatesSid: WELL_KNOWN_SID_TYPE = 92;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityEnterpriseAuthenticationSid: WELL_KNOWN_SID_TYPE = 93;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityRemovableStorageSid: WELL_KNOWN_SID_TYPE = 94;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinRDSRemoteAccessServersSid: WELL_KNOWN_SID_TYPE = 95;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinRDSEndpointServersSid: WELL_KNOWN_SID_TYPE = 96;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinRDSManagementServersSid: WELL_KNOWN_SID_TYPE = 97;
pub const WELL_KNOWN_SID_TYPE_WinUserModeDriversSid: WELL_KNOWN_SID_TYPE = 98;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinHyperVAdminsSid: WELL_KNOWN_SID_TYPE = 99;
pub const WELL_KNOWN_SID_TYPE_WinAccountCloneableControllersSid: WELL_KNOWN_SID_TYPE = 100;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinAccessControlAssistanceOperatorsSid: WELL_KNOWN_SID_TYPE =
    101;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinRemoteManagementUsersSid: WELL_KNOWN_SID_TYPE = 102;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticationAuthorityAssertedSid: WELL_KNOWN_SID_TYPE = 103;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticationServiceAssertedSid: WELL_KNOWN_SID_TYPE = 104;
pub const WELL_KNOWN_SID_TYPE_WinLocalAccountSid: WELL_KNOWN_SID_TYPE = 105;
pub const WELL_KNOWN_SID_TYPE_WinLocalAccountAndAdministratorSid: WELL_KNOWN_SID_TYPE = 106;
pub const WELL_KNOWN_SID_TYPE_WinAccountProtectedUsersSid: WELL_KNOWN_SID_TYPE = 107;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityAppointmentsSid: WELL_KNOWN_SID_TYPE = 108;
pub const WELL_KNOWN_SID_TYPE_WinCapabilityContactsSid: WELL_KNOWN_SID_TYPE = 109;
pub const WELL_KNOWN_SID_TYPE_WinAccountDefaultSystemManagedSid: WELL_KNOWN_SID_TYPE = 110;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinDefaultSystemManagedGroupSid: WELL_KNOWN_SID_TYPE = 111;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinStorageReplicaAdminsSid: WELL_KNOWN_SID_TYPE = 112;
pub const WELL_KNOWN_SID_TYPE_WinAccountKeyAdminsSid: WELL_KNOWN_SID_TYPE = 113;
pub const WELL_KNOWN_SID_TYPE_WinAccountEnterpriseKeyAdminsSid: WELL_KNOWN_SID_TYPE = 114;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticationKeyTrustSid: WELL_KNOWN_SID_TYPE = 115;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticationKeyPropertyMFASid: WELL_KNOWN_SID_TYPE = 116;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticationKeyPropertyAttestationSid: WELL_KNOWN_SID_TYPE = 117;
pub const WELL_KNOWN_SID_TYPE_WinAuthenticationFreshKeyAuthSid: WELL_KNOWN_SID_TYPE = 118;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinDeviceOwnersSid: WELL_KNOWN_SID_TYPE = 119;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinUserModeHardwareOperatorsSid: WELL_KNOWN_SID_TYPE = 120;
pub const WELL_KNOWN_SID_TYPE_WinBuiltinOpenSSHUsersSid: WELL_KNOWN_SID_TYPE = 121;
pub type WELL_KNOWN_SID_TYPE = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACL {
    pub AclRevision: BYTE,
    pub Sbz1: BYTE,
    pub AclSize: WORD,
    pub AceCount: WORD,
    pub Sbz2: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACL"][::std::mem::size_of::<_ACL>() - 8usize];
    ["Alignment of _ACL"][::std::mem::align_of::<_ACL>() - 2usize];
    ["Offset of field: _ACL::AclRevision"][::std::mem::offset_of!(_ACL, AclRevision) - 0usize];
    ["Offset of field: _ACL::Sbz1"][::std::mem::offset_of!(_ACL, Sbz1) - 1usize];
    ["Offset of field: _ACL::AclSize"][::std::mem::offset_of!(_ACL, AclSize) - 2usize];
    ["Offset of field: _ACL::AceCount"][::std::mem::offset_of!(_ACL, AceCount) - 4usize];
    ["Offset of field: _ACL::Sbz2"][::std::mem::offset_of!(_ACL, Sbz2) - 6usize];
};
pub type ACL = _ACL;
pub type PACL = *mut ACL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACE_HEADER {
    pub AceType: BYTE,
    pub AceFlags: BYTE,
    pub AceSize: WORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACE_HEADER"][::std::mem::size_of::<_ACE_HEADER>() - 4usize];
    ["Alignment of _ACE_HEADER"][::std::mem::align_of::<_ACE_HEADER>() - 2usize];
    ["Offset of field: _ACE_HEADER::AceType"]
        [::std::mem::offset_of!(_ACE_HEADER, AceType) - 0usize];
    ["Offset of field: _ACE_HEADER::AceFlags"]
        [::std::mem::offset_of!(_ACE_HEADER, AceFlags) - 1usize];
    ["Offset of field: _ACE_HEADER::AceSize"]
        [::std::mem::offset_of!(_ACE_HEADER, AceSize) - 2usize];
};
pub type ACE_HEADER = _ACE_HEADER;
pub type PACE_HEADER = *mut ACE_HEADER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_ALLOWED_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACCESS_ALLOWED_ACE"][::std::mem::size_of::<_ACCESS_ALLOWED_ACE>() - 12usize];
    ["Alignment of _ACCESS_ALLOWED_ACE"][::std::mem::align_of::<_ACCESS_ALLOWED_ACE>() - 4usize];
    ["Offset of field: _ACCESS_ALLOWED_ACE::Header"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_ACE, Header) - 0usize];
    ["Offset of field: _ACCESS_ALLOWED_ACE::Mask"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_ACE, Mask) - 4usize];
    ["Offset of field: _ACCESS_ALLOWED_ACE::SidStart"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_ACE, SidStart) - 8usize];
};
pub type ACCESS_ALLOWED_ACE = _ACCESS_ALLOWED_ACE;
pub type PACCESS_ALLOWED_ACE = *mut ACCESS_ALLOWED_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_DENIED_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACCESS_DENIED_ACE"][::std::mem::size_of::<_ACCESS_DENIED_ACE>() - 12usize];
    ["Alignment of _ACCESS_DENIED_ACE"][::std::mem::align_of::<_ACCESS_DENIED_ACE>() - 4usize];
    ["Offset of field: _ACCESS_DENIED_ACE::Header"]
        [::std::mem::offset_of!(_ACCESS_DENIED_ACE, Header) - 0usize];
    ["Offset of field: _ACCESS_DENIED_ACE::Mask"]
        [::std::mem::offset_of!(_ACCESS_DENIED_ACE, Mask) - 4usize];
    ["Offset of field: _ACCESS_DENIED_ACE::SidStart"]
        [::std::mem::offset_of!(_ACCESS_DENIED_ACE, SidStart) - 8usize];
};
pub type ACCESS_DENIED_ACE = _ACCESS_DENIED_ACE;
pub type PACCESS_DENIED_ACE = *mut ACCESS_DENIED_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_AUDIT_ACE"][::std::mem::size_of::<_SYSTEM_AUDIT_ACE>() - 12usize];
    ["Alignment of _SYSTEM_AUDIT_ACE"][::std::mem::align_of::<_SYSTEM_AUDIT_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_AUDIT_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_AUDIT_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_AUDIT_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_ACE, SidStart) - 8usize];
};
pub type SYSTEM_AUDIT_ACE = _SYSTEM_AUDIT_ACE;
pub type PSYSTEM_AUDIT_ACE = *mut SYSTEM_AUDIT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_ALARM_ACE"][::std::mem::size_of::<_SYSTEM_ALARM_ACE>() - 12usize];
    ["Alignment of _SYSTEM_ALARM_ACE"][::std::mem::align_of::<_SYSTEM_ALARM_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_ALARM_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_ALARM_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_ALARM_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_ACE, SidStart) - 8usize];
};
pub type SYSTEM_ALARM_ACE = _SYSTEM_ALARM_ACE;
pub type PSYSTEM_ALARM_ACE = *mut SYSTEM_ALARM_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_RESOURCE_ATTRIBUTE_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_RESOURCE_ATTRIBUTE_ACE"]
        [::std::mem::size_of::<_SYSTEM_RESOURCE_ATTRIBUTE_ACE>() - 12usize];
    ["Alignment of _SYSTEM_RESOURCE_ATTRIBUTE_ACE"]
        [::std::mem::align_of::<_SYSTEM_RESOURCE_ATTRIBUTE_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_RESOURCE_ATTRIBUTE_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_RESOURCE_ATTRIBUTE_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_RESOURCE_ATTRIBUTE_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_RESOURCE_ATTRIBUTE_ACE, SidStart) - 8usize];
};
pub type SYSTEM_RESOURCE_ATTRIBUTE_ACE = _SYSTEM_RESOURCE_ATTRIBUTE_ACE;
pub type PSYSTEM_RESOURCE_ATTRIBUTE_ACE = *mut _SYSTEM_RESOURCE_ATTRIBUTE_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_SCOPED_POLICY_ID_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_SCOPED_POLICY_ID_ACE"]
        [::std::mem::size_of::<_SYSTEM_SCOPED_POLICY_ID_ACE>() - 12usize];
    ["Alignment of _SYSTEM_SCOPED_POLICY_ID_ACE"]
        [::std::mem::align_of::<_SYSTEM_SCOPED_POLICY_ID_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_SCOPED_POLICY_ID_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_SCOPED_POLICY_ID_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_SCOPED_POLICY_ID_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_SCOPED_POLICY_ID_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_SCOPED_POLICY_ID_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_SCOPED_POLICY_ID_ACE, SidStart) - 8usize];
};
pub type SYSTEM_SCOPED_POLICY_ID_ACE = _SYSTEM_SCOPED_POLICY_ID_ACE;
pub type PSYSTEM_SCOPED_POLICY_ID_ACE = *mut _SYSTEM_SCOPED_POLICY_ID_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_MANDATORY_LABEL_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_MANDATORY_LABEL_ACE"]
        [::std::mem::size_of::<_SYSTEM_MANDATORY_LABEL_ACE>() - 12usize];
    ["Alignment of _SYSTEM_MANDATORY_LABEL_ACE"]
        [::std::mem::align_of::<_SYSTEM_MANDATORY_LABEL_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_MANDATORY_LABEL_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_MANDATORY_LABEL_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_MANDATORY_LABEL_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_MANDATORY_LABEL_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_MANDATORY_LABEL_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_MANDATORY_LABEL_ACE, SidStart) - 8usize];
};
pub type SYSTEM_MANDATORY_LABEL_ACE = _SYSTEM_MANDATORY_LABEL_ACE;
pub type PSYSTEM_MANDATORY_LABEL_ACE = *mut _SYSTEM_MANDATORY_LABEL_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_PROCESS_TRUST_LABEL_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_PROCESS_TRUST_LABEL_ACE"]
        [::std::mem::size_of::<_SYSTEM_PROCESS_TRUST_LABEL_ACE>() - 12usize];
    ["Alignment of _SYSTEM_PROCESS_TRUST_LABEL_ACE"]
        [::std::mem::align_of::<_SYSTEM_PROCESS_TRUST_LABEL_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_PROCESS_TRUST_LABEL_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_PROCESS_TRUST_LABEL_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_PROCESS_TRUST_LABEL_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_PROCESS_TRUST_LABEL_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_PROCESS_TRUST_LABEL_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_PROCESS_TRUST_LABEL_ACE, SidStart) - 8usize];
};
pub type SYSTEM_PROCESS_TRUST_LABEL_ACE = _SYSTEM_PROCESS_TRUST_LABEL_ACE;
pub type PSYSTEM_PROCESS_TRUST_LABEL_ACE = *mut _SYSTEM_PROCESS_TRUST_LABEL_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ACCESS_FILTER_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_ACCESS_FILTER_ACE"]
        [::std::mem::size_of::<_SYSTEM_ACCESS_FILTER_ACE>() - 12usize];
    ["Alignment of _SYSTEM_ACCESS_FILTER_ACE"]
        [::std::mem::align_of::<_SYSTEM_ACCESS_FILTER_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_ACCESS_FILTER_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_ACCESS_FILTER_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_ACCESS_FILTER_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_ACCESS_FILTER_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_ACCESS_FILTER_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_ACCESS_FILTER_ACE, SidStart) - 8usize];
};
pub type SYSTEM_ACCESS_FILTER_ACE = _SYSTEM_ACCESS_FILTER_ACE;
pub type PSYSTEM_ACCESS_FILTER_ACE = *mut _SYSTEM_ACCESS_FILTER_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_ALLOWED_OBJECT_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub Flags: DWORD,
    pub ObjectType: GUID,
    pub InheritedObjectType: GUID,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACCESS_ALLOWED_OBJECT_ACE"]
        [::std::mem::size_of::<_ACCESS_ALLOWED_OBJECT_ACE>() - 48usize];
    ["Alignment of _ACCESS_ALLOWED_OBJECT_ACE"]
        [::std::mem::align_of::<_ACCESS_ALLOWED_OBJECT_ACE>() - 4usize];
    ["Offset of field: _ACCESS_ALLOWED_OBJECT_ACE::Header"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_OBJECT_ACE, Header) - 0usize];
    ["Offset of field: _ACCESS_ALLOWED_OBJECT_ACE::Mask"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_OBJECT_ACE, Mask) - 4usize];
    ["Offset of field: _ACCESS_ALLOWED_OBJECT_ACE::Flags"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_OBJECT_ACE, Flags) - 8usize];
    ["Offset of field: _ACCESS_ALLOWED_OBJECT_ACE::ObjectType"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_OBJECT_ACE, ObjectType) - 12usize];
    ["Offset of field: _ACCESS_ALLOWED_OBJECT_ACE::InheritedObjectType"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_OBJECT_ACE, InheritedObjectType) - 28usize];
    ["Offset of field: _ACCESS_ALLOWED_OBJECT_ACE::SidStart"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_OBJECT_ACE, SidStart) - 44usize];
};
pub type ACCESS_ALLOWED_OBJECT_ACE = _ACCESS_ALLOWED_OBJECT_ACE;
pub type PACCESS_ALLOWED_OBJECT_ACE = *mut _ACCESS_ALLOWED_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_DENIED_OBJECT_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub Flags: DWORD,
    pub ObjectType: GUID,
    pub InheritedObjectType: GUID,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACCESS_DENIED_OBJECT_ACE"]
        [::std::mem::size_of::<_ACCESS_DENIED_OBJECT_ACE>() - 48usize];
    ["Alignment of _ACCESS_DENIED_OBJECT_ACE"]
        [::std::mem::align_of::<_ACCESS_DENIED_OBJECT_ACE>() - 4usize];
    ["Offset of field: _ACCESS_DENIED_OBJECT_ACE::Header"]
        [::std::mem::offset_of!(_ACCESS_DENIED_OBJECT_ACE, Header) - 0usize];
    ["Offset of field: _ACCESS_DENIED_OBJECT_ACE::Mask"]
        [::std::mem::offset_of!(_ACCESS_DENIED_OBJECT_ACE, Mask) - 4usize];
    ["Offset of field: _ACCESS_DENIED_OBJECT_ACE::Flags"]
        [::std::mem::offset_of!(_ACCESS_DENIED_OBJECT_ACE, Flags) - 8usize];
    ["Offset of field: _ACCESS_DENIED_OBJECT_ACE::ObjectType"]
        [::std::mem::offset_of!(_ACCESS_DENIED_OBJECT_ACE, ObjectType) - 12usize];
    ["Offset of field: _ACCESS_DENIED_OBJECT_ACE::InheritedObjectType"]
        [::std::mem::offset_of!(_ACCESS_DENIED_OBJECT_ACE, InheritedObjectType) - 28usize];
    ["Offset of field: _ACCESS_DENIED_OBJECT_ACE::SidStart"]
        [::std::mem::offset_of!(_ACCESS_DENIED_OBJECT_ACE, SidStart) - 44usize];
};
pub type ACCESS_DENIED_OBJECT_ACE = _ACCESS_DENIED_OBJECT_ACE;
pub type PACCESS_DENIED_OBJECT_ACE = *mut _ACCESS_DENIED_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_OBJECT_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub Flags: DWORD,
    pub ObjectType: GUID,
    pub InheritedObjectType: GUID,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_AUDIT_OBJECT_ACE"]
        [::std::mem::size_of::<_SYSTEM_AUDIT_OBJECT_ACE>() - 48usize];
    ["Alignment of _SYSTEM_AUDIT_OBJECT_ACE"]
        [::std::mem::align_of::<_SYSTEM_AUDIT_OBJECT_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_AUDIT_OBJECT_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_OBJECT_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_AUDIT_OBJECT_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_OBJECT_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_AUDIT_OBJECT_ACE::Flags"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_OBJECT_ACE, Flags) - 8usize];
    ["Offset of field: _SYSTEM_AUDIT_OBJECT_ACE::ObjectType"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_OBJECT_ACE, ObjectType) - 12usize];
    ["Offset of field: _SYSTEM_AUDIT_OBJECT_ACE::InheritedObjectType"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_OBJECT_ACE, InheritedObjectType) - 28usize];
    ["Offset of field: _SYSTEM_AUDIT_OBJECT_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_OBJECT_ACE, SidStart) - 44usize];
};
pub type SYSTEM_AUDIT_OBJECT_ACE = _SYSTEM_AUDIT_OBJECT_ACE;
pub type PSYSTEM_AUDIT_OBJECT_ACE = *mut _SYSTEM_AUDIT_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_OBJECT_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub Flags: DWORD,
    pub ObjectType: GUID,
    pub InheritedObjectType: GUID,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_ALARM_OBJECT_ACE"]
        [::std::mem::size_of::<_SYSTEM_ALARM_OBJECT_ACE>() - 48usize];
    ["Alignment of _SYSTEM_ALARM_OBJECT_ACE"]
        [::std::mem::align_of::<_SYSTEM_ALARM_OBJECT_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_ALARM_OBJECT_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_OBJECT_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_ALARM_OBJECT_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_OBJECT_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_ALARM_OBJECT_ACE::Flags"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_OBJECT_ACE, Flags) - 8usize];
    ["Offset of field: _SYSTEM_ALARM_OBJECT_ACE::ObjectType"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_OBJECT_ACE, ObjectType) - 12usize];
    ["Offset of field: _SYSTEM_ALARM_OBJECT_ACE::InheritedObjectType"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_OBJECT_ACE, InheritedObjectType) - 28usize];
    ["Offset of field: _SYSTEM_ALARM_OBJECT_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_OBJECT_ACE, SidStart) - 44usize];
};
pub type SYSTEM_ALARM_OBJECT_ACE = _SYSTEM_ALARM_OBJECT_ACE;
pub type PSYSTEM_ALARM_OBJECT_ACE = *mut _SYSTEM_ALARM_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_ALLOWED_CALLBACK_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACCESS_ALLOWED_CALLBACK_ACE"]
        [::std::mem::size_of::<_ACCESS_ALLOWED_CALLBACK_ACE>() - 12usize];
    ["Alignment of _ACCESS_ALLOWED_CALLBACK_ACE"]
        [::std::mem::align_of::<_ACCESS_ALLOWED_CALLBACK_ACE>() - 4usize];
    ["Offset of field: _ACCESS_ALLOWED_CALLBACK_ACE::Header"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_CALLBACK_ACE, Header) - 0usize];
    ["Offset of field: _ACCESS_ALLOWED_CALLBACK_ACE::Mask"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_CALLBACK_ACE, Mask) - 4usize];
    ["Offset of field: _ACCESS_ALLOWED_CALLBACK_ACE::SidStart"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_CALLBACK_ACE, SidStart) - 8usize];
};
pub type ACCESS_ALLOWED_CALLBACK_ACE = _ACCESS_ALLOWED_CALLBACK_ACE;
pub type PACCESS_ALLOWED_CALLBACK_ACE = *mut _ACCESS_ALLOWED_CALLBACK_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_DENIED_CALLBACK_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACCESS_DENIED_CALLBACK_ACE"]
        [::std::mem::size_of::<_ACCESS_DENIED_CALLBACK_ACE>() - 12usize];
    ["Alignment of _ACCESS_DENIED_CALLBACK_ACE"]
        [::std::mem::align_of::<_ACCESS_DENIED_CALLBACK_ACE>() - 4usize];
    ["Offset of field: _ACCESS_DENIED_CALLBACK_ACE::Header"]
        [::std::mem::offset_of!(_ACCESS_DENIED_CALLBACK_ACE, Header) - 0usize];
    ["Offset of field: _ACCESS_DENIED_CALLBACK_ACE::Mask"]
        [::std::mem::offset_of!(_ACCESS_DENIED_CALLBACK_ACE, Mask) - 4usize];
    ["Offset of field: _ACCESS_DENIED_CALLBACK_ACE::SidStart"]
        [::std::mem::offset_of!(_ACCESS_DENIED_CALLBACK_ACE, SidStart) - 8usize];
};
pub type ACCESS_DENIED_CALLBACK_ACE = _ACCESS_DENIED_CALLBACK_ACE;
pub type PACCESS_DENIED_CALLBACK_ACE = *mut _ACCESS_DENIED_CALLBACK_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_CALLBACK_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_AUDIT_CALLBACK_ACE"]
        [::std::mem::size_of::<_SYSTEM_AUDIT_CALLBACK_ACE>() - 12usize];
    ["Alignment of _SYSTEM_AUDIT_CALLBACK_ACE"]
        [::std::mem::align_of::<_SYSTEM_AUDIT_CALLBACK_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_AUDIT_CALLBACK_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_AUDIT_CALLBACK_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_AUDIT_CALLBACK_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_ACE, SidStart) - 8usize];
};
pub type SYSTEM_AUDIT_CALLBACK_ACE = _SYSTEM_AUDIT_CALLBACK_ACE;
pub type PSYSTEM_AUDIT_CALLBACK_ACE = *mut _SYSTEM_AUDIT_CALLBACK_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_CALLBACK_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_ALARM_CALLBACK_ACE"]
        [::std::mem::size_of::<_SYSTEM_ALARM_CALLBACK_ACE>() - 12usize];
    ["Alignment of _SYSTEM_ALARM_CALLBACK_ACE"]
        [::std::mem::align_of::<_SYSTEM_ALARM_CALLBACK_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_ALARM_CALLBACK_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_ALARM_CALLBACK_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_ALARM_CALLBACK_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_ACE, SidStart) - 8usize];
};
pub type SYSTEM_ALARM_CALLBACK_ACE = _SYSTEM_ALARM_CALLBACK_ACE;
pub type PSYSTEM_ALARM_CALLBACK_ACE = *mut _SYSTEM_ALARM_CALLBACK_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub Flags: DWORD,
    pub ObjectType: GUID,
    pub InheritedObjectType: GUID,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE"]
        [::std::mem::size_of::<_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE>() - 48usize];
    ["Alignment of _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE"]
        [::std::mem::align_of::<_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE>() - 4usize];
    ["Offset of field: _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE::Header"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE, Header) - 0usize];
    ["Offset of field: _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE::Mask"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE, Mask) - 4usize];
    ["Offset of field: _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE::Flags"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE, Flags) - 8usize];
    ["Offset of field: _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE::ObjectType"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE, ObjectType) - 12usize];
    ["Offset of field: _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE::InheritedObjectType"][::std::mem::offset_of!(
        _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE,
        InheritedObjectType
    ) - 28usize];
    ["Offset of field: _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE::SidStart"]
        [::std::mem::offset_of!(_ACCESS_ALLOWED_CALLBACK_OBJECT_ACE, SidStart) - 44usize];
};
pub type ACCESS_ALLOWED_CALLBACK_OBJECT_ACE = _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE;
pub type PACCESS_ALLOWED_CALLBACK_OBJECT_ACE = *mut _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_DENIED_CALLBACK_OBJECT_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub Flags: DWORD,
    pub ObjectType: GUID,
    pub InheritedObjectType: GUID,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACCESS_DENIED_CALLBACK_OBJECT_ACE"]
        [::std::mem::size_of::<_ACCESS_DENIED_CALLBACK_OBJECT_ACE>() - 48usize];
    ["Alignment of _ACCESS_DENIED_CALLBACK_OBJECT_ACE"]
        [::std::mem::align_of::<_ACCESS_DENIED_CALLBACK_OBJECT_ACE>() - 4usize];
    ["Offset of field: _ACCESS_DENIED_CALLBACK_OBJECT_ACE::Header"]
        [::std::mem::offset_of!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE, Header) - 0usize];
    ["Offset of field: _ACCESS_DENIED_CALLBACK_OBJECT_ACE::Mask"]
        [::std::mem::offset_of!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE, Mask) - 4usize];
    ["Offset of field: _ACCESS_DENIED_CALLBACK_OBJECT_ACE::Flags"]
        [::std::mem::offset_of!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE, Flags) - 8usize];
    ["Offset of field: _ACCESS_DENIED_CALLBACK_OBJECT_ACE::ObjectType"]
        [::std::mem::offset_of!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE, ObjectType) - 12usize];
    ["Offset of field: _ACCESS_DENIED_CALLBACK_OBJECT_ACE::InheritedObjectType"]
        [::std::mem::offset_of!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE, InheritedObjectType) - 28usize];
    ["Offset of field: _ACCESS_DENIED_CALLBACK_OBJECT_ACE::SidStart"]
        [::std::mem::offset_of!(_ACCESS_DENIED_CALLBACK_OBJECT_ACE, SidStart) - 44usize];
};
pub type ACCESS_DENIED_CALLBACK_OBJECT_ACE = _ACCESS_DENIED_CALLBACK_OBJECT_ACE;
pub type PACCESS_DENIED_CALLBACK_OBJECT_ACE = *mut _ACCESS_DENIED_CALLBACK_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub Flags: DWORD,
    pub ObjectType: GUID,
    pub InheritedObjectType: GUID,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE"]
        [::std::mem::size_of::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>() - 48usize];
    ["Alignment of _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE"]
        [::std::mem::align_of::<_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE::Flags"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, Flags) - 8usize];
    ["Offset of field: _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE::ObjectType"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, ObjectType) - 12usize];
    ["Offset of field: _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE::InheritedObjectType"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, InheritedObjectType) - 28usize];
    ["Offset of field: _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_AUDIT_CALLBACK_OBJECT_ACE, SidStart) - 44usize];
};
pub type SYSTEM_AUDIT_CALLBACK_OBJECT_ACE = _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE;
pub type PSYSTEM_AUDIT_CALLBACK_OBJECT_ACE = *mut _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SYSTEM_ALARM_CALLBACK_OBJECT_ACE {
    pub Header: ACE_HEADER,
    pub Mask: ACCESS_MASK,
    pub Flags: DWORD,
    pub ObjectType: GUID,
    pub InheritedObjectType: GUID,
    pub SidStart: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SYSTEM_ALARM_CALLBACK_OBJECT_ACE"]
        [::std::mem::size_of::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>() - 48usize];
    ["Alignment of _SYSTEM_ALARM_CALLBACK_OBJECT_ACE"]
        [::std::mem::align_of::<_SYSTEM_ALARM_CALLBACK_OBJECT_ACE>() - 4usize];
    ["Offset of field: _SYSTEM_ALARM_CALLBACK_OBJECT_ACE::Header"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE, Header) - 0usize];
    ["Offset of field: _SYSTEM_ALARM_CALLBACK_OBJECT_ACE::Mask"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE, Mask) - 4usize];
    ["Offset of field: _SYSTEM_ALARM_CALLBACK_OBJECT_ACE::Flags"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE, Flags) - 8usize];
    ["Offset of field: _SYSTEM_ALARM_CALLBACK_OBJECT_ACE::ObjectType"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE, ObjectType) - 12usize];
    ["Offset of field: _SYSTEM_ALARM_CALLBACK_OBJECT_ACE::InheritedObjectType"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE, InheritedObjectType) - 28usize];
    ["Offset of field: _SYSTEM_ALARM_CALLBACK_OBJECT_ACE::SidStart"]
        [::std::mem::offset_of!(_SYSTEM_ALARM_CALLBACK_OBJECT_ACE, SidStart) - 44usize];
};
pub type SYSTEM_ALARM_CALLBACK_OBJECT_ACE = _SYSTEM_ALARM_CALLBACK_OBJECT_ACE;
pub type PSYSTEM_ALARM_CALLBACK_OBJECT_ACE = *mut _SYSTEM_ALARM_CALLBACK_OBJECT_ACE;
pub const _ACL_INFORMATION_CLASS_AclRevisionInformation: _ACL_INFORMATION_CLASS = 1;
pub const _ACL_INFORMATION_CLASS_AclSizeInformation: _ACL_INFORMATION_CLASS = 2;
pub type _ACL_INFORMATION_CLASS = ::std::os::raw::c_int;
pub use self::_ACL_INFORMATION_CLASS as ACL_INFORMATION_CLASS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACL_REVISION_INFORMATION {
    pub AclRevision: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACL_REVISION_INFORMATION"]
        [::std::mem::size_of::<_ACL_REVISION_INFORMATION>() - 4usize];
    ["Alignment of _ACL_REVISION_INFORMATION"]
        [::std::mem::align_of::<_ACL_REVISION_INFORMATION>() - 4usize];
    ["Offset of field: _ACL_REVISION_INFORMATION::AclRevision"]
        [::std::mem::offset_of!(_ACL_REVISION_INFORMATION, AclRevision) - 0usize];
};
pub type ACL_REVISION_INFORMATION = _ACL_REVISION_INFORMATION;
pub type PACL_REVISION_INFORMATION = *mut ACL_REVISION_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACL_SIZE_INFORMATION {
    pub AceCount: DWORD,
    pub AclBytesInUse: DWORD,
    pub AclBytesFree: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACL_SIZE_INFORMATION"][::std::mem::size_of::<_ACL_SIZE_INFORMATION>() - 12usize];
    ["Alignment of _ACL_SIZE_INFORMATION"]
        [::std::mem::align_of::<_ACL_SIZE_INFORMATION>() - 4usize];
    ["Offset of field: _ACL_SIZE_INFORMATION::AceCount"]
        [::std::mem::offset_of!(_ACL_SIZE_INFORMATION, AceCount) - 0usize];
    ["Offset of field: _ACL_SIZE_INFORMATION::AclBytesInUse"]
        [::std::mem::offset_of!(_ACL_SIZE_INFORMATION, AclBytesInUse) - 4usize];
    ["Offset of field: _ACL_SIZE_INFORMATION::AclBytesFree"]
        [::std::mem::offset_of!(_ACL_SIZE_INFORMATION, AclBytesFree) - 8usize];
};
pub type ACL_SIZE_INFORMATION = _ACL_SIZE_INFORMATION;
pub type PACL_SIZE_INFORMATION = *mut ACL_SIZE_INFORMATION;
pub type SECURITY_DESCRIPTOR_CONTROL = WORD;
pub type PSECURITY_DESCRIPTOR_CONTROL = *mut WORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_DESCRIPTOR_RELATIVE {
    pub Revision: BYTE,
    pub Sbz1: BYTE,
    pub Control: SECURITY_DESCRIPTOR_CONTROL,
    pub Owner: DWORD,
    pub Group: DWORD,
    pub Sacl: DWORD,
    pub Dacl: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SECURITY_DESCRIPTOR_RELATIVE"]
        [::std::mem::size_of::<_SECURITY_DESCRIPTOR_RELATIVE>() - 20usize];
    ["Alignment of _SECURITY_DESCRIPTOR_RELATIVE"]
        [::std::mem::align_of::<_SECURITY_DESCRIPTOR_RELATIVE>() - 4usize];
    ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Revision"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Revision) - 0usize];
    ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Sbz1"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Sbz1) - 1usize];
    ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Control"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Control) - 2usize];
    ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Owner"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Owner) - 4usize];
    ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Group"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Group) - 8usize];
    ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Sacl"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Sacl) - 12usize];
    ["Offset of field: _SECURITY_DESCRIPTOR_RELATIVE::Dacl"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR_RELATIVE, Dacl) - 16usize];
};
pub type SECURITY_DESCRIPTOR_RELATIVE = _SECURITY_DESCRIPTOR_RELATIVE;
pub type PISECURITY_DESCRIPTOR_RELATIVE = *mut _SECURITY_DESCRIPTOR_RELATIVE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_DESCRIPTOR {
    pub Revision: BYTE,
    pub Sbz1: BYTE,
    pub Control: SECURITY_DESCRIPTOR_CONTROL,
    pub Owner: PSID,
    pub Group: PSID,
    pub Sacl: PACL,
    pub Dacl: PACL,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SECURITY_DESCRIPTOR"][::std::mem::size_of::<_SECURITY_DESCRIPTOR>() - 40usize];
    ["Alignment of _SECURITY_DESCRIPTOR"][::std::mem::align_of::<_SECURITY_DESCRIPTOR>() - 8usize];
    ["Offset of field: _SECURITY_DESCRIPTOR::Revision"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Revision) - 0usize];
    ["Offset of field: _SECURITY_DESCRIPTOR::Sbz1"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Sbz1) - 1usize];
    ["Offset of field: _SECURITY_DESCRIPTOR::Control"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Control) - 2usize];
    ["Offset of field: _SECURITY_DESCRIPTOR::Owner"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Owner) - 8usize];
    ["Offset of field: _SECURITY_DESCRIPTOR::Group"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Group) - 16usize];
    ["Offset of field: _SECURITY_DESCRIPTOR::Sacl"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Sacl) - 24usize];
    ["Offset of field: _SECURITY_DESCRIPTOR::Dacl"]
        [::std::mem::offset_of!(_SECURITY_DESCRIPTOR, Dacl) - 32usize];
};
pub type SECURITY_DESCRIPTOR = _SECURITY_DESCRIPTOR;
pub type PISECURITY_DESCRIPTOR = *mut _SECURITY_DESCRIPTOR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SECURITY_OBJECT_AI_PARAMS {
    pub Size: DWORD,
    pub ConstraintMask: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SECURITY_OBJECT_AI_PARAMS"]
        [::std::mem::size_of::<_SECURITY_OBJECT_AI_PARAMS>() - 8usize];
    ["Alignment of _SECURITY_OBJECT_AI_PARAMS"]
        [::std::mem::align_of::<_SECURITY_OBJECT_AI_PARAMS>() - 4usize];
    ["Offset of field: _SECURITY_OBJECT_AI_PARAMS::Size"]
        [::std::mem::offset_of!(_SECURITY_OBJECT_AI_PARAMS, Size) - 0usize];
    ["Offset of field: _SECURITY_OBJECT_AI_PARAMS::ConstraintMask"]
        [::std::mem::offset_of!(_SECURITY_OBJECT_AI_PARAMS, ConstraintMask) - 4usize];
};
pub type SECURITY_OBJECT_AI_PARAMS = _SECURITY_OBJECT_AI_PARAMS;
pub type PSECURITY_OBJECT_AI_PARAMS = *mut _SECURITY_OBJECT_AI_PARAMS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _OBJECT_TYPE_LIST {
    pub Level: WORD,
    pub Sbz: WORD,
    pub ObjectType: *mut GUID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _OBJECT_TYPE_LIST"][::std::mem::size_of::<_OBJECT_TYPE_LIST>() - 16usize];
    ["Alignment of _OBJECT_TYPE_LIST"][::std::mem::align_of::<_OBJECT_TYPE_LIST>() - 8usize];
    ["Offset of field: _OBJECT_TYPE_LIST::Level"]
        [::std::mem::offset_of!(_OBJECT_TYPE_LIST, Level) - 0usize];
    ["Offset of field: _OBJECT_TYPE_LIST::Sbz"]
        [::std::mem::offset_of!(_OBJECT_TYPE_LIST, Sbz) - 2usize];
    ["Offset of field: _OBJECT_TYPE_LIST::ObjectType"]
        [::std::mem::offset_of!(_OBJECT_TYPE_LIST, ObjectType) - 8usize];
};
pub type OBJECT_TYPE_LIST = _OBJECT_TYPE_LIST;
pub type POBJECT_TYPE_LIST = *mut _OBJECT_TYPE_LIST;
pub const _AUDIT_EVENT_TYPE_AuditEventObjectAccess: _AUDIT_EVENT_TYPE = 0;
pub const _AUDIT_EVENT_TYPE_AuditEventDirectoryServiceAccess: _AUDIT_EVENT_TYPE = 1;
pub type _AUDIT_EVENT_TYPE = ::std::os::raw::c_int;
pub use self::_AUDIT_EVENT_TYPE as AUDIT_EVENT_TYPE;
pub type PAUDIT_EVENT_TYPE = *mut _AUDIT_EVENT_TYPE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _PRIVILEGE_SET {
    pub PrivilegeCount: DWORD,
    pub Control: DWORD,
    pub Privilege: [LUID_AND_ATTRIBUTES; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _PRIVILEGE_SET"][::std::mem::size_of::<_PRIVILEGE_SET>() - 20usize];
    ["Alignment of _PRIVILEGE_SET"][::std::mem::align_of::<_PRIVILEGE_SET>() - 4usize];
    ["Offset of field: _PRIVILEGE_SET::PrivilegeCount"]
        [::std::mem::offset_of!(_PRIVILEGE_SET, PrivilegeCount) - 0usize];
    ["Offset of field: _PRIVILEGE_SET::Control"]
        [::std::mem::offset_of!(_PRIVILEGE_SET, Control) - 4usize];
    ["Offset of field: _PRIVILEGE_SET::Privilege"]
        [::std::mem::offset_of!(_PRIVILEGE_SET, Privilege) - 8usize];
};
pub type PRIVILEGE_SET = _PRIVILEGE_SET;
pub type PPRIVILEGE_SET = *mut _PRIVILEGE_SET;
pub const _ACCESS_REASON_TYPE_AccessReasonNone: _ACCESS_REASON_TYPE = 0;
pub const _ACCESS_REASON_TYPE_AccessReasonAllowedAce: _ACCESS_REASON_TYPE = 65536;
pub const _ACCESS_REASON_TYPE_AccessReasonDeniedAce: _ACCESS_REASON_TYPE = 131072;
pub const _ACCESS_REASON_TYPE_AccessReasonAllowedParentAce: _ACCESS_REASON_TYPE = 196608;
pub const _ACCESS_REASON_TYPE_AccessReasonDeniedParentAce: _ACCESS_REASON_TYPE = 262144;
pub const _ACCESS_REASON_TYPE_AccessReasonNotGrantedByCape: _ACCESS_REASON_TYPE = 327680;
pub const _ACCESS_REASON_TYPE_AccessReasonNotGrantedByParentCape: _ACCESS_REASON_TYPE = 393216;
pub const _ACCESS_REASON_TYPE_AccessReasonNotGrantedToAppContainer: _ACCESS_REASON_TYPE = 458752;
pub const _ACCESS_REASON_TYPE_AccessReasonMissingPrivilege: _ACCESS_REASON_TYPE = 1048576;
pub const _ACCESS_REASON_TYPE_AccessReasonFromPrivilege: _ACCESS_REASON_TYPE = 2097152;
pub const _ACCESS_REASON_TYPE_AccessReasonIntegrityLevel: _ACCESS_REASON_TYPE = 3145728;
pub const _ACCESS_REASON_TYPE_AccessReasonOwnership: _ACCESS_REASON_TYPE = 4194304;
pub const _ACCESS_REASON_TYPE_AccessReasonNullDacl: _ACCESS_REASON_TYPE = 5242880;
pub const _ACCESS_REASON_TYPE_AccessReasonEmptyDacl: _ACCESS_REASON_TYPE = 6291456;
pub const _ACCESS_REASON_TYPE_AccessReasonNoSD: _ACCESS_REASON_TYPE = 7340032;
pub const _ACCESS_REASON_TYPE_AccessReasonNoGrant: _ACCESS_REASON_TYPE = 8388608;
pub const _ACCESS_REASON_TYPE_AccessReasonTrustLabel: _ACCESS_REASON_TYPE = 9437184;
pub const _ACCESS_REASON_TYPE_AccessReasonFilterAce: _ACCESS_REASON_TYPE = 10485760;
pub type _ACCESS_REASON_TYPE = ::std::os::raw::c_int;
pub use self::_ACCESS_REASON_TYPE as ACCESS_REASON_TYPE;
pub type ACCESS_REASON = DWORD;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _ACCESS_REASONS {
    pub Data: [ACCESS_REASON; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _ACCESS_REASONS"][::std::mem::size_of::<_ACCESS_REASONS>() - 128usize];
    ["Alignment of _ACCESS_REASONS"][::std::mem::align_of::<_ACCESS_REASONS>() - 4usize];
    ["Offset of field: _ACCESS_REASONS::Data"]
        [::std::mem::offset_of!(_ACCESS_REASONS, Data) - 0usize];
};
pub type ACCESS_REASONS = _ACCESS_REASONS;
pub type PACCESS_REASONS = *mut _ACCESS_REASONS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SE_SECURITY_DESCRIPTOR {
    pub Size: DWORD,
    pub Flags: DWORD,
    pub SecurityDescriptor: PSECURITY_DESCRIPTOR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SE_SECURITY_DESCRIPTOR"][::std::mem::size_of::<_SE_SECURITY_DESCRIPTOR>() - 16usize];
    ["Alignment of _SE_SECURITY_DESCRIPTOR"]
        [::std::mem::align_of::<_SE_SECURITY_DESCRIPTOR>() - 8usize];
    ["Offset of field: _SE_SECURITY_DESCRIPTOR::Size"]
        [::std::mem::offset_of!(_SE_SECURITY_DESCRIPTOR, Size) - 0usize];
    ["Offset of field: _SE_SECURITY_DESCRIPTOR::Flags"]
        [::std::mem::offset_of!(_SE_SECURITY_DESCRIPTOR, Flags) - 4usize];
    ["Offset of field: _SE_SECURITY_DESCRIPTOR::SecurityDescriptor"]
        [::std::mem::offset_of!(_SE_SECURITY_DESCRIPTOR, SecurityDescriptor) - 8usize];
};
pub type SE_SECURITY_DESCRIPTOR = _SE_SECURITY_DESCRIPTOR;
pub type PSE_SECURITY_DESCRIPTOR = *mut _SE_SECURITY_DESCRIPTOR;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SE_ACCESS_REQUEST {
    pub Size: DWORD,
    pub SeSecurityDescriptor: PSE_SECURITY_DESCRIPTOR,
    pub DesiredAccess: ACCESS_MASK,
    pub PreviouslyGrantedAccess: ACCESS_MASK,
    pub PrincipalSelfSid: PSID,
    pub GenericMapping: PGENERIC_MAPPING,
    pub ObjectTypeListCount: DWORD,
    pub ObjectTypeList: POBJECT_TYPE_LIST,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SE_ACCESS_REQUEST"][::std::mem::size_of::<_SE_ACCESS_REQUEST>() - 56usize];
    ["Alignment of _SE_ACCESS_REQUEST"][::std::mem::align_of::<_SE_ACCESS_REQUEST>() - 8usize];
    ["Offset of field: _SE_ACCESS_REQUEST::Size"]
        [::std::mem::offset_of!(_SE_ACCESS_REQUEST, Size) - 0usize];
    ["Offset of field: _SE_ACCESS_REQUEST::SeSecurityDescriptor"]
        [::std::mem::offset_of!(_SE_ACCESS_REQUEST, SeSecurityDescriptor) - 8usize];
    ["Offset of field: _SE_ACCESS_REQUEST::DesiredAccess"]
        [::std::mem::offset_of!(_SE_ACCESS_REQUEST, DesiredAccess) - 16usize];
    ["Offset of field: _SE_ACCESS_REQUEST::PreviouslyGrantedAccess"]
        [::std::mem::offset_of!(_SE_ACCESS_REQUEST, PreviouslyGrantedAccess) - 20usize];
    ["Offset of field: _SE_ACCESS_REQUEST::PrincipalSelfSid"]
        [::std::mem::offset_of!(_SE_ACCESS_REQUEST, PrincipalSelfSid) - 24usize];
    ["Offset of field: _SE_ACCESS_REQUEST::GenericMapping"]
        [::std::mem::offset_of!(_SE_ACCESS_REQUEST, GenericMapping) - 32usize];
    ["Offset of field: _SE_ACCESS_REQUEST::ObjectTypeListCount"]
        [::std::mem::offset_of!(_SE_ACCESS_REQUEST, ObjectTypeListCount) - 40usize];
    ["Offset of field: _SE_ACCESS_REQUEST::ObjectTypeList"]
        [::std::mem::offset_of!(_SE_ACCESS_REQUEST, ObjectTypeList) - 48usize];
};
pub type SE_ACCESS_REQUEST = _SE_ACCESS_REQUEST;
pub type PSE_ACCESS_REQUEST = *mut _SE_ACCESS_REQUEST;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SE_ACCESS_REPLY {
    pub Size: DWORD,
    pub ResultListCount: DWORD,
    pub GrantedAccess: PACCESS_MASK,
    pub AccessStatus: PDWORD,
    pub AccessReason: PACCESS_REASONS,
    pub Privileges: *mut PPRIVILEGE_SET,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SE_ACCESS_REPLY"][::std::mem::size_of::<_SE_ACCESS_REPLY>() - 40usize];
    ["Alignment of _SE_ACCESS_REPLY"][::std::mem::align_of::<_SE_ACCESS_REPLY>() - 8usize];
    ["Offset of field: _SE_ACCESS_REPLY::Size"]
        [::std::mem::offset_of!(_SE_ACCESS_REPLY, Size) - 0usize];
    ["Offset of field: _SE_ACCESS_REPLY::ResultListCount"]
        [::std::mem::offset_of!(_SE_ACCESS_REPLY, ResultListCount) - 4usize];
    ["Offset of field: _SE_ACCESS_REPLY::GrantedAccess"]
        [::std::mem::offset_of!(_SE_ACCESS_REPLY, GrantedAccess) - 8usize];
    ["Offset of field: _SE_ACCESS_REPLY::AccessStatus"]
        [::std::mem::offset_of!(_SE_ACCESS_REPLY, AccessStatus) - 16usize];
    ["Offset of field: _SE_ACCESS_REPLY::AccessReason"]
        [::std::mem::offset_of!(_SE_ACCESS_REPLY, AccessReason) - 24usize];
    ["Offset of field: _SE_ACCESS_REPLY::Privileges"]
        [::std::mem::offset_of!(_SE_ACCESS_REPLY, Privileges) - 32usize];
};
pub type SE_ACCESS_REPLY = _SE_ACCESS_REPLY;
pub type PSE_ACCESS_REPLY = *mut _SE_ACCESS_REPLY;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityAnonymous: _SECURITY_IMPERSONATION_LEVEL = 0;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityIdentification: _SECURITY_IMPERSONATION_LEVEL = 1;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityImpersonation: _SECURITY_IMPERSONATION_LEVEL = 2;
pub const _SECURITY_IMPERSONATION_LEVEL_SecurityDelegation: _SECURITY_IMPERSONATION_LEVEL = 3;
pub type _SECURITY_IMPERSONATION_LEVEL = ::std::os::raw::c_int;
pub use self::_SECURITY_IMPERSONATION_LEVEL as SECURITY_IMPERSONATION_LEVEL;
pub type PSECURITY_IMPERSONATION_LEVEL = *mut _SECURITY_IMPERSONATION_LEVEL;
pub const _TOKEN_TYPE_TokenPrimary: _TOKEN_TYPE = 1;
pub const _TOKEN_TYPE_TokenImpersonation: _TOKEN_TYPE = 2;
pub type _TOKEN_TYPE = ::std::os::raw::c_int;
pub use self::_TOKEN_TYPE as TOKEN_TYPE;
pub type PTOKEN_TYPE = *mut TOKEN_TYPE;
pub const _TOKEN_ELEVATION_TYPE_TokenElevationTypeDefault: _TOKEN_ELEVATION_TYPE = 1;
pub const _TOKEN_ELEVATION_TYPE_TokenElevationTypeFull: _TOKEN_ELEVATION_TYPE = 2;
pub const _TOKEN_ELEVATION_TYPE_TokenElevationTypeLimited: _TOKEN_ELEVATION_TYPE = 3;
pub type _TOKEN_ELEVATION_TYPE = ::std::os::raw::c_int;
pub use self::_TOKEN_ELEVATION_TYPE as TOKEN_ELEVATION_TYPE;
pub type PTOKEN_ELEVATION_TYPE = *mut _TOKEN_ELEVATION_TYPE;
pub const _TOKEN_INFORMATION_CLASS_TokenUser: _TOKEN_INFORMATION_CLASS = 1;
pub const _TOKEN_INFORMATION_CLASS_TokenGroups: _TOKEN_INFORMATION_CLASS = 2;
pub const _TOKEN_INFORMATION_CLASS_TokenPrivileges: _TOKEN_INFORMATION_CLASS = 3;
pub const _TOKEN_INFORMATION_CLASS_TokenOwner: _TOKEN_INFORMATION_CLASS = 4;
pub const _TOKEN_INFORMATION_CLASS_TokenPrimaryGroup: _TOKEN_INFORMATION_CLASS = 5;
pub const _TOKEN_INFORMATION_CLASS_TokenDefaultDacl: _TOKEN_INFORMATION_CLASS = 6;
pub const _TOKEN_INFORMATION_CLASS_TokenSource: _TOKEN_INFORMATION_CLASS = 7;
pub const _TOKEN_INFORMATION_CLASS_TokenType: _TOKEN_INFORMATION_CLASS = 8;
pub const _TOKEN_INFORMATION_CLASS_TokenImpersonationLevel: _TOKEN_INFORMATION_CLASS = 9;
pub const _TOKEN_INFORMATION_CLASS_TokenStatistics: _TOKEN_INFORMATION_CLASS = 10;
pub const _TOKEN_INFORMATION_CLASS_TokenRestrictedSids: _TOKEN_INFORMATION_CLASS = 11;
pub const _TOKEN_INFORMATION_CLASS_TokenSessionId: _TOKEN_INFORMATION_CLASS = 12;
pub const _TOKEN_INFORMATION_CLASS_TokenGroupsAndPrivileges: _TOKEN_INFORMATION_CLASS = 13;
pub const _TOKEN_INFORMATION_CLASS_TokenSessionReference: _TOKEN_INFORMATION_CLASS = 14;
pub const _TOKEN_INFORMATION_CLASS_TokenSandBoxInert: _TOKEN_INFORMATION_CLASS = 15;
pub const _TOKEN_INFORMATION_CLASS_TokenAuditPolicy: _TOKEN_INFORMATION_CLASS = 16;
pub const _TOKEN_INFORMATION_CLASS_TokenOrigin: _TOKEN_INFORMATION_CLASS = 17;
pub const _TOKEN_INFORMATION_CLASS_TokenElevationType: _TOKEN_INFORMATION_CLASS = 18;
pub const _TOKEN_INFORMATION_CLASS_TokenLinkedToken: _TOKEN_INFORMATION_CLASS = 19;
pub const _TOKEN_INFORMATION_CLASS_TokenElevation: _TOKEN_INFORMATION_CLASS = 20;
pub const _TOKEN_INFORMATION_CLASS_TokenHasRestrictions: _TOKEN_INFORMATION_CLASS = 21;
pub const _TOKEN_INFORMATION_CLASS_TokenAccessInformation: _TOKEN_INFORMATION_CLASS = 22;
pub const _TOKEN_INFORMATION_CLASS_TokenVirtualizationAllowed: _TOKEN_INFORMATION_CLASS = 23;
pub const _TOKEN_INFORMATION_CLASS_TokenVirtualizationEnabled: _TOKEN_INFORMATION_CLASS = 24;
pub const _TOKEN_INFORMATION_CLASS_TokenIntegrityLevel: _TOKEN_INFORMATION_CLASS = 25;
pub const _TOKEN_INFORMATION_CLASS_TokenUIAccess: _TOKEN_INFORMATION_CLASS = 26;
pub const _TOKEN_INFORMATION_CLASS_TokenMandatoryPolicy: _TOKEN_INFORMATION_CLASS = 27;
pub const _TOKEN_INFORMATION_CLASS_TokenLogonSid: _TOKEN_INFORMATION_CLASS = 28;
pub const _TOKEN_INFORMATION_CLASS_TokenIsAppContainer: _TOKEN_INFORMATION_CLASS = 29;
pub const _TOKEN_INFORMATION_CLASS_TokenCapabilities: _TOKEN_INFORMATION_CLASS = 30;
pub const _TOKEN_INFORMATION_CLASS_TokenAppContainerSid: _TOKEN_INFORMATION_CLASS = 31;
pub const _TOKEN_INFORMATION_CLASS_TokenAppContainerNumber: _TOKEN_INFORMATION_CLASS = 32;
pub const _TOKEN_INFORMATION_CLASS_TokenUserClaimAttributes: _TOKEN_INFORMATION_CLASS = 33;
pub const _TOKEN_INFORMATION_CLASS_TokenDeviceClaimAttributes: _TOKEN_INFORMATION_CLASS = 34;
pub const _TOKEN_INFORMATION_CLASS_TokenRestrictedUserClaimAttributes: _TOKEN_INFORMATION_CLASS =
    35;
pub const _TOKEN_INFORMATION_CLASS_TokenRestrictedDeviceClaimAttributes: _TOKEN_INFORMATION_CLASS =
    36;
pub const _TOKEN_INFORMATION_CLASS_TokenDeviceGroups: _TOKEN_INFORMATION_CLASS = 37;
pub const _TOKEN_INFORMATION_CLASS_TokenRestrictedDeviceGroups: _TOKEN_INFORMATION_CLASS = 38;
pub const _TOKEN_INFORMATION_CLASS_TokenSecurityAttributes: _TOKEN_INFORMATION_CLASS = 39;
pub const _TOKEN_INFORMATION_CLASS_TokenIsRestricted: _TOKEN_INFORMATION_CLASS = 40;
pub const _TOKEN_INFORMATION_CLASS_TokenProcessTrustLevel: _TOKEN_INFORMATION_CLASS = 41;
pub const _TOKEN_INFORMATION_CLASS_TokenPrivateNameSpace: _TOKEN_INFORMATION_CLASS = 42;
pub const _TOKEN_INFORMATION_CLASS_TokenSingletonAttributes: _TOKEN_INFORMATION_CLASS = 43;
pub const _TOKEN_INFORMATION_CLASS_TokenBnoIsolation: _TOKEN_INFORMATION_CLASS = 44;
pub const _TOKEN_INFORMATION_CLASS_TokenChildProcessFlags: _TOKEN_INFORMATION_CLASS = 45;
pub const _TOKEN_INFORMATION_CLASS_TokenIsLessPrivilegedAppContainer: _TOKEN_INFORMATION_CLASS = 46;
pub const _TOKEN_INFORMATION_CLASS_TokenIsSandboxed: _TOKEN_INFORMATION_CLASS = 47;
pub const _TOKEN_INFORMATION_CLASS_TokenIsAppSilo: _TOKEN_INFORMATION_CLASS = 48;
pub const _TOKEN_INFORMATION_CLASS_TokenLoggingInformation: _TOKEN_INFORMATION_CLASS = 49;
pub const _TOKEN_INFORMATION_CLASS_MaxTokenInfoClass: _TOKEN_INFORMATION_CLASS = 50;
pub type _TOKEN_INFORMATION_CLASS = ::std::os::raw::c_int;
pub use self::_TOKEN_INFORMATION_CLASS as TOKEN_INFORMATION_CLASS;
pub type PTOKEN_INFORMATION_CLASS = *mut _TOKEN_INFORMATION_CLASS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_USER {
    pub User: SID_AND_ATTRIBUTES,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_USER"][::std::mem::size_of::<_TOKEN_USER>() - 16usize];
    ["Alignment of _TOKEN_USER"][::std::mem::align_of::<_TOKEN_USER>() - 8usize];
    ["Offset of field: _TOKEN_USER::User"][::std::mem::offset_of!(_TOKEN_USER, User) - 0usize];
};
pub type TOKEN_USER = _TOKEN_USER;
pub type PTOKEN_USER = *mut _TOKEN_USER;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _SE_TOKEN_USER {
    pub __bindgen_anon_1: _SE_TOKEN_USER__bindgen_ty_1,
    pub __bindgen_anon_2: _SE_TOKEN_USER__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SE_TOKEN_USER__bindgen_ty_1 {
    pub TokenUser: TOKEN_USER,
    pub User: SID_AND_ATTRIBUTES,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SE_TOKEN_USER__bindgen_ty_1"]
        [::std::mem::size_of::<_SE_TOKEN_USER__bindgen_ty_1>() - 16usize];
    ["Alignment of _SE_TOKEN_USER__bindgen_ty_1"]
        [::std::mem::align_of::<_SE_TOKEN_USER__bindgen_ty_1>() - 8usize];
    ["Offset of field: _SE_TOKEN_USER__bindgen_ty_1::TokenUser"]
        [::std::mem::offset_of!(_SE_TOKEN_USER__bindgen_ty_1, TokenUser) - 0usize];
    ["Offset of field: _SE_TOKEN_USER__bindgen_ty_1::User"]
        [::std::mem::offset_of!(_SE_TOKEN_USER__bindgen_ty_1, User) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _SE_TOKEN_USER__bindgen_ty_2 {
    pub Sid: SID,
    pub Buffer: [BYTE; 68usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SE_TOKEN_USER__bindgen_ty_2"]
        [::std::mem::size_of::<_SE_TOKEN_USER__bindgen_ty_2>() - 68usize];
    ["Alignment of _SE_TOKEN_USER__bindgen_ty_2"]
        [::std::mem::align_of::<_SE_TOKEN_USER__bindgen_ty_2>() - 4usize];
    ["Offset of field: _SE_TOKEN_USER__bindgen_ty_2::Sid"]
        [::std::mem::offset_of!(_SE_TOKEN_USER__bindgen_ty_2, Sid) - 0usize];
    ["Offset of field: _SE_TOKEN_USER__bindgen_ty_2::Buffer"]
        [::std::mem::offset_of!(_SE_TOKEN_USER__bindgen_ty_2, Buffer) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _SE_TOKEN_USER"][::std::mem::size_of::<_SE_TOKEN_USER>() - 88usize];
    ["Alignment of _SE_TOKEN_USER"][::std::mem::align_of::<_SE_TOKEN_USER>() - 8usize];
};
pub type SE_TOKEN_USER = _SE_TOKEN_USER;
pub type PSE_TOKEN_USER = _SE_TOKEN_USER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_GROUPS {
    pub GroupCount: DWORD,
    pub Groups: [SID_AND_ATTRIBUTES; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_GROUPS"][::std::mem::size_of::<_TOKEN_GROUPS>() - 24usize];
    ["Alignment of _TOKEN_GROUPS"][::std::mem::align_of::<_TOKEN_GROUPS>() - 8usize];
    ["Offset of field: _TOKEN_GROUPS::GroupCount"]
        [::std::mem::offset_of!(_TOKEN_GROUPS, GroupCount) - 0usize];
    ["Offset of field: _TOKEN_GROUPS::Groups"]
        [::std::mem::offset_of!(_TOKEN_GROUPS, Groups) - 8usize];
};
pub type TOKEN_GROUPS = _TOKEN_GROUPS;
pub type PTOKEN_GROUPS = *mut _TOKEN_GROUPS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_PRIVILEGES {
    pub PrivilegeCount: DWORD,
    pub Privileges: [LUID_AND_ATTRIBUTES; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_PRIVILEGES"][::std::mem::size_of::<_TOKEN_PRIVILEGES>() - 16usize];
    ["Alignment of _TOKEN_PRIVILEGES"][::std::mem::align_of::<_TOKEN_PRIVILEGES>() - 4usize];
    ["Offset of field: _TOKEN_PRIVILEGES::PrivilegeCount"]
        [::std::mem::offset_of!(_TOKEN_PRIVILEGES, PrivilegeCount) - 0usize];
    ["Offset of field: _TOKEN_PRIVILEGES::Privileges"]
        [::std::mem::offset_of!(_TOKEN_PRIVILEGES, Privileges) - 4usize];
};
pub type TOKEN_PRIVILEGES = _TOKEN_PRIVILEGES;
pub type PTOKEN_PRIVILEGES = *mut _TOKEN_PRIVILEGES;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_OWNER {
    pub Owner: PSID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_OWNER"][::std::mem::size_of::<_TOKEN_OWNER>() - 8usize];
    ["Alignment of _TOKEN_OWNER"][::std::mem::align_of::<_TOKEN_OWNER>() - 8usize];
    ["Offset of field: _TOKEN_OWNER::Owner"][::std::mem::offset_of!(_TOKEN_OWNER, Owner) - 0usize];
};
pub type TOKEN_OWNER = _TOKEN_OWNER;
pub type PTOKEN_OWNER = *mut _TOKEN_OWNER;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_PRIMARY_GROUP {
    pub PrimaryGroup: PSID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_PRIMARY_GROUP"][::std::mem::size_of::<_TOKEN_PRIMARY_GROUP>() - 8usize];
    ["Alignment of _TOKEN_PRIMARY_GROUP"][::std::mem::align_of::<_TOKEN_PRIMARY_GROUP>() - 8usize];
    ["Offset of field: _TOKEN_PRIMARY_GROUP::PrimaryGroup"]
        [::std::mem::offset_of!(_TOKEN_PRIMARY_GROUP, PrimaryGroup) - 0usize];
};
pub type TOKEN_PRIMARY_GROUP = _TOKEN_PRIMARY_GROUP;
pub type PTOKEN_PRIMARY_GROUP = *mut _TOKEN_PRIMARY_GROUP;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_DEFAULT_DACL {
    pub DefaultDacl: PACL,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_DEFAULT_DACL"][::std::mem::size_of::<_TOKEN_DEFAULT_DACL>() - 8usize];
    ["Alignment of _TOKEN_DEFAULT_DACL"][::std::mem::align_of::<_TOKEN_DEFAULT_DACL>() - 8usize];
    ["Offset of field: _TOKEN_DEFAULT_DACL::DefaultDacl"]
        [::std::mem::offset_of!(_TOKEN_DEFAULT_DACL, DefaultDacl) - 0usize];
};
pub type TOKEN_DEFAULT_DACL = _TOKEN_DEFAULT_DACL;
pub type PTOKEN_DEFAULT_DACL = *mut _TOKEN_DEFAULT_DACL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_USER_CLAIMS {
    pub UserClaims: PCLAIMS_BLOB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_USER_CLAIMS"][::std::mem::size_of::<_TOKEN_USER_CLAIMS>() - 8usize];
    ["Alignment of _TOKEN_USER_CLAIMS"][::std::mem::align_of::<_TOKEN_USER_CLAIMS>() - 8usize];
    ["Offset of field: _TOKEN_USER_CLAIMS::UserClaims"]
        [::std::mem::offset_of!(_TOKEN_USER_CLAIMS, UserClaims) - 0usize];
};
pub type TOKEN_USER_CLAIMS = _TOKEN_USER_CLAIMS;
pub type PTOKEN_USER_CLAIMS = *mut _TOKEN_USER_CLAIMS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_DEVICE_CLAIMS {
    pub DeviceClaims: PCLAIMS_BLOB,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_DEVICE_CLAIMS"][::std::mem::size_of::<_TOKEN_DEVICE_CLAIMS>() - 8usize];
    ["Alignment of _TOKEN_DEVICE_CLAIMS"][::std::mem::align_of::<_TOKEN_DEVICE_CLAIMS>() - 8usize];
    ["Offset of field: _TOKEN_DEVICE_CLAIMS::DeviceClaims"]
        [::std::mem::offset_of!(_TOKEN_DEVICE_CLAIMS, DeviceClaims) - 0usize];
};
pub type TOKEN_DEVICE_CLAIMS = _TOKEN_DEVICE_CLAIMS;
pub type PTOKEN_DEVICE_CLAIMS = *mut _TOKEN_DEVICE_CLAIMS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_GROUPS_AND_PRIVILEGES {
    pub SidCount: DWORD,
    pub SidLength: DWORD,
    pub Sids: PSID_AND_ATTRIBUTES,
    pub RestrictedSidCount: DWORD,
    pub RestrictedSidLength: DWORD,
    pub RestrictedSids: PSID_AND_ATTRIBUTES,
    pub PrivilegeCount: DWORD,
    pub PrivilegeLength: DWORD,
    pub Privileges: PLUID_AND_ATTRIBUTES,
    pub AuthenticationId: LUID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_GROUPS_AND_PRIVILEGES"]
        [::std::mem::size_of::<_TOKEN_GROUPS_AND_PRIVILEGES>() - 56usize];
    ["Alignment of _TOKEN_GROUPS_AND_PRIVILEGES"]
        [::std::mem::align_of::<_TOKEN_GROUPS_AND_PRIVILEGES>() - 8usize];
    ["Offset of field: _TOKEN_GROUPS_AND_PRIVILEGES::SidCount"]
        [::std::mem::offset_of!(_TOKEN_GROUPS_AND_PRIVILEGES, SidCount) - 0usize];
    ["Offset of field: _TOKEN_GROUPS_AND_PRIVILEGES::SidLength"]
        [::std::mem::offset_of!(_TOKEN_GROUPS_AND_PRIVILEGES, SidLength) - 4usize];
    ["Offset of field: _TOKEN_GROUPS_AND_PRIVILEGES::Sids"]
        [::std::mem::offset_of!(_TOKEN_GROUPS_AND_PRIVILEGES, Sids) - 8usize];
    ["Offset of field: _TOKEN_GROUPS_AND_PRIVILEGES::RestrictedSidCount"]
        [::std::mem::offset_of!(_TOKEN_GROUPS_AND_PRIVILEGES, RestrictedSidCount) - 16usize];
    ["Offset of field: _TOKEN_GROUPS_AND_PRIVILEGES::RestrictedSidLength"]
        [::std::mem::offset_of!(_TOKEN_GROUPS_AND_PRIVILEGES, RestrictedSidLength) - 20usize];
    ["Offset of field: _TOKEN_GROUPS_AND_PRIVILEGES::RestrictedSids"]
        [::std::mem::offset_of!(_TOKEN_GROUPS_AND_PRIVILEGES, RestrictedSids) - 24usize];
    ["Offset of field: _TOKEN_GROUPS_AND_PRIVILEGES::PrivilegeCount"]
        [::std::mem::offset_of!(_TOKEN_GROUPS_AND_PRIVILEGES, PrivilegeCount) - 32usize];
    ["Offset of field: _TOKEN_GROUPS_AND_PRIVILEGES::PrivilegeLength"]
        [::std::mem::offset_of!(_TOKEN_GROUPS_AND_PRIVILEGES, PrivilegeLength) - 36usize];
    ["Offset of field: _TOKEN_GROUPS_AND_PRIVILEGES::Privileges"]
        [::std::mem::offset_of!(_TOKEN_GROUPS_AND_PRIVILEGES, Privileges) - 40usize];
    ["Offset of field: _TOKEN_GROUPS_AND_PRIVILEGES::AuthenticationId"]
        [::std::mem::offset_of!(_TOKEN_GROUPS_AND_PRIVILEGES, AuthenticationId) - 48usize];
};
pub type TOKEN_GROUPS_AND_PRIVILEGES = _TOKEN_GROUPS_AND_PRIVILEGES;
pub type PTOKEN_GROUPS_AND_PRIVILEGES = *mut _TOKEN_GROUPS_AND_PRIVILEGES;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_LINKED_TOKEN {
    pub LinkedToken: HANDLE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_LINKED_TOKEN"][::std::mem::size_of::<_TOKEN_LINKED_TOKEN>() - 8usize];
    ["Alignment of _TOKEN_LINKED_TOKEN"][::std::mem::align_of::<_TOKEN_LINKED_TOKEN>() - 8usize];
    ["Offset of field: _TOKEN_LINKED_TOKEN::LinkedToken"]
        [::std::mem::offset_of!(_TOKEN_LINKED_TOKEN, LinkedToken) - 0usize];
};
pub type TOKEN_LINKED_TOKEN = _TOKEN_LINKED_TOKEN;
pub type PTOKEN_LINKED_TOKEN = *mut _TOKEN_LINKED_TOKEN;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_ELEVATION {
    pub TokenIsElevated: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_ELEVATION"][::std::mem::size_of::<_TOKEN_ELEVATION>() - 4usize];
    ["Alignment of _TOKEN_ELEVATION"][::std::mem::align_of::<_TOKEN_ELEVATION>() - 4usize];
    ["Offset of field: _TOKEN_ELEVATION::TokenIsElevated"]
        [::std::mem::offset_of!(_TOKEN_ELEVATION, TokenIsElevated) - 0usize];
};
pub type TOKEN_ELEVATION = _TOKEN_ELEVATION;
pub type PTOKEN_ELEVATION = *mut _TOKEN_ELEVATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_MANDATORY_LABEL {
    pub Label: SID_AND_ATTRIBUTES,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_MANDATORY_LABEL"][::std::mem::size_of::<_TOKEN_MANDATORY_LABEL>() - 16usize];
    ["Alignment of _TOKEN_MANDATORY_LABEL"]
        [::std::mem::align_of::<_TOKEN_MANDATORY_LABEL>() - 8usize];
    ["Offset of field: _TOKEN_MANDATORY_LABEL::Label"]
        [::std::mem::offset_of!(_TOKEN_MANDATORY_LABEL, Label) - 0usize];
};
pub type TOKEN_MANDATORY_LABEL = _TOKEN_MANDATORY_LABEL;
pub type PTOKEN_MANDATORY_LABEL = *mut _TOKEN_MANDATORY_LABEL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_MANDATORY_POLICY {
    pub Policy: DWORD,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_MANDATORY_POLICY"][::std::mem::size_of::<_TOKEN_MANDATORY_POLICY>() - 4usize];
    ["Alignment of _TOKEN_MANDATORY_POLICY"]
        [::std::mem::align_of::<_TOKEN_MANDATORY_POLICY>() - 4usize];
    ["Offset of field: _TOKEN_MANDATORY_POLICY::Policy"]
        [::std::mem::offset_of!(_TOKEN_MANDATORY_POLICY, Policy) - 0usize];
};
pub type TOKEN_MANDATORY_POLICY = _TOKEN_MANDATORY_POLICY;
pub type PTOKEN_MANDATORY_POLICY = *mut _TOKEN_MANDATORY_POLICY;
pub type PSECURITY_ATTRIBUTES_OPAQUE = PVOID;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_ACCESS_INFORMATION {
    pub SidHash: PSID_AND_ATTRIBUTES_HASH,
    pub RestrictedSidHash: PSID_AND_ATTRIBUTES_HASH,
    pub Privileges: PTOKEN_PRIVILEGES,
    pub AuthenticationId: LUID,
    pub TokenType: TOKEN_TYPE,
    pub ImpersonationLevel: SECURITY_IMPERSONATION_LEVEL,
    pub MandatoryPolicy: TOKEN_MANDATORY_POLICY,
    pub Flags: DWORD,
    pub AppContainerNumber: DWORD,
    pub PackageSid: PSID,
    pub CapabilitiesHash: PSID_AND_ATTRIBUTES_HASH,
    pub TrustLevelSid: PSID,
    pub SecurityAttributes: PSECURITY_ATTRIBUTES_OPAQUE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_ACCESS_INFORMATION"]
        [::std::mem::size_of::<_TOKEN_ACCESS_INFORMATION>() - 88usize];
    ["Alignment of _TOKEN_ACCESS_INFORMATION"]
        [::std::mem::align_of::<_TOKEN_ACCESS_INFORMATION>() - 8usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::SidHash"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, SidHash) - 0usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::RestrictedSidHash"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, RestrictedSidHash) - 8usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::Privileges"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, Privileges) - 16usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::AuthenticationId"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, AuthenticationId) - 24usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::TokenType"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, TokenType) - 32usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::ImpersonationLevel"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, ImpersonationLevel) - 36usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::MandatoryPolicy"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, MandatoryPolicy) - 40usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::Flags"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, Flags) - 44usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::AppContainerNumber"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, AppContainerNumber) - 48usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::PackageSid"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, PackageSid) - 56usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::CapabilitiesHash"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, CapabilitiesHash) - 64usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::TrustLevelSid"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, TrustLevelSid) - 72usize];
    ["Offset of field: _TOKEN_ACCESS_INFORMATION::SecurityAttributes"]
        [::std::mem::offset_of!(_TOKEN_ACCESS_INFORMATION, SecurityAttributes) - 80usize];
};
pub type TOKEN_ACCESS_INFORMATION = _TOKEN_ACCESS_INFORMATION;
pub type PTOKEN_ACCESS_INFORMATION = *mut _TOKEN_ACCESS_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_LOGGING_INFORMATION {
    pub TokenType: TOKEN_TYPE,
    pub TokenElevation: TOKEN_ELEVATION,
    pub TokenElevationType: TOKEN_ELEVATION_TYPE,
    pub ImpersonationLevel: SECURITY_IMPERSONATION_LEVEL,
    pub IntegrityLevel: DWORD,
    pub User: SID_AND_ATTRIBUTES,
    pub TrustLevelSid: PSID,
    pub SessionId: DWORD,
    pub AppContainerNumber: DWORD,
    pub AuthenticationId: LUID,
    pub GroupCount: DWORD,
    pub GroupsLength: DWORD,
    pub Groups: PSID_AND_ATTRIBUTES,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_LOGGING_INFORMATION"]
        [::std::mem::size_of::<_TOKEN_LOGGING_INFORMATION>() - 80usize];
    ["Alignment of _TOKEN_LOGGING_INFORMATION"]
        [::std::mem::align_of::<_TOKEN_LOGGING_INFORMATION>() - 8usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::TokenType"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, TokenType) - 0usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::TokenElevation"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, TokenElevation) - 4usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::TokenElevationType"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, TokenElevationType) - 8usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::ImpersonationLevel"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, ImpersonationLevel) - 12usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::IntegrityLevel"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, IntegrityLevel) - 16usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::User"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, User) - 24usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::TrustLevelSid"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, TrustLevelSid) - 40usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::SessionId"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, SessionId) - 48usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::AppContainerNumber"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, AppContainerNumber) - 52usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::AuthenticationId"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, AuthenticationId) - 56usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::GroupCount"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, GroupCount) - 64usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::GroupsLength"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, GroupsLength) - 68usize];
    ["Offset of field: _TOKEN_LOGGING_INFORMATION::Groups"]
        [::std::mem::offset_of!(_TOKEN_LOGGING_INFORMATION, Groups) - 72usize];
};
pub type TOKEN_LOGGING_INFORMATION = _TOKEN_LOGGING_INFORMATION;
pub type PTOKEN_LOGGING_INFORMATION = *mut _TOKEN_LOGGING_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_AUDIT_POLICY {
    pub PerUserPolicy: [BYTE; 30usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_AUDIT_POLICY"][::std::mem::size_of::<_TOKEN_AUDIT_POLICY>() - 30usize];
    ["Alignment of _TOKEN_AUDIT_POLICY"][::std::mem::align_of::<_TOKEN_AUDIT_POLICY>() - 1usize];
    ["Offset of field: _TOKEN_AUDIT_POLICY::PerUserPolicy"]
        [::std::mem::offset_of!(_TOKEN_AUDIT_POLICY, PerUserPolicy) - 0usize];
};
pub type TOKEN_AUDIT_POLICY = _TOKEN_AUDIT_POLICY;
pub type PTOKEN_AUDIT_POLICY = *mut _TOKEN_AUDIT_POLICY;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_SOURCE {
    pub SourceName: [CHAR; 8usize],
    pub SourceIdentifier: LUID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_SOURCE"][::std::mem::size_of::<_TOKEN_SOURCE>() - 16usize];
    ["Alignment of _TOKEN_SOURCE"][::std::mem::align_of::<_TOKEN_SOURCE>() - 4usize];
    ["Offset of field: _TOKEN_SOURCE::SourceName"]
        [::std::mem::offset_of!(_TOKEN_SOURCE, SourceName) - 0usize];
    ["Offset of field: _TOKEN_SOURCE::SourceIdentifier"]
        [::std::mem::offset_of!(_TOKEN_SOURCE, SourceIdentifier) - 8usize];
};
pub type TOKEN_SOURCE = _TOKEN_SOURCE;
pub type PTOKEN_SOURCE = *mut _TOKEN_SOURCE;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _TOKEN_STATISTICS {
    pub TokenId: LUID,
    pub AuthenticationId: LUID,
    pub ExpirationTime: LARGE_INTEGER,
    pub TokenType: TOKEN_TYPE,
    pub ImpersonationLevel: SECURITY_IMPERSONATION_LEVEL,
    pub DynamicCharged: DWORD,
    pub DynamicAvailable: DWORD,
    pub GroupCount: DWORD,
    pub PrivilegeCount: DWORD,
    pub ModifiedId: LUID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_STATISTICS"][::std::mem::size_of::<_TOKEN_STATISTICS>() - 56usize];
    ["Alignment of _TOKEN_STATISTICS"][::std::mem::align_of::<_TOKEN_STATISTICS>() - 8usize];
    ["Offset of field: _TOKEN_STATISTICS::TokenId"]
        [::std::mem::offset_of!(_TOKEN_STATISTICS, TokenId) - 0usize];
    ["Offset of field: _TOKEN_STATISTICS::AuthenticationId"]
        [::std::mem::offset_of!(_TOKEN_STATISTICS, AuthenticationId) - 8usize];
    ["Offset of field: _TOKEN_STATISTICS::ExpirationTime"]
        [::std::mem::offset_of!(_TOKEN_STATISTICS, ExpirationTime) - 16usize];
    ["Offset of field: _TOKEN_STATISTICS::TokenType"]
        [::std::mem::offset_of!(_TOKEN_STATISTICS, TokenType) - 24usize];
    ["Offset of field: _TOKEN_STATISTICS::ImpersonationLevel"]
        [::std::mem::offset_of!(_TOKEN_STATISTICS, ImpersonationLevel) - 28usize];
    ["Offset of field: _TOKEN_STATISTICS::DynamicCharged"]
        [::std::mem::offset_of!(_TOKEN_STATISTICS, DynamicCharged) - 32usize];
    ["Offset of field: _TOKEN_STATISTICS::DynamicAvailable"]
        [::std::mem::offset_of!(_TOKEN_STATISTICS, DynamicAvailable) - 36usize];
    ["Offset of field: _TOKEN_STATISTICS::GroupCount"]
        [::std::mem::offset_of!(_TOKEN_STATISTICS, GroupCount) - 40usize];
    ["Offset of field: _TOKEN_STATISTICS::PrivilegeCount"]
        [::std::mem::offset_of!(_TOKEN_STATISTICS, PrivilegeCount) - 44usize];
    ["Offset of field: _TOKEN_STATISTICS::ModifiedId"]
        [::std::mem::offset_of!(_TOKEN_STATISTICS, ModifiedId) - 48usize];
};
pub type TOKEN_STATISTICS = _TOKEN_STATISTICS;
pub type PTOKEN_STATISTICS = *mut _TOKEN_STATISTICS;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_CONTROL {
    pub TokenId: LUID,
    pub AuthenticationId: LUID,
    pub ModifiedId: LUID,
    pub TokenSource: TOKEN_SOURCE,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_CONTROL"][::std::mem::size_of::<_TOKEN_CONTROL>() - 40usize];
    ["Alignment of _TOKEN_CONTROL"][::std::mem::align_of::<_TOKEN_CONTROL>() - 4usize];
    ["Offset of field: _TOKEN_CONTROL::TokenId"]
        [::std::mem::offset_of!(_TOKEN_CONTROL, TokenId) - 0usize];
    ["Offset of field: _TOKEN_CONTROL::AuthenticationId"]
        [::std::mem::offset_of!(_TOKEN_CONTROL, AuthenticationId) - 8usize];
    ["Offset of field: _TOKEN_CONTROL::ModifiedId"]
        [::std::mem::offset_of!(_TOKEN_CONTROL, ModifiedId) - 16usize];
    ["Offset of field: _TOKEN_CONTROL::TokenSource"]
        [::std::mem::offset_of!(_TOKEN_CONTROL, TokenSource) - 24usize];
};
pub type TOKEN_CONTROL = _TOKEN_CONTROL;
pub type PTOKEN_CONTROL = *mut _TOKEN_CONTROL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_ORIGIN {
    pub OriginatingLogonSession: LUID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_ORIGIN"][::std::mem::size_of::<_TOKEN_ORIGIN>() - 8usize];
    ["Alignment of _TOKEN_ORIGIN"][::std::mem::align_of::<_TOKEN_ORIGIN>() - 4usize];
    ["Offset of field: _TOKEN_ORIGIN::OriginatingLogonSession"]
        [::std::mem::offset_of!(_TOKEN_ORIGIN, OriginatingLogonSession) - 0usize];
};
pub type TOKEN_ORIGIN = _TOKEN_ORIGIN;
pub type PTOKEN_ORIGIN = *mut _TOKEN_ORIGIN;
pub const _MANDATORY_LEVEL_MandatoryLevelUntrusted: _MANDATORY_LEVEL = 0;
pub const _MANDATORY_LEVEL_MandatoryLevelLow: _MANDATORY_LEVEL = 1;
pub const _MANDATORY_LEVEL_MandatoryLevelMedium: _MANDATORY_LEVEL = 2;
pub const _MANDATORY_LEVEL_MandatoryLevelHigh: _MANDATORY_LEVEL = 3;
pub const _MANDATORY_LEVEL_MandatoryLevelSystem: _MANDATORY_LEVEL = 4;
pub const _MANDATORY_LEVEL_MandatoryLevelSecureProcess: _MANDATORY_LEVEL = 5;
pub const _MANDATORY_LEVEL_MandatoryLevelCount: _MANDATORY_LEVEL = 6;
pub type _MANDATORY_LEVEL = ::std::os::raw::c_int;
pub use self::_MANDATORY_LEVEL as MANDATORY_LEVEL;
pub type PMANDATORY_LEVEL = *mut _MANDATORY_LEVEL;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_APPCONTAINER_INFORMATION {
    pub TokenAppContainer: PSID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_APPCONTAINER_INFORMATION"]
        [::std::mem::size_of::<_TOKEN_APPCONTAINER_INFORMATION>() - 8usize];
    ["Alignment of _TOKEN_APPCONTAINER_INFORMATION"]
        [::std::mem::align_of::<_TOKEN_APPCONTAINER_INFORMATION>() - 8usize];
    ["Offset of field: _TOKEN_APPCONTAINER_INFORMATION::TokenAppContainer"]
        [::std::mem::offset_of!(_TOKEN_APPCONTAINER_INFORMATION, TokenAppContainer) - 0usize];
};
pub type TOKEN_APPCONTAINER_INFORMATION = _TOKEN_APPCONTAINER_INFORMATION;
pub type PTOKEN_APPCONTAINER_INFORMATION = *mut _TOKEN_APPCONTAINER_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_SID_INFORMATION {
    pub Sid: PSID,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_SID_INFORMATION"][::std::mem::size_of::<_TOKEN_SID_INFORMATION>() - 8usize];
    ["Alignment of _TOKEN_SID_INFORMATION"]
        [::std::mem::align_of::<_TOKEN_SID_INFORMATION>() - 8usize];
    ["Offset of field: _TOKEN_SID_INFORMATION::Sid"]
        [::std::mem::offset_of!(_TOKEN_SID_INFORMATION, Sid) - 0usize];
};
pub type TOKEN_SID_INFORMATION = _TOKEN_SID_INFORMATION;
pub type PTOKEN_SID_INFORMATION = *mut _TOKEN_SID_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _TOKEN_BNO_ISOLATION_INFORMATION {
    pub IsolationPrefix: PWSTR,
    pub IsolationEnabled: BOOLEAN,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _TOKEN_BNO_ISOLATION_INFORMATION"]
        [::std::mem::size_of::<_TOKEN_BNO_ISOLATION_INFORMATION>() - 16usize];
    ["Alignment of _TOKEN_BNO_ISOLATION_INFORMATION"]
        [::std::mem::align_of::<_TOKEN_BNO_ISOLATION_INFORMATION>() - 8usize];
    ["Offset of field: _TOKEN_BNO_ISOLATION_INFORMATION::IsolationPrefix"]
        [::std::mem::offset_of!(_TOKEN_BNO_ISOLATION_INFORMATION, IsolationPrefix) - 0usize];
    ["Offset of field: _TOKEN_BNO_ISOLATION_INFORMATION::IsolationEnabled"]
        [::std::mem::offset_of!(_TOKEN_BNO_ISOLATION_INFORMATION, IsolationEnabled) - 8usize];
};
pub type TOKEN_BNO_ISOLATION_INFORMATION = _TOKEN_BNO_ISOLATION_INFORMATION;
pub type PTOKEN_BNO_ISOLATION_INFORMATION = *mut _TOKEN_BNO_ISOLATION_INFORMATION;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _CLAIM_SECURITY_ATTRIBUTE_FQBN_VALUE {
    pub Version: DWORD64,
    pub Name: PWSTR,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _CLAIM_SECURITY_ATTRIBUTE_FQBN_VALUE"]
        [::std::mem::size_of::<_CLAIM_SECURITY_ATTRIBUTE_FQBN_VALUE>() - 16usize];
